Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/index.po
Languages: es, ja

source: User Guide
es: Guía de usuario
ja: ユーザーガイド

source: Explore
es: Explorar
ja: 探索

source: Methods
es: Métodos
ja: 手法

source: Learn
es: Aprender
ja: 学習

source: Cite
es: Citar
ja: 引用

source: PyPI version
es: Versión de PyPI
ja: PyPIバージョン

source: Python versions
es: Versiones de Python
ja: Pythonバージョン

source: License
es: Licencia
ja: ライセンス

source: Code coverage
es: Cobertura de código
ja: コードカバレッジ

source: Downloads
es: Descargas
ja: ダウンロード数

source: Welcome to chemotools
es: Bienvenido a chemotools
ja: chemotoolsへようこそ

source: ``chemotools`` is a **Python package for spectral analysis**, designed to integrate natively with the widely adopted ``scikit-learn`` API and the broader **Python machine learning ecosystem**.
es: ``chemotools`` es un **paquete de Python para análisis espectral**, diseñado para integrarse nativamente con la ampliamente adoptada API de ``scikit-learn`` y el **ecosistema de aprendizaje automático de Python** más amplio.
ja: ``chemotools`` はスペクトル解析のためのPythonパッケージであり、広く採用されている ``scikit-learn`` APIおよびより広範なPython機械学習エコシステムとネイティブに統合するように設計されています。

source: Developed after years of applying **spectroscopy** across industries, its mission is to empower **scientists and engineers** with the tools needed to build **production-ready chemometric models**. ``chemotools`` provides an **intuitive, flexible environment** that streamlines the **development and deployment** of models, making it easier to **standardize workflows** and **scale chemometric solutions**.
es: Desarrollado tras años de aplicar **espectroscopía** en diversas industrias, su misión es empoderar a **científicos e ingenieros** con las herramientas necesarias para construir **modelos quimiométricos listos para producción**. ``chemotools`` proporciona un **entorno intuitivo y flexible** que agiliza el **desarrollo y despliegue** de modelos, facilitando la **estandarización de flujos de trabajo** y el **escalado de soluciones quimiométricas**.
ja: さまざまな業界で長年にわたり分光法を適用してきた経験から開発されたこのツールは、科学者やエンジニアが本番環境対応のケモメトリクスモデルを構築するために必要なツールを提供することを使命としています。``chemotools`` は、モデルの開発とデプロイメントを効率化する直感的で柔軟な環境を提供し、ワークフローの標準化とケモメトリクスソリューションのスケール化を容易にします。

source: chemotools workflow
es: Flujo de trabajo de chemotools
ja: chemotoolsワークフロー

source: Start exploring
es: Comenzar a explorar
ja: 探索を始める

source: Discover the environment
es: Descubre el entorno
ja: 環境を探索

source: Chemometrics tutorials
es: Tutoriales de quimiometría
ja: ケモメトリクスのチュートリアル

source: Check out our Webinar
es: Mira nuestro seminario web
ja: ウェビナーをチェック
