Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/astartes.po
Languages: es, ja, zh_cn

source: Sampling with Astartes
es: Muestreo con Astartes
ja: Astartesでのサンプリング
zh_cn: 使用Astartes进行采样

source: If you've ever wondered whether a random train/test split is really the best approach for spectroscopic data, you're not alone. Random splits can leave gaps in your calibration set or, worse, put very similar samples in both sets—leading to overly optimistic error estimates.
es: Si alguna vez te has preguntado si una división aleatoria entrenamiento/prueba es realmente el mejor enfoque para datos espectroscópicos, no estás solo. Las divisiones aleatorias pueden dejar huecos en tu conjunto de calibración o, peor aún, colocar muestras muy similares en ambos conjuntos, lo que conduce a estimaciones de error excesivamente optimistas.
ja: スペクトルデータに対して、ランダムな訓練/テスト分割が本当に最善の方法か疑問に思ったことがあるなら、あなただけではありません。ランダム分割はキャリブレーションセットにギャップを残したり、さらに悪いことに非常に類似したサンプルを両方のセットに入れてしまい、誤差推定が過度に楽観的になることがあります。
zh_cn: 如果你曾怀疑随机划分训练集/测试集是否真的是处理光谱数据的最佳方法，那么你并非一个人。随机划分可能会在你的校准集中留下空白，或者更糟的是，在两组中都放入非常相似的样本——从而导致过于乐观的误差估计。

source: `Astartes <https://github.com/JacksonBurns/astartes>`_ solves this problem. It's a Python library that works as a drop-in replacement for ``sklearn.model_selection.train_test_split``, but with access to sampling algorithms that actually make sense for chemometrics: **Kennard-Stone**, **SPXY**, and others.
es: `Astartes <https://github.com/JacksonBurns/astartes>`_ resuelve este problema. Es una biblioteca de Python que funciona como un reemplazo directo de ``sklearn.model_selection.train_test_split``, pero con acceso a algoritmos de muestreo que realmente tienen sentido para la quimiometría: **Kennard-Stone**, **SPXY** y otros.
ja: `Astartes <https://github.com/JacksonBurns/astartes>`_ はこの問題を解決します。これは ``sklearn.model_selection.train_test_split`` の直接置換として機能するPythonライブラリですが、ケモメトリクスに実際に意味のあるサンプリングアルゴリズム：**Kennard-Stone** 、**SPXY** などにアクセスできます。

source: Why does this matter?
es: ¿Por qué es importante esto?
ja: なぜこれが重要なのでしょうか？
zh_cn: 为什么这很重要？

source: Kennard-Stone, for instance, picks samples that maximize the coverage of your spectral space. Instead of hoping that a random draw gives you a representative calibration set, you *guarantee* it. This reduces the risk of extrapolation when predicting new samples.
es: Kennard-Stone, por ejemplo, selecciona muestras que maximizan la cobertura de tu espacio espectral. En lugar de esperar que un sorteo aleatorio te dé un conjunto de calibración representativo, lo *garantizas*. Esto reduce el riesgo de extrapolación al predecir nuevas muestras.
ja: 例えば、Kennard-Stoneはスペクトル空間のカバレッジを最大化するサンプルを選択します。ランダムな抽選が代表的なキャリブレーションセットを提供することを願う代わりに、それを*保証*します。これにより、新しいサンプルを予測する際の外挿リスクが減少します。
zh_cn: 例如，Kennard-Stone会选择最大化覆盖你光谱空间的样本。你不是希望随机抽取给你一个有代表性的校准集，而是*保证*这一点。这降低了预测新样本时的外推风险。

source: SPXY goes a step further by considering both the spectra (X) and the reference values (y) when selecting samples—useful when your y-values span a wide range.
es: SPXY va un paso más allá al considerar tanto los espectros (X) como los valores de referencia (y) al seleccionar muestras, lo cual es útil cuando tus valores y abarcan un amplio rango.
ja: SPXYは、サンプル選択時にスペクトル（X）と基準値（y）の両方を考慮することでさらに一歩進んでおり、y値が広い範囲に及ぶ場合に有用です。
zh_cn: SPXY更进一步，在选择样本时同时考虑光谱（X）和参考值（y）——这在你的y值跨度很大时很有用。

source: Available Samplers
es: Muestreadores Disponibles
ja: 利用可能なサンプラー
zh_cn: 可用的采样器

source: Astartes groups its samplers into two categories:
es: Astartes agrupa sus muestreadores en dos categorías:
ja: Astartesはそのサンプラーを2つのカテゴリに分類します：
zh_cn: Astartes将其采样器分为两类：

source: **Interpolative**: samples are chosen to ensure coverage *within* the data space. Good for building general-purpose models.
es: **Interpolativo**: las muestras se eligen para garantizar cobertura *dentro* del espacio de datos. Bueno para construir modelos de propósito general.
ja: **内挿的**：データ空間*内*でのカバレッジを確保するためにサンプルが選択されます。汎用モデルの構築に適しています。
zh_cn: **内插式**：选择样本以确保*在*数据空间内的覆盖。适用于构建通用模型。

source: **Extrapolative**: samples are grouped into clusters, and entire clusters are held out. This tests how well the model generalizes to *unseen regions*.
es: **Extrapolativo**: las muestras se agrupan en clústeres y se excluyen clústeres enteros. Esto prueba qué tan bien el modelo generaliza a *regiones no vistas*.
ja: **外挿的**：サンプルはクラスターにグループ化され、クラスター全体が保留されます。これはモデルが*未見の領域*にどれだけ一般化できるかをテストします。
zh_cn: **外推式**：将样本分组为聚类，并保留整个聚类。这测试了模型对*未见区域*的泛化能力。

source: Here are some of the most useful samplers for spectroscopic data:
es: Aquí hay algunos de los muestreadores más útiles para datos espectroscópicos:
ja: スペクトルデータに最も有用ないくつかのサンプラーを以下に示します：
zh_cn: 以下是一些对光谱数据最有用的采样器：

source: Sampler
es: Muestreador
ja: サンプラー
zh_cn: 采样器

source: Type
es: Tipo
ja: タイプ
zh_cn: 类型

source: When to use it
es: Cuándo usarlo
ja: 使用する場面
zh_cn: 使用场景

source: Interpolative
es: Interpolativo
ja: 内挿的
zh_cn: 内插式

source: Baseline comparison. Same as sklearn's default.
es: Comparación de referencia. Igual que el valor predeterminado de sklearn.
ja: ベースライン比較。sklearnのデフォルトと同じです。
zh_cn: 基线比较。与sklearn的默认设置相同。

source: The go-to for spectroscopy. Picks samples that maximize coverage of the X-space.
es: El estándar para espectroscopía. Selecciona muestras que maximizan la cobertura del espacio X.
ja: スペクトロスコピーの定番です。X空間のカバレッジを最大化するサンプルを選択します。
zh_cn: 光谱分析的常用选择。选择能最大化X空间覆盖的样本。

source: Like Kennard-Stone, but also considers the y-values. Great for calibration transfer.
es: Similar a Kennard-Stone, pero también considera los valores y. Excelente para transferencia de calibración.
ja: Kennard-Stoneと同様ですが、y値も考慮します。キャリブレーション転送に最適です。
zh_cn: 类似于Kennard-Stone，但也考虑y值。非常适合校准转移。

source: Extrapolative
es: Extrapolativo
ja: 外挿的
zh_cn: 外推式

source: Clusters samples, then holds out entire clusters. Tests generalization to new regions.
es: Agrupa muestras, luego excluye clústeres completos. Prueba la generalización a nuevas regiones.
ja: サンプルをクラスタリングし、クラスター全体を保留します。新しい領域への一般化をテストします。
zh_cn: 对样本进行聚类，然后保留整个聚类。测试对新区域的泛化能力。

source: Excludes samples within a distance cutoff. Useful for testing robustness to gaps in the data.
es: Excluye muestras dentro de un umbral de distancia. Útil para probar la robustez ante huecos en los datos.
ja: 距離のカットオフ内のサンプルを除外します。データのギャップに対する堅牢性をテストするのに有用です。
zh_cn: 排除距离阈值内的样本。有助于测试对数据间隙的鲁棒性。

source: For the full list (including molecule-specific samplers like Scaffold), check the `Astartes GitHub page <https://github.com/JacksonBurns/astartes#implemented-sampling-algorithms>`_.
es: Para la lista completa (incluyendo muestreadores específicos de moléculas como Scaffold), consulta la `página de GitHub de Astartes <https://github.com/JacksonBurns/astartes#implemented-sampling-algorithms>`_.
ja: 完全なリスト（Scaffoldのような分子固有のサンプラーを含む）については、`Astartes GitHubページ <https://github.com/JacksonBurns/astartes#implemented-sampling-algorithms>`_ を確認してください。
zh_cn: 完整列表（包括Scaffold等分子特定采样器），请查看 `Astartes GitHub页面 <https://github.com/JacksonBurns/astartes#implemented-sampling-algorithms>`_ 。

source: Pairing with Chemotools
es: Combinación con Chemotools
ja: Chemotoolsとの組み合わせ
zh_cn: 与Chemotools结合使用

source: The two libraries complement each other nicely:
es: Las dos bibliotecas se complementan muy bien:
ja: これら2つのライブラリは互いにうまく補完し合います：
zh_cn: 这两个库很好地互补：

source: **Chemotools** handles the spectral preprocessing (smoothing, baseline correction, derivatives, etc.).
es: **Chemotools** maneja el preprocesamiento espectral (suavizado, corrección de línea base, derivadas, etc.).
ja: **Chemotools**はスペクトル前処理（平滑化、ベースライン補正、微分など）を担当します。
zh_cn: **Chemotools** 处理光谱预处理（平滑、基线校正、导数等）。

source: **Astartes** handles the sample selection before you even start modeling.
es: **Astartes** maneja la selección de muestras incluso antes de que comiences a modelar.
ja: **Astartes**はモデリングを開始する前のサンプル選択を担当します。
zh_cn: **Astartes** 在你开始建模之前处理样本选择。

source: Together, they give you a clean, well-validated pipeline.
es: Juntas, te proporcionan una tubería limpia y bien validada.
ja: 一緒に使用することで、クリーンで十分に検証されたパイプラインが得られます。
zh_cn: 两者结合，为你提供了一个干净、经过充分验证的流程。

source: Example: Kennard-Stone Splitting
es: Ejemplo: División con Kennard-Stone
ja: 例：Kennard-Stone分割
zh_cn: 示例：Kennard-Stone划分

source: Here's a quick example. We load some spectra, split them with Kennard-Stone, and then run them through a preprocessing pipeline:
es: Aquí tienes un ejemplo rápido. Cargamos algunos espectros, los dividimos con Kennard-Stone y luego los procesamos a través de una tubería de preprocesamiento:
ja: 簡単な例を示します。いくつかのスペクトルを読み込み、Kennard-Stoneで分割し、前処理パイプラインで実行します：
zh_cn: 这里有一个快速示例。我们加载一些光谱，用Kennard-Stone划分它们，然后通过预处理流程运行：

source: If you want to include the y-values in the selection logic, just swap in ``sampler='spxy'``.
es: Si quieres incluir los valores y en la lógica de selección, simplemente cambia a ``sampler='spxy'``.
ja: 選択ロジックにy値を含めたい場合は、``sampler='spxy'`` に切り替えるだけです。
zh_cn: 如果你希望在选择逻辑中包含y值，只需切换到 ``sampler='spxy'`` 。

source: Installation
es: Instalación
ja: インストール
zh_cn: 安装

source: Astartes is not a dependency of chemotools, so you'll need to install it separately:
es: Astartes no es una dependencia de chemotools, por lo que necesitarás instalarlo por separado:
ja: Astartesはchemotoolsの依存関係ではないため、別途インストールする必要があります：
zh_cn: Astartes不是 ``chemotools`` 的依赖项，因此你需要单独安装它：

source: For more details, check out the `Astartes documentation <https://astartes.readthedocs.io/>`_.
es: Para más detalles, consulta la `documentación de Astartes <https://astartes.readthedocs.io/>`_.
ja: 詳細については、`Astartesドキュメンテーション <https://astartes.readthedocs.io/>`_ を確認してください。

source: `Astartes <https://github.com/JacksonBurns/astartes>`_ solves this problem. It's a Python library that works as a drop-in replacement for ``sklearn.model_selection.train_test_split`` , but with access to sampling algorithms that actually make sense for chemometrics: **Kennard-Stone**, **SPXY**, and others.
zh_cn: `Astartes <https://github.com/JacksonBurns/astartes>`_ 解决了这个问题。它是一个Python库，可以作为``sklearn.model_selection.train_test_split`` 的直接替代品，但提供了对化学计量学真正有意义的采样算法：**Kennard-Stone**、**SPXY** 等。

source: For more details, check out the `Astartes documentation <https://astartes.readthedocs.io/>`_ .
zh_cn: 更多详情，请查看`Astartes文档 <https://astartes.readthedocs.io/>`_。
