Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/dataframes.po
Languages: es, ja, zh_cn

source: Working with DataFrames
es: Trabajando con DataFrames
ja: DataFrame の操作
zh_cn: 处理 DataFrame

source: For the ``pandas.DataFrame`` and ``polars.DataFrame`` lovers. By default, all ``scikit-learn`` and ``chemotools`` transformers output ``numpy.ndarray``. However, now it is possible to configure your ``chemotools`` preprocessing methods to produce either a ``pandas.DataFrame`` or a ``polars.DataFrame`` objects as output. This is possible after implementing the new ``set_output()`` API from ``scikit-learn`` (>= 1.2.2 for ``pandas`` and >= 1.4.0 for ``polars``) (`documentation <https://scikit-learn.org/stable/auto_examples/miscellaneous/plot_set_output.html>`_). The same API implemented in other ``scikit-learn`` preprocessing methods like the ``StandardScaler()`` is now available for the ``chemotools`` transformers.
es: Para los amantes de ``pandas.DataFrame`` y ``polars.DataFrame``. Por defecto, todos los transformadores de ``scikit-learn`` y ``chemotools`` devuelven ``numpy.ndarray``. Sin embargo, ahora es posible configurar tus métodos de preprocesamiento de ``chemotools`` para producir objetos ``pandas.DataFrame`` o ``polars.DataFrame`` como salida. Esto es posible después de implementar la nueva API ``set_output()`` de ``scikit-learn`` (>= 1.2.2 para ``pandas`` y >= 1.4.0 para ``polars``) (`documentación <https://scikit-learn.org/stable/auto_examples/miscellaneous/plot_set_output.html>`_). La misma API implementada en otros métodos de preprocesamiento de ``scikit-learn`` como ``StandardScaler()`` ahora está disponible para los transformadores de ``chemotools``.
ja: ``pandas.DataFrame`` と ``polars.DataFrame`` をお使いの方へ。デフォルトでは、すべての ``scikit-learn`` および ``chemotools`` 変換器は ``numpy.ndarray`` を出力します。しかし、現在では ``chemotools`` の前処理メソッドを設定して、 ``pandas.DataFrame`` または ``polars.DataFrame`` オブジェクトを出力として生成することが可能です。これは ``scikit-learn`` の新しい ``set_output()`` API の実装により可能になりました（ ``pandas`` の場合 >= 1.2.2、 ``polars`` の場合 >= 1.4.0）（`ドキュメント <https://scikit-learn.org/stable/auto_examples/miscellaneous/plot_set_output.html>`_）。 ``StandardScaler()`` など、他の ``scikit-learn`` 前処理メソッドに実装されているものと同じ API が、 ``chemotools`` 変換器でも利用可能になりました。
zh_cn: 献给 ``pandas.DataFrame`` 和 ``polars.DataFrame`` 爱好者。默认情况下，所有 ``scikit-learn`` 和 ``chemotools`` 转换器都输出 ``numpy.ndarray``。然而，现在可以配置您的 ``chemotools`` 预处理方法以生成 ``pandas.DataFrame`` 或 ``polars.DataFrame`` 对象作为输出。这是在实现了来自 ``scikit-learn`` 的新 ``set_output()`` API（对于 ``pandas`` 需要 >= 1.2.2，对于 ``polars`` 需要 >= 1.4.0）（`文档 <https://scikit-learn.org/stable/auto_examples/miscellaneous/plot_set_output.html>`_）之后实现的。现在，在其他 ``scikit-learn`` 预处理方法（如 ``StandardScaler()``）中实现的相同 API 也可用于 ``chemotools`` 转换器。

source: From version 0.1.3, the ``set_output()`` is available for all ``chemotools`` functions!
es: ¡Desde la versión 0.1.3, ``set_output()`` está disponible para todas las funciones de ``chemotools``!
ja: バージョン 0.1.3 以降、すべての ``chemotools`` 関数で ``set_output()`` が利用可能です！
zh_cn: 从版本 0.1.3 开始，``set_output()`` 可用于所有 ``chemotools`` 函数！

source: Below there are two examples of how to use this new API:
es: A continuación se presentan dos ejemplos de cómo usar esta nueva API:
ja: 以下に、この新しい API の使用方法を示す 2 つの例を紹介します:
zh_cn: 以下是两个如何使用此新 API 的示例：

source: **Example 1: Using the set_output() API with a single preprocessing method**
es: **Ejemplo 1: Usando la API set_output() con un único método de preprocesamiento**
ja: 例 1: 単一の前処理メソッドでの set_output() API の使用
zh_cn: 示例 1：在单个预处理方法中使用 set_output() API

source: 1. Load your spectral data as a ``pandas.DataFrame``
es: 1. Carga tus datos espectrales como un ``pandas.DataFrame``
ja: 1. スペクトルデータを ``pandas.DataFrame`` として読み込む
zh_cn: 1. 将光谱数据加载为 ``pandas.DataFrame``

source: First load your spectral data. In this case, we assume a file called ``spectra.csv`` where each row represents a spectrum and each column represents wavenumbers.
es: Primero carga tus datos espectrales. En este caso, asumimos un archivo llamado ``spectra.csv`` donde cada fila representa un espectro y cada columna representa números de onda.
ja: まず、スペクトルデータを読み込みます。ここでは、各行がスペクトルを表し、各列が波数を表す ``spectra.csv`` というファイルを想定します。
zh_cn: 首先加载您的光谱数据。在这种情况下，我们假设有一个名为 ``spectra.csv`` 的文件，其中每一行代表一个光谱，每一列代表波数。

source: The ``spectra`` variable is a ``pandas.DataFrame`` object with the indices representing the sample names and the columns representing the wavenumbers.
es: La variable ``spectra`` es un objeto ``pandas.DataFrame`` con los índices representando los nombres de las muestras y las columnas representando los números de onda.
ja: ``spectra`` 変数は ``pandas.DataFrame`` オブジェクトで、インデックスはサンプル名を表し、列は波数を表します。
zh_cn: ``spectra`` 变量是一个 ``pandas.DataFrame`` 对象，其索引代表样本名称，列代表波数。

source: 2. Create a ``chemotools`` preprocessing object and set the output to ``pandas``
es: 2. Crea un objeto de preprocesamiento de ``chemotools`` y establece la salida a ``pandas``
ja: 2. ``chemotools`` 前処理オブジェクトを作成し、出力を ``pandas`` に設定する
zh_cn: 2. 创建一个 ``chemotools`` 预处理对象并将输出设置为 ``pandas``

source: Next, we create the ``AirPls`` object and set the output to ``pandas``.
es: A continuación, creamos el objeto ``AirPls`` y establecemos la salida a ``pandas``.
ja: 次に、 ``AirPls`` オブジェクトを作成し、出力を ``pandas`` に設定します。
zh_cn: 接下来，我们创建 ``AirPls`` 对象并将输出设置为 ``pandas``。

source: The ``set_output()`` method accepts the following arguments:
es: El método ``set_output()`` acepta los siguientes argumentos:
ja: ``set_output()`` メソッドは以下の引数を受け付けます:
zh_cn: ``set_output()`` 方法接受以下参数：

source: ``transform``: The output format. Can be ``'pandas'`` or ``'default'`` (the default format will output a ``numpy.ndarray``).
es: ``transform``: El formato de salida. Puede ser ``'pandas'`` o ``'default'`` (el formato por defecto devolverá un ``numpy.ndarray``).
ja: ``transform`` : 出力フォーマット。 ``'pandas'`` または ``'default'`` を指定できます（デフォルトフォーマットは ``numpy.ndarray`` を出力します）。
zh_cn: ``transform``：输出格式。可以是 ``'pandas'`` 或 ``'default'``（默认格式将输出 ``numpy.ndarray``）。

source: If you wanted to set the output to ``polars`` you would use ``transform='polars'`` in the ``set_output()`` method (``AirPLS().set_output(transform='polars')``).
es: Si deseas establecer la salida a ``polars`` deberías usar ``transform='polars'`` en el método ``set_output()`` (``AirPLS().set_output(transform='polars')``).
ja: 出力を ``polars`` に設定したい場合は、 ``set_output()`` メソッドで ``transform='polars'`` を使用します（ ``AirPLS().set_output(transform='polars')`` ）。
zh_cn: 如果您想将输出设置为 ``polars``，您可以在 ``set_output()`` 方法中使用 ``transform='polars'``（``AirPLS().set_output(transform='polars')``）。

source: 3. Fit and transform the spectra
es: 3. Ajusta y transforma los espectros
ja: 3. スペクトルをフィットして変換する
zh_cn: 3. 拟合并转换光谱

source: The output of the ``fit_transform()`` method is now a ``pandas.DataFrame`` object.
es: La salida del método ``fit_transform()`` ahora es un objeto ``pandas.DataFrame``.
ja: ``fit_transform()`` メソッドの出力は、 ``pandas.DataFrame`` オブジェクトになります。
zh_cn: ``fit_transform()`` 方法的输出现在是一个 ``pandas.DataFrame`` 对象。

source: Notice that by default the indices and the columns of the input data are not maintained to the output, and the ``spectra_airpls`` DataFrame has default indices and columns.
es: Observa que por defecto los índices y las columnas de los datos de entrada no se mantienen en la salida, y el DataFrame ``spectra_airpls`` tiene índices y columnas por defecto.
ja: デフォルトでは、入力データのインデックスと列は出力に維持されず、 ``spectra_airpls`` DataFrame はデフォルトのインデックスと列を持つことに注意してください。
zh_cn: 请注意，默认情况下输入数据的索引和列不会保留到输出中，``spectra_airpls`` DataFrame 具有默认的索引和列。

source: **Example 2: Using the set_output() API with a pipeline**
es: **Ejemplo 2: Usando la API set_output() con un pipeline**
ja: 例 2: パイプラインでの set_output() API の使用
zh_cn: 示例 2：在管道中使用 set_output() API

source: Similarly, the ``set_output()`` API can be used with pipelines. The following code shows how to create a pipeline that performs:
es: De manera similar, la API ``set_output()`` se puede usar con pipelines. El siguiente código muestra cómo crear un pipeline que realiza:
ja: 同様に、 ``set_output()`` API はパイプラインでも使用できます。以下のコードは、次の処理を実行するパイプラインの作成方法を示しています:
zh_cn: 类似地，``set_output()`` API 也可用于管道。以下代码显示了如何创建一个执行以下操作的管道：

source: Multiplicative scatter correction
es: Corrección de dispersión multiplicativa
ja: 乗法散乱補正
zh_cn: 乘性散射校正

source: Standard scaling
es: Escalado estándar
ja: 標準スケーリング
zh_cn: 标准缩放

source: If you wanted to set the output to ``polars`` you would use ``transform='polars'`` in the ``set_output()`` method (``pipeline.set_output(transform='polars')``).
es: Si deseas establecer la salida a ``polars`` deberías usar ``transform='polars'`` en el método ``set_output()`` (``pipeline.set_output(transform='polars')``).
ja: 出力を ``polars`` に設定したい場合は、 ``set_output()`` メソッドで ``transform='polars'`` を使用します（ ``pipeline.set_output(transform='polars')`` ）。
zh_cn: 如果您想将输出设置为 ``polars``，您可以在 ``set_output()`` 方法中使用 ``transform='polars'``（``pipeline.set_output(transform='polars')``）。
