Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/inspector_fundamentals.po
Languages: es, ja, zh_cn

source: You can save individual figures or all figures at once:
es: Puede guardar figuras individuales o todas las figuras a la vez:
ja: 個別の図、またはすべての図を一括で保存できます:
zh_cn: 您可以保存单个图形或一次性保存所有图形：

source: Customizing Figures
es: Personalización de figuras
ja: 図のカスタマイズ
zh_cn: 自定义图形

source: Since the figures are standard matplotlib objects, you can modify them after creation:
es: Dado que las figuras son objetos estándar de matplotlib, puede modificarlas después de crearlas:
ja: 図は標準の matplotlib オブジェクトのため、作成後に自由に変更できます:
zh_cn: 由于这些图形是标准的 matplotlib 对象，您可以在创建后修改它们：

source: Accessing Model Data
es: Acceso a los datos del modelo
ja: モデルデータへのアクセス
zh_cn: 访问模型数据

source: Beyond plotting, the inspectors provide methods to extract underlying data for custom analysis.
es: Además de la generación de gráficos, los inspectores proporcionan métodos para extraer datos subyacentes para análisis personalizados.
ja: プロット以外にも、インスペクターは基礎データを抽出してカスタム分析に利用するためのメソッドを提供します。
zh_cn: 除了绘图，检查器还提供了提取底层数据以进行自定义分析的方法。

source: PCA Inspector
es: Inspector de PCA
ja: PCA インスペクター
zh_cn: PCA 检查器

source: PLS Regression Inspector
es: Inspector de regresión PLS
ja: PLS 回帰インスペクター
zh_cn: PLS 回归检查器

source: Model Summaries
es: Resúmenes del modelo
ja: モデル概要
zh_cn: 模型摘要

source: The inspectors provide summary statistics of the models via the ``.summary()`` method. This returns a dataclass object with a ``.to_dict()`` method for easy conversion to dictionaries.
es: Los inspectores proporcionan estadísticas resumidas de los modelos mediante el método ``.summary()``. Este devuelve un objeto dataclass con un método ``.to_dict()`` para facilitar su conversión a diccionarios.
ja: インスペクターは ``.summary()`` メソッドを通じてモデルの要約統計量を提供します。これは dataclass オブジェクトを返し、``.to_dict()`` メソッドにより辞書へ容易に変換できます。
zh_cn: 检查器通过 ``.summary()`` 方法提供模型的汇总统计信息。这会返回一个数据类对象，其中包含 ``.to_dict()`` 方法，便于转换为字典。

source: Model Summary
es: Resumen del modelo
ja: モデルの要約
zh_cn: 模型摘要

source: The ``.to_dict()`` method returns:
es: El método ``.to_dict()`` devuelve:
ja: ``.to_dict()`` メソッドは以下を返します:
zh_cn: ``.to_dict()`` 方法返回：

source: Regression Metrics
es: Métricas de regresión
ja: 回帰指標
zh_cn: 回归指标

source: For PLS regression models, you can access the regression metrics directly from the summary object:
es: Para modelos de regresión PLS, puede acceder directamente a las métricas de regresión desde el objeto de resumen:
ja: PLS 回帰モデルでは、サマリーオブジェクトから回帰指標へ直接アクセスできます:
zh_cn: 对于 PLS 回归模型，您可以直接从摘要对象访问回归指标：

source: The ``.metrics`` property provides a structure optimized for ``pandas.DataFrame``:
es: La propiedad ``.metrics`` proporciona una estructura optimizada para ``pandas.DataFrame``:
ja: ``.metrics`` プロパティは ``pandas.DataFrame`` に最適化された構造を提供します:
zh_cn: ``.metrics`` 属性提供了一个针对 ``pandas.DataFrame`` 优化的结构：

source: See Also
es: Véase también
ja: 関連項目
zh_cn: 另请参阅

source: :ref:`plotting_fundamentals`: For lower-level control over individual plots.
es: :ref:`plotting_fundamentals`: Para un control de bajo nivel sobre gráficos individuales.
ja: :ref:`plotting_fundamentals`: 個々のプロットをより低レベルで制御するための情報。
zh_cn: :ref:`plotting_fundamentals`：用于对单个图表进行更低级别的控制。

source: :doc:`/methods/outliers`: For details on the outlier detection statistics.
es: :doc:`/methods/outliers`: Para detalles sobre las estadísticas de detección de valores atípicos.
ja: :doc:`/methods/outliers`: 外れ値検出統計の詳細。
zh_cn: :doc:`/methods/outliers`：关于离群值检测统计的详细信息。
