Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/inspector_fundamentals.po
Languages: es, ja, zh_cn

source: Inspecting your models
es: Inspeccionando tus modelos
ja: モデルを検査する
zh_cn: 检查您的模型

source: The ``chemotools.inspector`` module provides a unified interface for model diagnostics. Instead of manually creating separate plots for scores, loadings, and outliers, the **Inspector** generates a complete diagnostic suite with a single method call.
es: El módulo ``chemotools.inspector`` proporciona una interfaz unificada para el diagnóstico de modelos. En lugar de crear manualmente gráficos separados para puntuaciones, cargas y valores atípicos, el **Inspector** genera un conjunto completo de diagnósticos con una sola llamada de método.
ja: ``chemotools.inspector`` モジュールは、モデル診断のための統一インターフェースを提供します。スコア、ロードings、外れ値などのプロットを手動で作成する代わりに、**Inspector** が単一のメソッド呼び出しで完全な診断スイートを生成します。
zh_cn: ``chemotools.inspector`` 模块为模型诊断提供了一个统一的接口。无需手动为得分、载荷和离群值分别创建图表，**Inspector（检查器）** 只需一次方法调用即可生成完整的诊断套件。

source: All inspectors share the same API, making it intuitive to use across different model types (PCA, PLS, etc.). The inspectors support multiple datasets (training, test, validation) and offer extensive customization options for coloring, annotations, and component selection. An abstract overview of the inspectors is shown in the Figure below.
es: Todos los inspectores comparten la misma API, lo que hace intuitivo su uso con diferentes tipos de modelos (PCA, PLS, etc.). Los inspectores soportan múltiples conjuntos de datos (entrenamiento, prueba, validación) y ofrecen amplias opciones de personalización para colores, anotaciones y selección de componentes. Una visión general abstracta de los inspectores se muestra en la Figura a continuación.
ja: すべてのインスペクターは同じ API を共有しており、異なるモデルタイプ（PCA、PLS など）間で直感的に使用できます。インスペクターは複数のデータセット（学習、テスト、検証）をサポートし、色付け、注釈、コンポーネント選択に関する幅広いカスタマイズを提供します。以下の図はインスペクターの概要を示しています。
zh_cn: 所有检查器共享相同的 API，使得在不同模型类型（PCA、PLS 等）间使用变得直观。检查器支持多个数据集（训练集、测试集、验证集），并提供广泛的着色、注释和成分选择等自定义选项。下图展示了检查器的抽象概述。

source: The inspector module is experimental and under active development. The API may change in future versions. We welcome your feedback! Please report issues or suggestions at: https://github.com/paucablop/chemotools/issues
es: El módulo inspector es experimental y está en desarrollo activo. La API puede cambiar en versiones futuras. ¡Agradecemos tus comentarios! Por favor reporta problemas o sugerencias en: https://github.com/paucablop/chemotools/issues
ja: inspector モジュールは実験的で、現在も開発が進行中です。API は将来のバージョンで変更される可能性があります。フィードバックを歓迎します。問題や提案は以下までお寄せください: https://github.com/paucablop/chemotools/issues
zh_cn: 检查器模块目前处于实验阶段，正在积极开发中。其 API 可能在未来的版本中发生变化。我们欢迎您的反馈！请在此报告问题或建议：https://github.com/paucablop/chemotools/issues

source: Why use the Inspector?
es: ¿Por qué usar el Inspector?
ja: Inspector を使用する理由
zh_cn: 为何使用检查器？

source: Reduce boilerplate code, make your model flows more readable and ensure to fully understand your models:
es: Reduce el código repetitivo, haz tus flujos de modelos más legibles y asegúrate de comprender completamente tus modelos:
ja: 定型コードを削減し、モデルフローをより読みやすくし、モデルを十分に理解できるようにします:
zh_cn: 减少样板代码，使您的模型流程更具可读性，并确保能完全理解您的模型：

source: **One-Liner Diagnostics**: Generate all standard plots (Scores, Loadings, Variance, Outliers) with ``.inspect()``.
es: **Diagnósticos en una línea**: Genera todos los gráficos estándar (Puntuaciones, Cargas, Varianza, Valores atípicos) con ``.inspect()``.
ja: **ワンライナー診断**: ``.inspect()`` により、すべての標準プロット（スコア、ロードings、分散、外れ値）を生成します。
zh_cn: **单行诊断**：使用 ``.inspect()`` 生成所有标准图表（得分、载荷、方差、离群值）。

source: **Unified Interface**: Consistent API for PCA and PLS models.
es: **Interfaz unificada**: API consistente para modelos PCA y PLS.
ja: **統一インターフェース**: PCA と PLS モデルに対して一貫した API。
zh_cn: **统一接口**：为 PCA 和 PLS 模型提供一致的 API。

source: **Multi-Dataset Support**: Easily compare Training, Test, and Validation sets on the same plots.
es: **Soporte multi-conjunto de datos**: Compara fácilmente conjuntos de Entrenamiento, Prueba y Validación en los mismos gráficos.
ja: **マルチデータセット対応**: 学習、テスト、検証データを同じプロット上で簡単に比較可能。
zh_cn: **多数据集支持**：可在同一图表中轻松比较训练集、测试集和验证集。

source: **Spectra Comparison**: Compare raw vs preprocessed spectra with ``.inspect_spectra()``.
es: **Comparación de espectros**: Compara espectros crudos vs preprocesados con ``.inspect_spectra()``.
ja: **スペクトル比較**: ``.inspect_spectra()`` により、生データと前処理済スペクトルを比較できます。
zh_cn: **光谱比较**：使用 ``.inspect_spectra()`` 比较原始光谱与预处理后的光谱。

source: **Data Access**: Extract scores, loadings, and coefficients for custom analysis.
es: **Acceso a datos**: Extrae puntuaciones, cargas y coeficientes para análisis personalizados.
ja: **データアクセス**: カスタム分析のためにスコア、ロードings、係数を抽出可能。
zh_cn: **数据访问**：提取得分、载荷和系数以进行自定义分析。

source: **Interactive & Publication Ready**: Returns standard matplotlib figures that can be further customized.
es: **Interactivo y listo para publicación**: Devuelve figuras matplotlib estándar que pueden personalizarse aún más.
ja: **インタラクティブ & 出版品質**: カスタマイズ可能な標準 matplotlib 図を返します。
zh_cn: **交互式且适合发表**：返回标准的 matplotlib 图形，可进行进一步自定义。

source: Basic Usage
es: Uso básico
ja: 基本的な使用方法
zh_cn: 基本用法

source: Currently, ``chemotools`` supports inspectors for:
es: Actualmente, ``chemotools`` soporta inspectores para:
ja: 現時点で ``chemotools`` がサポートするインスペクターは以下の通りです:
zh_cn: 目前，``chemotools`` 支持以下模型的检查器：

source: **PLS Regression**: ``PLSRegressionInspector``
es: **Regresión PLS**: ``PLSRegressionInspector``
ja: **PLS 回帰**: ``PLSRegressionInspector``
zh_cn: **PLS 回归**：``PLSRegressionInspector``

source: For the example, let's load some data and train a PCA and a PLS regression model.
es: Para el ejemplo, carguemos algunos datos y entrenemos un modelo PCA y un modelo de regresión PLS.
ja: 例として、いくつかのデータを読み込み、PCA と PLS 回帰モデルを学習させます。
zh_cn: 在本示例中，让我们加载一些数据并训练一个 PCA 和一个 PLS 回归模型。

source: Now that we have trained the models, we can inspect them using ``inspector``. The core of the module is the ``.inspect()`` method, shared by all inspectors.
es: Ahora que hemos entrenado los modelos, podemos inspeccionarlos usando ``inspector``. El núcleo del módulo es el método ``.inspect()``, compartido por todos los inspectores.
ja: モデルを学習させたので、``inspector`` を使って検査できます。モジュールの中心となるのは、すべてのインスペクターで共有されている ``.inspect()`` メソッドです。
zh_cn: 现在我们已经训练好模型，可以使用 ``inspector`` 来检查它们。该模块的核心是 ``.inspect()`` 方法，所有检查器都共享此方法。

source: The ``inspect()`` method returns a dictionary of ``matplotlib.figure.Figure`` objects, allowing you to save or modify them individually.
es: El método ``inspect()`` devuelve un diccionario de objetos ``matplotlib.figure.Figure``, permitiéndote guardarlos o modificarlos individualmente.
ja: ``inspect()`` メソッドは ``matplotlib.figure.Figure`` オブジェクトの辞書を返すため、各図を個別に保存・変更できます。
zh_cn: ``inspect()`` 方法返回一个包含 ``matplotlib.figure.Figure`` 对象的字典，允许您单独保存或修改它们。

source: Inspecting PCA Models
es: Inspeccionando modelos PCA
ja: PCA モデルの検査
zh_cn: 检查 PCA 模型

source: First we take a look at the PCA model.
es: Primero echamos un vistazo al modelo PCA.
ja: まず PCA モデルを確認します。
zh_cn: 首先我们看一下 PCA 模型。

source: This single command generates and displays several key diagnostic plots:
es: Este único comando genera y muestra varios gráficos de diagnóstico clave:
ja: この一つのコマンドで、いくつかの重要な診断プロットが生成され、表示されます:
zh_cn: 这一条命令生成并显示几个关键的诊断图表：

source: **Explained Variance**: Helps you decide if you have enough components.
es: **Varianza explicada**: Te ayuda a decidir si tienes suficientes componentes.
ja: **寄与率**: コンポーネント数が十分か判断する助けとなります。
zh_cn: **解释方差**：帮助您决定是否拥有足够的成分。

source: **Scores Plot**: Visualizes the sample space (PC1 vs PC2, PC2 vs PC3).
es: **Gráfico de puntuaciones**: Visualiza el espacio de muestras (PC1 vs PC2, PC2 vs PC3).
ja: **スコアプロット**: サンプル空間を可視化します（PC1 vs PC2、PC2 vs PC3）。
zh_cn: **得分图**：可视化样本空间（PC1 对 PC2，PC2 对 PC3）。

source: **Loadings Plot**: Visualizes the feature space (what the model is looking at).
es: **Gráfico de cargas**: Visualiza el espacio de características (lo que el modelo está observando).
ja: **ロードings プロット**: 特徴空間（モデルが注目している特徴）を可視化します。
zh_cn: **载荷图**：可视化特征空间（模型正在观察的内容）。

source: **Outlier Detection**: Hotelling's T² vs Q-Residuals plot.
es: **Detección de valores atípicos**: Gráfico de T² de Hotelling vs Residuos Q.
ja: **外れ値検出**: Hotelling の T² と Q 残差のプロット。
zh_cn: **离群值检测**：霍特林 T² 与 Q 残差图。

source: Inspecting PLS Regression Models
es: Inspeccionando modelos de regresión PLS
ja: PLS 回帰モデルの検査
zh_cn: 检查 PLS 回归模型

source: The PLS Regression inspector shares the same API as the PCAInspector, making it easy to switch between them.
es: El inspector de regresión PLS comparte la misma API que PCAInspector, lo que facilita cambiar entre ellos.
ja: PLS 回帰インスペクターは PCAInspector と同じ API を共有しており、両者を簡単に切り替えることができます。
zh_cn: PLS 回归检查器与 PCAInspector 共享相同的 API，使得在它们之间切换很容易。

source: This command generates diagnostic plots tailored for PLS regression:
es: Este comando genera gráficos de diagnóstico adaptados para regresión PLS:
ja: このコマンドは PLS 回帰に特化した診断プロットを生成します:
zh_cn: 此命令生成专为 PLS 回归定制的诊断图表：

source: **Explained Variance**: For both X-space and Y-space.
es: **Varianza explicada**: Para el espacio X y el espacio Y.
ja: **寄与率**: X 空間および Y 空間に対する寄与率。
zh_cn: **解释方差**：针对 X 空间和 Y 空间。

source: **Scores Plot**: Visualizes the sample space (LV1 vs LV2).
es: **Gráfico de puntuaciones**: Visualiza el espacio de muestras (LV1 vs LV2).
ja: **スコアプロット**: サンプル空間を可視化します（LV1 vs LV2）。
zh_cn: **得分图**：可视化样本空间（LV1 对 LV2）。

source: **X-Scores vs Y-Scores**: Correlation between latent variables.
es: **Puntuaciones X vs Puntuaciones Y**: Correlación entre variables latentes.
ja: **X スコア vs Y スコア**: 潜在変数間の相関を示します。
zh_cn: **X 得分与 Y 得分**：潜在变量之间的相关性。

source: **Loadings Plots**: X-loadings, X-weights, and X-rotations.
es: **Gráficos de cargas**: Cargas X, pesos X y rotaciones X.
ja: **ロードings プロット**: X ロードings、X 重み、X 回転を表示します。
zh_cn: **载荷图**：X 载荷、X 权重和 X 旋转。

source: **Regression Coefficients**: Feature importance for prediction.
es: **Coeficientes de regresión**: Importancia de características para predicción.
ja: **回帰係数**: 予測における特徴量の重要度を示します。
zh_cn: **回归系数**：预测的特征重要性。

source: **Leverage vs Studentized Residuals**: Influential observation detection.
es: **Apalancamiento vs Residuos Studentizados**: Detección de observaciones influyentes.
ja: **レバレッジ vs 学生化残差**: 影響力の大きいサンプルの検出。
zh_cn: **杠杆与学生化残差**：有影响力的观测点检测。

source: **Q-Residuals vs Y-Residuals**: Combined model fit diagnostics.
es: **Residuos Q vs Residuos Y**: Diagnósticos combinados de ajuste del modelo.
ja: **Q 残差 vs Y 残差**: モデル適合性の複合診断。
zh_cn: **Q 残差与 Y 残差**：组合模型拟合诊断。

source: **Predicted vs Actual**: Assess regression performance.
es: **Predicho vs Real**: Evalúa el rendimiento de la regresión.
ja: **予測値 vs 実測値**: 回帰性能の評価。
zh_cn: **预测值与实际值**：评估回归性能。

source: **Y Residuals Plot**: Identify patterns in prediction errors.
es: **Gráfico de residuos Y**: Identifica patrones en los errores de predicción.
ja: **Y 残差プロット**: 予測誤差のパターンを確認。
zh_cn: **Y 残差图**：识别预测误差中的模式。

source: **Q-Q Plot**: Check normality of residuals.
es: **Gráfico Q-Q**: Verifica la normalidad de los residuos.
ja: **Q-Q プロット**: 残差の正規性を確認。
zh_cn: **Q-Q 图**：检查残差的正态性。

source: **Residual Distribution**: Histogram of prediction errors.
es: **Distribución de residuos**: Histograma de errores de predicción.
ja: **残差分布**: 予測誤差のヒストグラム。
zh_cn: **残差分布**：预测误差的直方图。

source: Inspecting Spectra
es: Inspeccionando espectros
ja: スペクトルの検査
zh_cn: 检查光谱

source: When your model includes preprocessing steps (e.g., a sklearn Pipeline), you can compare the raw and preprocessed spectra using the ``.inspect_spectra()`` method:
es: Cuando tu modelo incluye pasos de preprocesamiento (ej., un Pipeline de sklearn), puedes comparar los espectros crudos y preprocesados usando el método ``.inspect_spectra()``:
ja: モデルに前処理ステップ（例: sklearn Pipeline）が含まれている場合、``.inspect_spectra()`` メソッドを使用して生スペクトルと前処理後スペクトルを比較できます:
zh_cn: 当您的模型包含预处理步骤（例如 ``sklearn`` ``Pipeline``）时，您可以使用 ``.inspect_spectra()`` 方法比较原始光谱和预处理后的光谱：

source: This generates two plots:
es: Esto genera dos gráficos:
ja: これにより 2 つのプロットが生成されます:
zh_cn: 这会生成两个图表：

source: **Raw Spectra**: Original input data before any transformations.
es: **Espectros crudos**: Datos de entrada originales antes de cualquier transformación.
ja: **生スペクトル**: 変換前の元データ。
zh_cn: **原始光谱**：任何变换前的原始输入数据。

source: **Preprocessed Spectra**: Data after all preprocessing steps (before the model).
es: **Espectros preprocesados**: Datos después de todos los pasos de preprocesamiento (antes del modelo).
ja: **前処理後スペクトル**: すべての前処理ステップ後（モデル適用前）のデータ。
zh_cn: **预处理后的光谱**：所有预处理步骤之后（模型之前）的数据。

source: This is particularly useful in spectroscopy workflows to verify that preprocessing steps (baseline correction, derivatives, normalization) are working as expected.
es: Esto es particularmente útil en flujos de trabajo de espectroscopía para verificar que los pasos de preprocesamiento (corrección de línea base, derivadas, normalización) están funcionando como se esperaba.
ja: これは、前処理ステップ（ベースライン補正、微分、正規化など）が期待通りに機能しているかを確認するため、分光分析ワークフローで特に有用です。
zh_cn: 这在光谱学工作流程中尤其有用，可验证预处理步骤（基线校正、导数、归一化）是否按预期工作。

source: The ``inspect_spectra()`` method is only available when the model is a Pipeline with preprocessing steps. It is also automatically called by ``.inspect()`` when preprocessing exists.
es: El método ``inspect_spectra()`` solo está disponible cuando el modelo es un Pipeline con pasos de preprocesamiento. También es llamado automáticamente por ``.inspect()`` cuando existe preprocesamiento.
ja: ``inspect_spectra()`` メソッドは、前処理ステップを含む Pipeline モデルでのみ利用可能です。また、前処理が存在する場合は ``.inspect()`` によって自動的に呼び出されます。
zh_cn: ``inspect_spectra()`` 方法仅在模型是包含预处理步骤的 Pipeline 时才可用。当存在预处理时，``.inspect()`` 也会自动调用它。

source: Customizing the Inspection
es: Personalizando la inspección
ja: 検査のカスタマイズ
zh_cn: 自定义检查

source: The ``inspect()`` method is highly customizable. You can control which components to plot, how to color the samples, and which datasets to include.
es: El método ``inspect()`` es altamente personalizable. Puedes controlar qué componentes graficar, cómo colorear las muestras y qué conjuntos de datos incluir.
ja: ``inspect()`` メソッドは高いカスタマイズ性を備えており、プロットするコンポーネント、サンプルの色付け、含めるデータセットなどを指定できます。
zh_cn: ``inspect()`` 方法具有高度可定制性。您可以控制绘制哪些成分、如何为样本着色以及包含哪些数据集。

source: Selecting Components
es: Seleccionando componentes
ja: コンポーネントの選択
zh_cn: 选择成分

source: You can specify which components to visualize in the scores and loadings plots.
es: Puedes especificar qué componentes visualizar en los gráficos de puntuaciones y cargas.
ja: スコアプロットおよびロードings プロットで可視化するコンポーネントを指定できます。
zh_cn: 您可以指定在得分图和载荷图中可视化哪些成分。

source: The ``components_scores`` parameter accepts:
es: El parámetro ``components_scores`` acepta:
ja: ``components_scores`` パラメータは以下を受け付けます:
zh_cn: ``components_scores`` 参数接受：

source: **int**: Plot first N components against sample index
es: **int**: Grafica los primeros N componentes contra el índice de muestra
ja: **int**: 最初の N 個のコンポーネントをサンプルインデックスに対してプロット
zh_cn: **int**：绘制前 N 个成分与样本索引的关系图

source: **tuple (i, j)**: Plot component i vs component j
es: **tuple (i, j)**: Grafica el componente i vs el componente j
ja: **tuple (i, j)**: コンポーネント i とコンポーネント j のプロット
zh_cn: **tuple (i, j)**：绘制成分 i 对成分 j 的关系图

source: **list**: Multiple specifications, e.g., ``[(0, 1), (1, 2)]``
es: **list**: Múltiples especificaciones, ej., ``[(0, 1), (1, 2)]``
ja: **list**: 複数指定、例: ``[(0, 1), (1, 2)]``
zh_cn: **list**：多个规格，例如 ``[(0, 1), (1, 2)]``

source: Coloring and Annotations
es: Colores y anotaciones
ja: 色付けと注釈
zh_cn: 着色与注释

source: By default, plots are colored by the target variable ``y`` (if provided). You can customize this behavior using the ``color_by`` and ``annotate_by`` parameters.
es: Por defecto, los gráficos se colorean según la variable objetivo ``y`` (si se proporciona). Puedes personalizar este comportamiento usando los parámetros ``color_by`` y ``annotate_by``.
ja: デフォルトでは、プロットはターゲット変数 ``y`` に基づいて色付けされます（提供されている場合）。``color_by`` および ``annotate_by`` パラメータを使用して、この動作をカスタマイズできます。
zh_cn: 默认情况下，图表根据目标变量 ``y`` （如果提供）进行着色。您可以使用 ``color_by`` 和 ``annotate_by`` 参数来自定义此行为。

source: Both parameters accept:
es: Ambos parámetros aceptan:
ja: 両パラメータは以下を受け付けます:
zh_cn: 这两个参数都接受：

source: ``'y'``: Color/annotate by the target variable.
es: ``'y'``: Colorear/anotar por la variable objetivo.
ja: ``'y'``: ターゲット変数による色付けまたは注釈。
zh_cn: ``'y'``：根据目标变量着色/注释。

source: ``'sample_index'``: Color/annotate by sample indices.
es: ``'sample_index'``: Colorear/anotar por índices de muestra.
ja: ``'sample_index'``: サンプルインデックスによる色付けまたは注釈。
zh_cn: ``'sample_index'``：根据样本索引着色/注释。

source: **array-like**: Custom values of the same length as the number of samples.
es: **array-like**: Valores personalizados de la misma longitud que el número de muestras.
ja: **array-like**: サンプル数と同じ長さのカスタム値。
zh_cn: **array-like**：与样本数量长度相同的自定义值。

source: **dict**: Map dataset names to arrays for multi-dataset plots, e.g., ``{'train': array1, 'test': array2}``.
es: **dict**: Mapea nombres de conjuntos de datos a arrays para gráficos multi-conjunto, ej., ``{'train': array1, 'test': array2}``.
ja: **dict**: データセット名を配列にマッピングしてマルチデータセットプロットを作成、例: ``{'train': array1, 'test': array2}``。
zh_cn: **dict**：将数据集名称映射到数组以用于多数据集绘图，例如 ``{'train': array1, 'test': array2}``。

source: Color Mode
es: Modo de color
ja: カラーモード
zh_cn: 颜色模式

source: The ``color_mode`` parameter controls how colors are applied:
es: El parámetro ``color_mode`` controla cómo se aplican los colores:
ja: ``color_mode`` パラメータは色の適用方法を制御します:
zh_cn: ``color_mode`` 参数控制颜色的应用方式：

source: Comparing Datasets
es: Comparando conjuntos de datos
ja: データセットの比較
zh_cn: 比较数据集

source: Another useful feature is the ability to overlay multiple datasets. This is critical to check how well the model generalizes to unseen data.
es: Otra característica útil es la capacidad de superponer múltiples conjuntos de datos. Esto es crítico para verificar qué tan bien generaliza el modelo a datos no vistos.
ja: 別の有用な機能として、複数のデータセットを重ねて表示できる点があります。これはモデルが未知データにどの程度一般化するか確認する上で重要です。
zh_cn: 另一个有用的功能是能够叠加多个数据集。这对于检查模型对未见数据的泛化能力至关重要。

source: This will produce plots where training, test, and validation samples are visualized together, making it easy to spot domain shifts or overfitting.
es: Esto producirá gráficos donde las muestras de entrenamiento, prueba y validación se visualizan juntas, facilitando detectar cambios de dominio o sobreajuste.
ja: これにより、学習・テスト・検証サンプルが同一プロット上に可視化され、ドメインシフトや過学習を容易に見つけられます。
zh_cn: 这将生成将训练、测试和验证样本一起可视化的图表，使得很容易发现域偏移或过拟合。

source: Multi-Output PLS
es: PLS multi-salida
ja: マルチ出力 PLS
zh_cn: 多输出 PLS

source: For multi-output PLS models (multiple target variables), use the ``target_index`` parameter to select which target to inspect:
es: Para modelos PLS multi-salida (múltiples variables objetivo), usa el parámetro ``target_index`` para seleccionar qué objetivo inspeccionar:
ja: マルチ出力 PLS モデル（複数の目的変数）では、``target_index`` パラメータを使用して検査するターゲットを選択します:
zh_cn: 对于多输出 PLS 模型（多个目标变量），使用 ``target_index`` 参数选择要检查的目标：

source: Plot Configuration
es: Configuración de gráficos
ja: プロット設定
zh_cn: 绘图配置

source: For fine-grained control over figure sizes, use the ``plot_config`` parameter or pass size arguments directly:
es: Para un control detallado sobre los tamaños de figura, usa el parámetro ``plot_config`` o pasa argumentos de tamaño directamente:
ja: 図のサイズを細かく制御するには、``plot_config`` パラメータを使用するか、サイズ引数を直接渡します:
zh_cn: 要精细控制图形大小，请使用 ``plot_config`` 参数或直接传递尺寸参数：

source: Working with Figures
es: Trabajando con figuras
ja: 図の操作
zh_cn: 处理图形

source: The ``inspect()`` method returns a dictionary of ``matplotlib.figure.Figure`` objects. This allows you to access individual plots, customize them further, or save them to files.
es: El método ``inspect()`` devuelve un diccionario de objetos ``matplotlib.figure.Figure``. Esto te permite acceder a gráficos individuales, personalizarlos aún más o guardarlos en archivos.
ja: ``inspect()`` メソッドは ``matplotlib.figure.Figure`` オブジェクトの辞書を返します。これにより、個々のプロットへアクセスし、さらにカスタマイズしたり、ファイルとして保存できます。
zh_cn: ``inspect()`` 方法返回一个包含 ``matplotlib.figure.Figure`` 对象的字典。这允许您访问单个图表、进一步自定义它们或将它们保存到文件。

source: Accessing Individual Plots
es: Accediendo a gráficos individuales
ja: 個別プロットへのアクセス
zh_cn: 访问单个图表

source: Each figure in the returned dictionary has a descriptive key:
es: Cada figura en el diccionario devuelto tiene una clave descriptiva:
ja: 返された辞書内の各図は記述的なキーを持ちます:
zh_cn: 返回字典中的每个图形都有一个描述性键名：

source: Available figure keys depend on the inspector type:
es: Las claves de figura disponibles dependen del tipo de inspector:
ja: 利用可能な図のキーはインスペクターの種類に依存します:
zh_cn: 可用的图形键名取决于检查器类型：

source: ``variance``: Explained variance plot
es: ``variance``: Gráfico de varianza explicada
ja: ``variance``: 寄与率プロット
zh_cn: ``variance``：解释方差图

source: ``loadings``: Loadings plot
es: ``loadings``: Gráfico de cargas
ja: ``loadings``: ローディングプロット
zh_cn: ``loadings``：载荷图

source: ``scores_1``, ``scores_2``, ...: Scores plots
es: ``scores_1``, ``scores_2``, ...: Gráficos de puntuaciones
zh_cn: ``scores_1``, ``scores_2``, ...：得分图

source: ``distances``: Hotelling's T² vs Q-Residuals
es: ``distances``: T² de Hotelling vs Residuos Q
ja: ``distances``: Hotelling の T² 対 Q 残差
zh_cn: ``distances``：霍特林 T² 与 Q 残差图

source: ``variance_x``, ``variance_y``: Explained variance plots
es: ``variance_x``, ``variance_y``: Gráficos de varianza explicada
ja: ``variance_x``, ``variance_y``: 寄与率プロット
zh_cn: ``variance_x``, ``variance_y``：解释方差图

source: ``loadings_x``, ``loadings_weights``, ``loadings_rotations``: Loadings plots
zh_cn: ``loadings_x``, ``loadings_weights``, ``loadings_rotations``：载荷图

source: ``regression_coefficients``: Coefficient plot
ja: ``regression_coefficients``: 回帰係数プロット
zh_cn: ``regression_coefficients``：系数图

source: ``scores_1``, ``scores_2``, ...: X-scores plots
es: ``scores_1``, ``scores_2``, ...: Gráficos de puntuaciones X
zh_cn: ``scores_1``, ``scores_2``, ...：X 得分图

source: ``x_vs_y_scores_1``, ``x_vs_y_scores_2``, ...: X vs Y scores plots
es: ``x_vs_y_scores_1``, ``x_vs_y_scores_2``, ...: Gráficos de puntuaciones X vs Y
zh_cn: ``x_vs_y_scores_1``, ``x_vs_y_scores_2``, ...：X 与 Y 得分图

source: ``distances_hotelling_q``: Hotelling's T² vs Q-Residuals
es: ``distances_hotelling_q``: T² de Hotelling vs residuos Q
ja: ``distances_hotelling_q``: Hotelling の T² 対 Q 残差
zh_cn: ``distances_hotelling_q``：霍特林 T² 与 Q 残差图

source: ``distances_leverage_studentized``: Leverage vs Studentized Residuals
es: ``distances_leverage_studentized``: Apalancamiento vs residuos tipificados
ja: ``distances_leverage_studentized``: てこ比 対 学生化残差
zh_cn: ``distances_leverage_studentized``：杠杆与学生化残差图

source: ``distances_q_y_residuals``: Q-Residuals vs Y-Residuals
es: ``distances_q_y_residuals``: Residuos Q vs residuos Y
ja: ``distances_q_y_residuals``: Q 残差 対 Y 残差
zh_cn: ``distances_q_y_residuals``：Q 残差与 Y 残差图

source: ``predicted_vs_actual``: Predicted vs Actual plot
es: ``predicted_vs_actual``: Gráfico de predicción vs valor real
ja: ``predicted_vs_actual``: 予測値 対 実測値プロット
zh_cn: ``predicted_vs_actual``：预测值与实际值图

source: ``residuals``: Y-Residuals plot
es: ``residuals``: Gráfico de residuos Y
ja: ``residuals``: Y 残差プロット
zh_cn: ``residuals``：Y 残差图

source: ``qq_plot``: Q-Q plot
es: ``qq_plot``: Gráfico Q-Q
ja: ``qq_plot``: Q-Q プロット
zh_cn: ``qq_plot``：Q-Q 图

source: ``residual_distribution``: Residual histogram
es: ``residual_distribution``: Histograma de residuos
ja: ``residual_distribution``: 残差ヒストグラム
zh_cn: ``residual_distribution``：残差直方图

source: ``raw_spectra``, ``preprocessed_spectra``: Spectra plots (if preprocessing exists)
es: ``raw_spectra``, ``preprocessed_spectra``: Gráficos de espectros (si existe preprocesamiento)
ja: ``raw_spectra``, ``preprocessed_spectra``: スペクトルプロット（前処理がある場合）
zh_cn: ``raw_spectra``, ``preprocessed_spectra``：光谱图（如果存在预处理）

source: Saving Figures
es: Guardar figuras
ja: 図の保存
zh_cn: 保存图形
