Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/persist.po
Languages: es, ja, zh_cn

source: Persisting your models
es: Persistiendo tus modelos
ja: モデルを永続化する
zh_cn: 持久化您的模型

source: Previously, we saw how to use ``chemotools`` in combination with ``scikit-learn`` to preprocess your data and make predictions. However, in a real-world scenario, we would like to persist our trained (fitted) pipelines to deploy it to a production environment. In this section, we will show two ways to persist our models:
es: Anteriormente, vimos cómo usar ``chemotools`` en combinación con ``scikit-learn`` para preprocesar tus datos y hacer predicciones. Sin embargo, en un escenario del mundo real, nos gustaría persistir nuestros pipelines entrenados (ajustados) para desplegarlos en un entorno de producción. En esta sección, mostraremos dos formas de persistir nuestros modelos:
ja: 以前、 ``chemotools`` を ``scikit-learn`` と組み合わせて使用し、データを前処理して予測を行う方法を見ました。しかし、実際のシナリオでは、訓練済み（フィット済み）のパイプラインを永続化して、本番環境にデプロイしたいと考えます。このセクションでは、モデルを永続化する2つの方法を紹介します:
zh_cn: 之前，我们了解了如何结合使用 ``chemotools`` 和 ``scikit-learn`` 来预处理数据并进行预测。然而，在实际场景中，我们希望持久化我们训练好的（已拟合的）管道，以便将其部署到生产环境中。在本节中，我们将展示两种持久化模型的方法：

source: Using ``pickle``
es: Usando ``pickle``
ja: ``pickle`` を使用する
zh_cn: 使用 ``pickle``

source: Using ``joblib``
es: Usando ``joblib``
ja: ``joblib`` を使用する
zh_cn: 使用 ``joblib``

source: An overview of the workflow is shown in the image below:
es: Una vista general del flujo de trabajo se muestra en la imagen de abajo:
ja: ワークフローの概要を以下の画像に示します:
zh_cn: 工作流程的概述如下图所示：

source: Persist your models
es: Persiste tus modelos
ja: モデルの永続化
zh_cn: 持久化您的模型

source: For this section, we will use the following fit pipeline as an example:
es: Para esta sección, usaremos el siguiente pipeline ajustado como ejemplo:
ja: このセクションでは、以下のフィット済みパイプラインを例として使用します:
zh_cn: 在本节中，我们将使用以下已拟合的管道作为示例：

source: Using pickle
es: Usando pickle
ja: pickle を使用する
zh_cn: 使用 pickle

source: ``pickle`` is a Python module that implements a binary protocol for serializing and de-serializing a Python object structure. It is a standard module that comes with the Python installation. The following code shows how to persist a ``scikit-learn`` model using ``pickle``:
es: ``pickle`` es un módulo de Python que implementa un protocolo binario para serializar y deserializar una estructura de objetos de Python. Es un módulo estándar que viene con la instalación de Python. El siguiente código muestra cómo persistir un modelo de ``scikit-learn`` usando ``pickle``:
ja: ``pickle`` は、Python オブジェクト構造をシリアル化およびデシリアル化するためのバイナリプロトコルを実装する Python モジュールです。Python インストールに付属する標準モジュールです。以下のコードは、 ``pickle`` を使用して ``scikit-learn`` モデルを永続化する方法を示しています:
zh_cn: ``pickle`` 是一个 Python 模块，它实现了用于序列化和反序列化 Python 对象结构的二进制协议。它是 Python 安装自带的标准模块。以下代码展示了如何使用 ``pickle`` 持久化 ``scikit-learn`` 模型：

source: Notice that the ``pickle`` module is not secure against erroneous or maliciously constructed data. Never unpickle data received from an untrusted or unauthenticated source.
es: Observa que el módulo ``pickle`` no es seguro contra datos erróneos o construidos maliciosamente. Nunca deserialices datos recibidos de una fuente no confiable o no autenticada.
ja: ``pickle`` モジュールは、誤ったデータや悪意を持って構築されたデータに対して安全ではありません。信頼できない、または認証されていないソースから受け取ったデータを決してアンピクルしないでください。
zh_cn: 请注意，``pickle`` 模块不能防止错误或恶意构造的数据。切勿对从未经信任或未经身份验证的来源接收的数据进行反序列化。

source: Using joblib
es: Usando joblib
ja: joblib を使用する
zh_cn: 使用 joblib

source: ``joblib`` is a Python module that provides utilities for saving and loading Python objects that make use of NumPy data structures, efficiently. It is not part of the standard Python installation, but it can be installed using ``pip``. The following code shows how to persist a ``scikit-learn`` model using ``joblib``:
es: ``joblib`` es un módulo de Python que proporciona utilidades para guardar y cargar objetos de Python que hacen uso de estructuras de datos de NumPy, eficientemente. No es parte de la instalación estándar de Python, pero puede instalarse usando ``pip``. El siguiente código muestra cómo persistir un modelo de ``scikit-learn`` usando ``joblib``:
ja: ``joblib`` は、NumPy データ構造を使用する Python オブジェクトを効率的に保存および読み込むためのユーティリティを提供する Python モジュールです。標準の Python インストールには含まれていませんが、 ``pip`` を使用してインストールできます。以下のコードは、 ``joblib`` を使用して ``scikit-learn`` モデルを永続化する方法を示しています:
zh_cn: ``joblib`` 是一个 Python 模块，它提供了用于高效保存和加载利用 NumPy 数据结构的 Python 对象的实用程序。它不是标准 Python 安装的一部分，但可以使用 ``pip`` 安装。以下代码展示了如何使用 ``joblib`` 持久化 ``scikit-learn`` 模型：
