Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/pipelines.po
Languages: es, ja, zh_cn

source: Preprocessing pipelines
es: Pipelines de preprocesamiento
ja: 前処理パイプライン
zh_cn: 预处理管道

source: Pipelines are becoming increasingly popular in machine learning workflows. In essence, pipelines are a sequence of connected data processing steps, where the output of one step is the input of the next. They are very useful for:
es: Los pipelines se están volviendo cada vez más populares en flujos de trabajo de aprendizaje automático. En esencia, los pipelines son una secuencia de pasos de procesamiento de datos conectados, donde la salida de un paso es la entrada del siguiente. Son muy útiles para:
ja: パイプラインは機械学習ワークフローでますます人気が高まっています。本質的に、パイプラインは接続されたデータ処理ステップのシーケンスであり、あるステップの出力が次のステップの入力となります。これらは以下の点で非常に有用です：
zh_cn: 管道在机器学习工作流程中正变得越来越流行。本质上，管道是一系列相互连接的数据处理步骤，其中一个步骤的输出是下一个步骤的输入。它们对于以下方面非常有用：

source: automating complex workflows,
es: automatizar flujos de trabajo complejos,
ja: 複雑なワークフローの自動化、
zh_cn: 自动化复杂的工作流程，

source: improving efficiency,
es: mejorar la eficiencia,
ja: 効率の向上、
zh_cn: 提高效率，

source: reducing errors in data processing and analysis and
es: reducir errores en el procesamiento y análisis de datos y
ja: データ処理と分析におけるエラーの削減、そして
zh_cn: 减少数据处理和分析中的错误，以及

source: simplifying model persistence and deployment.
es: simplificar la persistencia y el despliegue de modelos.
ja: モデルの永続化とデプロイの簡素化。
zh_cn: 简化模型持久化和部署。

source: All preprocessing techniques in ``chemotools`` are compatible with ``scikit-learn`` and can be used in pipelines. As an example, we will study the case where we would like to apply the following preprocessing techniques to our spectra:
es: Todas las técnicas de preprocesamiento en ``chemotools`` son compatibles con ``scikit-learn`` y se pueden usar en pipelines. Como ejemplo, estudiaremos el caso donde queremos aplicar las siguientes técnicas de preprocesamiento a nuestros espectros:
ja: ``chemotools`` のすべての前処理技術は ``scikit-learn`` と互換性があり、パイプラインで使用できます。例として、スペクトルに以下の前処理技術を適用したい場合を検討します：
zh_cn: ``chemotools`` 中的所有预处理技术都与 ``scikit-learn`` 兼容，并可在管道中使用。作为一个示例，我们将研究希望将以下预处理技术应用于光谱的情况：

source: Range Cut
es: Corte de rango
ja: 範囲カット
zh_cn: 范围截取

source: Linear Correction
es: Corrección lineal
ja: 線形補正
zh_cn: 线性校正

source: Savitzky-Golay derivate
es: Derivada de Savitzky-Golay
ja: Savitzky-Golay微分
zh_cn: Savitzky-Golay 导数

source: Mean Centering (Standard Scaler)
es: Centrado de media (Standard Scaler)
ja: 平均センタリング（標準スケーラー）
zh_cn: 均值中心化（标准缩放器）

source: PLS regression
es: Regresión PLS
ja: PLS回帰
zh_cn: PLS 回归

source: Traditional flow
es: Flujo tradicional
ja: 従来のフロー
zh_cn: 传统流程

source: In a traditional flow, would apply each preprocessing technique individually to the spectra as shown in the image below:
es: En un flujo tradicional, aplicaríamos cada técnica de preprocesamiento individualmente a los espectros como se muestra en la imagen a continuación:
ja: 従来のフローでは、以下の図に示すように、各前処理技術をスペクトルに個別に適用します：
zh_cn: 在传统流程中，需要将每个预处理技术分别应用于光谱，如下图所示：

source: Traditional workflow
es: Flujo de trabajo tradicional
ja: 従来のワークフロー
zh_cn: 传统工作流程

source: The code to perform this workflow would look like this:
es: El código para realizar este flujo de trabajo se vería así:
ja: このワークフローを実行するコードは以下のようになります：
zh_cn: 执行此工作流程的代码如下所示：

source: This is a tedious and error-prone workflow, especially when the number of preprocessing steps increases. In addition, persisting the model and deploying it to a production environment is not straightforward, as each preprocessing step needs to be persisted and deployed individually.
es: Este es un flujo de trabajo tedioso y propenso a errores, especialmente cuando el número de pasos de preprocesamiento aumenta. Además, persistir el modelo y desplegarlo en un entorno de producción no es sencillo, ya que cada paso de preprocesamiento necesita ser persistido y desplegado individualmente.
ja: これは退屈でエラーが発生しやすいワークフローであり、特に前処理ステップの数が増加すると顕著です。さらに、各前処理ステップを個別に永続化およびデプロイする必要があるため、モデルの永続化と本番環境へのデプロイは簡単ではありません。
zh_cn: 这是一个繁琐且容易出错的工作流程，特别是当预处理步骤数量增加时。此外，持久化模型并将其部署到生产环境并不简单，因为每个预处理步骤都需要单独持久化和部署。

source: Pipeline flow
es: Flujo de pipeline
ja: パイプラインフロー
zh_cn: 管道流程

source: In a pipeline flow, we can combine all preprocessing steps into a single object. This simplifies the workflow and reduces the risk of errors. The figure below shows the same workflow as above, but using a pipeline:
es: En un flujo de pipeline, podemos combinar todos los pasos de preprocesamiento en un único objeto. Esto simplifica el flujo de trabajo y reduce el riesgo de errores. La figura a continuación muestra el mismo flujo de trabajo que antes, pero usando un pipeline:
ja: パイプラインフローでは、すべての前処理ステップを単一のオブジェクトに結合できます。これによりワークフローが簡素化され、エラーのリスクが低減されます。以下の図は、同じワークフローをパイプラインを使用して示しています：
zh_cn: 在管道流程中，我们可以将所有预处理步骤组合到单个对象中。这简化了工作流程并降低了错误风险。下图显示了与上述相同的工作流程，但使用了管道：

source: Pipeline workflow
es: Flujo de trabajo de pipeline
ja: パイプラインワークフロー
zh_cn: 管道工作流程

source: An outline of the code to perform the pipeline is shown in the image below:
es: Un esquema del código para realizar el pipeline se muestra en la imagen a continuación:
ja: パイプラインを実行するコードの概要を以下の図に示します：
zh_cn: 执行管道的代码概览如下图所示：

source: Pipeline code
es: Código del pipeline
ja: パイプラインコード
zh_cn: 管道代码

source: The code to perform the pipeline is shown below:
es: El código para realizar el pipeline se muestra a continuación:
ja: パイプラインを実行するコードを以下に示します：
zh_cn: 执行管道的代码如下所示：

source: It is now possible to visualize the pipeline and the different preprocessing steps that are applied to the spectra.
es: Ahora es posible visualizar el pipeline y los diferentes pasos de preprocesamiento que se aplican a los espectros.
ja: パイプラインとスペクトルに適用される様々な前処理ステップを可視化できるようになりました。
zh_cn: 现在可以可视化管道以及应用于光谱的不同预处理步骤。

source: Notice that in the traditional workflow, the different preprocessing objects had to be persisted individually. In the pipeline workflow, the entire pipeline can be persisted and deployed to a production environment. See the :ref:`persisting-your-models` section for more information.
es: Observe que en el flujo de trabajo tradicional, los diferentes objetos de preprocesamiento tenían que ser persistidos individualmente. En el flujo de trabajo de pipeline, todo el pipeline puede ser persistido y desplegado en un entorno de producción. Consulte la sección :ref:`persisting-your-models` para más información.
ja: 従来のワークフローでは、異なる前処理オブジェクトを個別に永続化する必要があったことに注意してください。パイプラインワークフローでは、パイプライン全体を永続化し、本番環境にデプロイできます。詳細については :ref:`persisting-your-models` セクションを参照してください。
zh_cn: 请注意，在传统工作流程中，不同的预处理对象必须单独持久化。在管道工作流程中，整个管道可以持久化并部署到生产环境。有关更多信息，请参阅 :ref:`persisting-your-models` 部分。
