Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/plotting_fundamentals.po
Languages: es, ja, zh_cn

source: Plotting Fundamentals
es: Fundamentos de graficación
ja: プロットの基礎
zh_cn: 绘图基础

source: The ``chemotools.plotting`` module is designed to make visualizing spectroscopic data and chemometric models **fast**, **intuitive** and **publication-ready**. Instead of writing boilerplate ``matplotlib`` code, you can generate standard chemometric plots with just a few lines.
es: El módulo ``chemotools.plotting`` está diseñado para hacer que la visualización de datos espectroscópicos y modelos quimiométricos sea **rápida**, **intuitiva** y **lista para publicación**. En lugar de escribir código repetitivo de ``matplotlib``, puede generar gráficos quimiométricos estándar con solo unas pocas líneas.
ja: ``chemotools.plotting`` モジュールは、分光データおよびケモメトリックモデルの可視化を、**高速**、**直感的**、かつ**出版レベル**にするために設計されています。 標準的なケモメトリックプロットを、冗長な ``matplotlib`` コードを書く代わりに、数行で生成できます。
zh_cn: ``chemotools.plotting`` 模块旨在使光谱数据和化学计量学模型的可视化变得**快速**、**直观**且**达到发表质量**。无需编写样板式的 ``matplotlib`` 代码，仅用几行即可生成标准的化学计量学图表。

source: The plotting module is experimental and under active development. The API may change in future versions. We welcome your feedback! Please report issues or suggestions at: https://github.com/paucablop/chemotools/issues
es: El módulo de graficación es experimental y está en desarrollo activo. La API puede cambiar en versiones futuras. Agradecemos sus comentarios. Informe problemas o sugerencias en: https://github.com/paucablop/chemotools/issues
ja: このプロットモジュールは実験的であり、現在も積極的に開発が進められています。API は将来のバージョンで変更される可能性があります。 フィードバックを歓迎します。問題や提案は次のリンクから報告してください: https://github.com/paucablop/chemotools/issues
zh_cn: 该绘图模块是实验性的，且正在积极开发中。其API可能在未来的版本中发生变化。我们欢迎您的反馈！请在此处报告问题或建议：https://github.com/paucablop/chemotools/issues

source: Why specialized plotting?
es: ¿Por qué una graficación especializada?
ja: なぜ専用のプロットが必要なのか
zh_cn: 为什么需要专门的绘图工具？

source: Visualizing high-dimensional spectral data and chemometric models often requires repetitive and verbose plotting code. ``chemotools`` simplifies this by providing:
es: Visualizar datos espectrales de alta dimensión y modelos quimiométricos suele requerir código de graficación repetitivo y extenso. ``chemotools`` simplifica esto proporcionando:
ja: 高次元のスペクトルデータやケモメトリックモデルを可視化するには、繰り返し記述される冗長なプロットコードが必要になることが多くあります。 ``chemotools`` は次の機能を提供することでこれを簡素化します:
zh_cn: 可视化高维光谱数据和化学计量学模型通常需要重复且冗长的绘图代码。``chemotools`` 通过提供以下功能来简化这一过程：

source: **Domain-specific plots**: Spectra, scores, loadings, and outlier plots out of the box.
es: **Gráficos específicos del dominio**: Espectros, puntuaciones, cargas y gráficos de valores atípicos listos para usar.
ja: **ドメイン特化プロット**: スペクトル、スコア、ローディング、外れ値プロットをすぐに利用できます。
zh_cn: **领域专用图表**：开箱即用的光谱图、得分图、载荷图和异常值图。

source: **Interactive exploration**: Quick ``show()`` method for immediate feedback.
es: **Exploración interactiva**: Método rápido ``show()`` para retroalimentación inmediata.
ja: **インタラクティブ探索**: ``show()`` メソッドにより即時フィードバックが得られます。
zh_cn: **交互式探索**：用于即时反馈的快速 ``show()`` 方法。

source: **Publication quality**: Clean, standardized aesthetics that look good in papers.
es: **Calidad de publicación**: Estética limpia y estandarizada que luce bien en artículos científicos.
ja: **出版品質**: 論文にも適したクリーンで標準化されたデザイン。
zh_cn: **发表质量**：干净、标准化的美学设计，适合用于论文。

source: Design Philosophy
es: Filosofía de diseño
ja: 設計理念
zh_cn: 设计理念

source: The plotting module is built around a consistent **Display Protocol** designed to balance ease of use with flexibility.
es: El módulo de graficación está construido alrededor de un **Protocolo de Visualización** consistente, diseñado para equilibrar facilidad de uso y flexibilidad.
ja: このプロットモジュールは、使いやすさと柔軟性のバランスを取るために設計された、一貫した **表示プロトコル** を中心に構築されています。
zh_cn: 绘图模块围绕一个一致的**显示协议（Display Protocol）**构建，旨在平衡易用性与灵活性。

source: **Object-Oriented**: Each plot type (e.g., ``SpectraPlot``, ``ScoresPlot``) is a class that holds your data and configuration.
es: **Orientado a objetos**: Cada tipo de gráfico (por ejemplo, ``SpectraPlot``, ``ScoresPlot``) es una clase que contiene sus datos y configuración.
ja: **オブジェクト指向**: 各プロットタイプ（例: ``SpectraPlot``、``ScoresPlot``）はデータと設定を保持するクラスです。
zh_cn: **面向对象**：每种图表类型（例如，``SpectraPlot``、``ScoresPlot``）都是一个保存数据和配置的类。

source: **Two Modes of Operation**:
es: **Dos modos de operación**:
ja: **2 つの操作モード**:
zh_cn: **两种操作模式**：

source: ``show()``: Creates a new figure instantly. Perfect for quick exploration.
es: ``show()``: Crea una nueva figura al instante. Perfecto para exploración rápida.
ja: ``show()``: 新しい図を即座に作成します。迅速な探索に最適です。
zh_cn: ``show()``：即时创建一个新图形。非常适合快速探索。

source: ``render(ax)``: Draws the plot onto an existing matplotlib axis. Designed for building advanced, multi-panel figures and dashboards.
es: ``render(ax)``: Dibuja el gráfico en un eje existente de matplotlib. Diseñado para construir figuras avanzadas multipanel y tableros.
ja: ``render(ax)``: 既存の matplotlib 軸にプロットを描画します。高度なマルチパネル図やダッシュボードを作成するために設計されています。
zh_cn: ``render(ax)``：将图表绘制到现有的matplotlib坐标轴上。专为构建高级、多面板图形和仪表板而设计。

source: **Matplotlib Integration**: All plots return standard ``matplotlib.axes.Axes`` objects, allowing you to add custom annotations, lines, or styling using familiar matplotlib commands.
es: **Integración con Matplotlib**: Todos los gráficos devuelven objetos estándar ``matplotlib.axes.Axes``, permitiéndole añadir anotaciones, líneas o estilos personalizados usando comandos conocidos de matplotlib.
ja: **matplotlib との統合**: すべてのプロットは標準の ``matplotlib.axes.Axes`` オブジェクトを返すため、 注釈・ライン・スタイルの追加などを、通常の matplotlib コマンドで行えます。
zh_cn: **Matplotlib集成**：所有图表都返回标准的 ``matplotlib.axes.Axes`` 对象，允许您使用熟悉的matplotlib命令添加自定义注释、线条或样式。

source: An overview of the plotting architecture is shown below:
es: A continuación se muestra una vista general de la arquitectura de graficación:
ja: プロットアーキテクチャの概要は以下のとおりです:
zh_cn: 绘图架构概述如下：

source: Since ``chemotools`` plotting is built on top of ``matplotlib``, you can use all your favorite ``matplotlib`` commands to further customize the plots returned by ``render()`` or ``show()``.
es: Dado que la graficación de ``chemotools`` está construida sobre ``matplotlib``, puede usar todos sus comandos favoritos de ``matplotlib`` para personalizar los gráficos generados por ``render()`` o ``show()``.
ja: ``chemotools`` のプロットは ``matplotlib`` 上に構築されているため、``render()`` や ``show()`` が返すプロットを、 好みの ``matplotlib`` コマンドで自由にカスタマイズできます。
zh_cn: 由于 ``chemotools`` 绘图建立在 ``matplotlib`` 之上，您可以使用所有喜欢的 ``matplotlib`` 命令来进一步自定义 ``render()`` 或 ``show()`` 返回的图表。

source: Visualizing Spectra
es: Visualización de espectros
ja: スペクトルの可視化
zh_cn: 可视化光谱

source: The ``SpectraPlot`` is your primary tool for exploratory data analysis. It offers flexible ways to visualize your spectral data.
es: ``SpectraPlot`` es su herramienta principal para el análisis exploratorio de datos. Ofrece formas flexibles de visualizar datos espectrales.
ja: ``SpectraPlot`` は探索的データ解析のための主要なツールであり、スペクトルデータを柔軟に可視化できます。
zh_cn: ``SpectraPlot`` 是您进行探索性数据分析的主要工具。它提供了灵活的方式来可视化您的光谱数据。

source: For this example, we will use the fermentation dataset from ``chemotools``.
es: Para este ejemplo, usaremos el conjunto de datos de fermentación de ``chemotools``.
ja: この例では、``chemotools`` に含まれる発酵データセットを使用します。
zh_cn: 在此示例中，我们将使用来自 ``chemotools`` 的发酵数据集。

source: **1. Quick Visualization**
es: **1. Visualización rápida**
ja: **1. クイック可視化**
zh_cn: **1. 快速可视化**

source: To quickly inspect your data, simply pass the wavenumbers and the spectra matrix. This plots all spectra in a single color.
es: Para inspeccionar rápidamente sus datos, simplemente proporcione los números de onda y la matriz de espectros. Esto grafica todos los espectros en un solo color.
ja: データを素早く確認するには、波数とスペクトル行列を渡すだけです。すべてのスペクトルが単一の色でプロットされます。
zh_cn: 要快速检查您的数据，只需传入波数和光谱矩阵。这将以单一颜色绘制所有光谱。

source: During exploration, you might want to inspect a specific region of the spectra. You can do this by specifying ``xlim`` in the ``show()`` method (see below).
es: Durante la exploración, puede que desee inspeccionar una región específica del espectro. Puede hacerlo especificando ``xlim`` en el método ``show()`` (ver más adelante).
ja: 探索中に、スペクトルの特定領域を確認したい場合があります。これは ``show()`` メソッドで ``xlim`` を指定することで可能です（下記参照）。
zh_cn: 在探索过程中，您可能希望检查光谱的特定区域。您可以通过在 ``show()`` 方法中指定 ``xlim`` 来实现（见下文）。

source: The ``SpectraPlot`` automatically handles y-axis scaling based on the data range. You can also manually set ``ylim`` to focus on specific features.
es: ``SpectraPlot`` gestiona automáticamente la escala del eje y en función del rango de datos. También puede establecer manualmente ``ylim`` para centrarse en características específicas.
ja: ``SpectraPlot`` はデータ範囲に基づいて y 軸スケールを自動調整します。特定の特徴に焦点を当てたい場合、``ylim`` を手動で設定できます。
zh_cn: ``SpectraPlot`` 会根据数据范围自动处理y轴缩放。您也可以手动设置 ``ylim`` 以聚焦于特定特征。

source: **2. Coloring by Continuous Variable**
es: **2. Coloreo por variable continua**
ja: **2. 連続変数による着色**
zh_cn: **2. 按连续变量着色**

source: You can color spectra based on a continuous target variable (like glucose concentration) to visualize correlations.
es: Puede colorear los espectros según una variable continua objetivo (como la concentración de glucosa) para visualizar correlaciones.
ja: 連続ターゲット変数（例: グルコース濃度）に基づきスペクトルを着色し、相関を視覚化できます。
zh_cn: 您可以根据连续目标变量（如葡萄糖浓度）为光谱着色，以可视化相关性。

source: **3. Coloring by Categorical Variable**
es: **3. Coloreo por variable categórica**
ja: **3. カテゴリ変数による着色**
zh_cn: **3. 按分类变量着色**

source: If you have categorical data (e.g., batches, experimental conditions), you can color by groups.
es: Si dispone de datos categóricos (por ejemplo, lotes o condiciones experimentales), puede colorear por grupos.
ja: カテゴリデータ（例: バッチ、実験条件）がある場合、グループごとに着色できます。
zh_cn: 如果您有分类数据（例如，批次、实验条件），可以按组着色。

source: Analyzing Models
es: Análisis de modelos
ja: モデルの解析
zh_cn: 分析模型

source: After fitting a chemometric model (like PCA or PLS), visualizing the results is crucial for interpretation. For this section, we will use a toy PCA model fitted with the fermentation data from ``chemotools``.
es: Después de ajustar un modelo quimiométrico (como PCA o PLS), visualizar los resultados es crucial para su interpretación. Para esta sección, utilizaremos un modelo PCA de ejemplo ajustado con los datos de fermentación de ``chemotools``.
ja: PCA や PLS のようなケモメトリックモデルを適合した後、その結果を可視化することは解釈に不可欠です。 このセクションでは、``chemotools`` の発酵データを使用して適合した簡易 PCA モデルを使用します。
zh_cn: 拟合化学计量学模型（如PCA或PLS）后，可视化结果对于解释至关重要。在本节中，我们将使用一个基于 ``chemotools`` 发酵数据拟合的简单PCA模型。

source: **Explained Variance: Choosing Components**
es: **Varianza explicada: selección de componentes**
ja: **寄与率: コンポーネントの選択**
zh_cn: **解释方差：选择成分**

source: Before analyzing scores and loadings, it is often useful to check how much variance each component explains. The ``ExplainedVariancePlot`` helps you decide the optimal number of components.
es: Antes de analizar las puntuaciones y las cargas, suele ser útil comprobar cuánta varianza explica cada componente. ``ExplainedVariancePlot`` le ayuda a decidir el número óptimo de componentes.
ja: スコアやローディングを解析する前に、各コンポーネントがどれだけの分散を説明するかを確認することが有用です。 ``ExplainedVariancePlot`` は最適なコンポーネント数を決定するのに役立ちます。
zh_cn: 在分析得分和载荷之前，检查每个成分解释了多少方差通常很有用。``ExplainedVariancePlot`` 帮助您决定最佳成分数量。

source: **Scores: The Sample Space**
es: **Puntuaciones: el espacio de muestras**
ja: **スコア: サンプル空間**
zh_cn: **得分：样本空间**

source: Use ``ScoresPlot`` to visualize how samples relate to each other. This is essential for identifying clusters, trends, or outliers. The ``ScoresPlot`` is highly flexible and can be used to create composite figures to show different aspects of your model, such as confidence ellipses and sample annotations.
es: Utilice ``ScoresPlot`` para visualizar cómo se relacionan entre sí las muestras. Esto es esencial para identificar agrupamientos, tendencias o valores atípicos. ``ScoresPlot`` es altamente flexible y puede utilizarse para crear figuras compuestas que muestren distintos aspectos de su modelo, como elipses de confianza y anotaciones de muestras.
ja: ``ScoresPlot`` を使用すると、サンプル間の関係を視覚化できます。これはクラスタ、トレンド、外れ値を特定するために重要です。 ``ScoresPlot`` は非常に柔軟で、信頼楕円やサンプル注釈などモデルのさまざまな側面を示す複合図の作成にも利用できます。
zh_cn: 使用 ``ScoresPlot`` 可视化样本之间的相互关系。这对于识别聚类、趋势或异常值至关重要。``ScoresPlot`` 高度灵活，可用于创建复合图形以显示模型的不同方面，例如置信椭圆和样本注释。

source: Since we are composing two plots into a single figure, we used the ``render(ax=...)`` method to draw each plot onto specific axes. This allows for precise control over layout and styling.
es: Como estamos componiendo dos gráficos en una sola figura, utilizamos el método ``render(ax=...)`` para dibujar cada gráfico en ejes específicos. Esto permite un control preciso sobre el diseño y el estilo.
ja: 2 つのプロットを 1 つの図にまとめるために、``render(ax=...)`` メソッドを使用してそれぞれを特定の軸に描画しました。 これによりレイアウトやスタイルを正確に制御できます。
zh_cn: 由于我们将两个图表组合到一个图形中，我们使用 ``render(ax=...)`` 方法将每个图表绘制到特定的坐标轴上。这样可以精确控制布局和样式。

source: **Loadings: The Feature Space**
es: **Cargas: el espacio de características**
ja: **ローディング: 特徴空間**
zh_cn: **载荷：特征空间**

source: Use ``LoadingsPlot`` to understand which spectral features contribute most to the model.
es: Utilice ``LoadingsPlot`` para entender qué características espectrales contribuyen más al modelo.
ja: ``LoadingsPlot`` を使用すると、モデルに最も寄与するスペクトル特徴を理解できます。
zh_cn: 使用 ``LoadingsPlot`` 来理解哪些光谱特征对模型的贡献最大。

source: **Outlier Detection**
es: **Detección de valores atípicos**
ja: **外れ値検出**
zh_cn: **异常值检测**

source: Use ``DistancesPlot`` to identify samples that don't fit the model well, using metrics like Hotelling's T² and Q-residuals. See :doc:`/methods/outliers` for more details on calculating these statistics.
es: Use ``DistancesPlot`` para identificar muestras que no se ajustan bien al modelo, utilizando métricas como T² de Hotelling y residuos Q. Consulte :doc:`/methods/outliers` para más detalles sobre el cálculo de estas estadísticas.
ja: Hotelling の T² や Q 残差などの指標を用いて、モデルに適合しないサンプルを特定するには ``DistancesPlot`` を使用します。 これらの統計量の計算方法については :doc:`/methods/outliers` を参照してください。
zh_cn: 使用 ``DistancesPlot`` 来识别与模型拟合不佳的样本，使用诸如Hotelling's T²和Q残差等指标。有关计算这些统计量的更多详细信息，请参见 :doc:`/methods/outliers`。

source: Now, we are ready to visualize the results.
es: Ahora estamos listos para visualizar los resultados.
ja: これで結果を可視化する準備が整いました。
zh_cn: 现在，我们准备可视化结果。

source: Evaluating Predictions
es: Evaluación de predicciones
ja: 予測の評価
zh_cn: 评估预测

source: For regression models, the ``PredictedVsActualPlot`` provides a standard way to assess model performance.
es: Para modelos de regresión, ``PredictedVsActualPlot`` proporciona una forma estándar de evaluar el rendimiento del modelo.
ja: 回帰モデルでは、``PredictedVsActualPlot`` がモデル性能を評価する標準的な手段となります。
zh_cn: 对于回归模型，``PredictedVsActualPlot`` 提供了一种评估模型性能的标准方法。

source: Creating Composite Figures
es: Creación de figuras compuestas
ja: 複合図の作成
zh_cn: 创建复合图形

source: All plotting classes support a ``render(ax=...)`` method, allowing you to place plots onto existing matplotlib axes. This is powerful for creating dashboards or comparison figures.
es: Todas las clases de graficación admiten el método ``render(ax=...)``, que permite colocar gráficos en ejes existentes de matplotlib. Esto es muy útil para crear paneles o figuras comparativas.
ja: すべてのプロットクラスは ``render(ax=...)`` メソッドをサポートしており、既存の matplotlib 軸にプロットを配置できます。 これはダッシュボードや比較図の作成に非常に有用です。
zh_cn: 所有绘图类都支持 ``render(ax=...)`` 方法，允许您将图表放置在现有的matplotlib坐标轴上。这对于创建仪表板或对比图形非常强大。

source: Other Available Plots
es: Otros gráficos disponibles
ja: その他の利用可能なプロット
zh_cn: 其他可用图表

source: The ``chemotools.plotting`` module includes other specialized plots not covered in this guide:
es: El módulo ``chemotools.plotting`` incluye otros gráficos especializados no cubiertos en esta guía:
ja: ``chemotools.plotting`` モジュールには、このガイドで扱っていない専用プロットも含まれています:
zh_cn: ``chemotools.plotting`` 模块包含本指南未涵盖的其他专业图表：

source: ``FeatureSelectionPlot``: Visualize feature importance and selection results.
es: ``FeatureSelectionPlot``: Visualiza la importancia de características y los resultados de selección.
ja: ``FeatureSelectionPlot``: 特徴量の重要度および選択結果を可視化します。
zh_cn: ``FeatureSelectionPlot``：可视化特征重要性和选择结果。

source: ``QQPlot``: Check for normality of residuals.
es: ``QQPlot``: Comprueba la normalidad de los residuos.
ja: ``QQPlot``: 残差の正規性を確認します。
zh_cn: ``QQPlot``：检查残差的正态性。

source: ``ResidualDistributionPlot``: Analyze the distribution of model residuals.
es: ``ResidualDistributionPlot``: Analiza la distribución de los residuos del modelo.
ja: ``ResidualDistributionPlot``: モデル残差の分布を解析します。
zh_cn: ``ResidualDistributionPlot``：分析模型残差的分布。

source: ``YResidualsPlot``: Plot residuals against predicted values.
es: ``YResidualsPlot``: Grafica los residuos frente a los valores predichos.
ja: ``YResidualsPlot``: 残差を予測値に対してプロットします。
zh_cn: ``YResidualsPlot``：绘制残差与预测值的图表。

source: Check the API reference for more details on these classes.
es: Consulte la referencia de la API para más detalles sobre estas clases.
ja: これらのクラスの詳細については API リファレンスを参照してください。
zh_cn: 查看API参考以获取有关这些类的更多详细信息。
