Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/sklearn.po
Languages: es, ja, zh_cn

source: Why Scikit-Learn?
es: ¿Por qué Scikit-Learn?
ja: Scikit-Learnを選ぶ理由
zh_cn: 为什么选择 Scikit-Learn？

source: Scikit-Learn brings modern machine learning tools to chemometrics—making workflows more flexible, scalable, and easy to prototype and validate.
es: Scikit-Learn trae herramientas modernas de aprendizaje automático a la quimiometría, haciendo que los flujos de trabajo sean más flexibles, escalables y fáciles de prototipar y validar.
ja: Scikit-Learnは、現代の機械学習ツールをケモメトリクスにもたらし、ワークフローをより柔軟でスケーラブルにし、プロトタイピングと検証を容易にします。
zh_cn: Scikit-Learn 将现代机器学习工具引入化学计量学——使工作流程更加灵活、可扩展，并且易于原型设计和验证。

source: **Flexibility**: Works with various chemometric models and preprocessing methods.
es: **Flexibilidad**: Funciona con varios modelos quimiométricos y métodos de preprocesamiento.
ja: 柔軟性：様々なケモメトリクスモデルおよび前処理手法と連携します。
zh_cn: 灵活性：可与各种化学计量学模型和预处理方法配合使用。

source: **Integration**: Can be combined with domain-specific tools for spectral analysis, multivariate statistics, and experimental design.
es: **Integración**: Se puede combinar con herramientas específicas del dominio para análisis espectral, estadística multivariante y diseño experimental.
ja: 統合性：スペクトル分析、多変量統計、実験計画法のためのドメイン固有のツールと組み合わせることができます。
zh_cn: 集成性：可与特定领域工具结合，用于光谱分析、多元统计和实验设计。

source: **Scalability**: Can handle small laboratory datasets as well as large-scale industrial data.
es: **Escalabilidad**: Puede manejar pequeños conjuntos de datos de laboratorio así como datos industriales a gran escala.
ja: スケーラビリティ：小規模な実験室データセットから大規模な産業データまで扱うことができます。
zh_cn: 可扩展性：既能处理小型实验室数据集，也能处理大规模的工业数据。

source: **Easy Experimentation**: Rapid prototyping with different algorithms and preprocessing techniques.
es: **Experimentación fácil**: Prototipado rápido con diferentes algoritmos y técnicas de preprocesamiento.
ja: 容易な実験：様々なアルゴリズムと前処理技術による迅速なプロトタイピングが可能です。
zh_cn: 易于实验：使用不同算法和预处理技术进行快速原型设计。

source: What is Scikit-Learn?
es: ¿Qué es Scikit-Learn?
ja: Scikit-Learnとは
zh_cn: 什么是 Scikit-Learn？

source: `Scikit-learn <https://scikit-learn.org/>`_ (``sklearn``) is an open-source machine-learning library built on top of **NumPy**, **SciPy**. It offers a unified API for various machine-learning techniques, including:
es: `Scikit-learn <https://scikit-learn.org/>`_ (``sklearn``) es una biblioteca de aprendizaje automático de código abierto construida sobre **NumPy** y **SciPy**. Ofrece una API unificada para varias técnicas de aprendizaje automático, incluyendo:
ja: `Scikit-learn <https://scikit-learn.org/>`_ ( ``sklearn`` ) は、 **NumPy** , **SciPy** 上に構築されたオープンソースの機械学習ライブラリです。以下のような様々な機械学習技術に対して統一されたAPIを提供します：
zh_cn: `Scikit-learn <https://scikit-learn.org/>`_ (``sklearn``) 是一个基于 **NumPy**、**SciPy** 构建的开源机器学习库。它为各种机器学习技术提供统一的 API，包括：

source: **Supervised learning**: Regression, classification, and ensemble methods
es: **Aprendizaje supervisado**: Regresión, clasificación y métodos de conjunto
ja: 教師あり学習：回帰、分類、アンサンブル手法
zh_cn: 监督学习：回归、分类和集成方法

source: **Unsupervised learning**: Clustering and dimensionality reduction
es: **Aprendizaje no supervisado**: Agrupamiento y reducción de dimensionalidad
ja: 教師なし学習：クラスタリングと次元削減
zh_cn: 无监督学习：聚类和降维

source: **Data preprocessing**: Feature scaling, encoding, and transformation
es: **Preprocesamiento de datos**: Escalado de características, codificación y transformación
ja: データ前処理：特徴量スケーリング、エンコーディング、変換
zh_cn: 数据预处理：特征缩放、编码和转换

source: **Model evaluation**: Cross-validation, metrics, and hyperparameter tuning
es: **Evaluación de modelos**: Validación cruzada, métricas y ajuste de hiperparámetros
ja: モデル評価：交差検証、評価指標、ハイパーパラメータチューニング
zh_cn: 模型评估：交叉验证、指标和超参数调优

source: ``scikit-learn`` is widely used in research and industry due to its simplicity, efficiency, and extensive documentation.
es: ``scikit-learn`` es ampliamente utilizado en investigación e industria debido a su simplicidad, eficiencia y extensa documentación.
ja: ``scikit-learn`` は、そのシンプルさ、効率性、そして充実したドキュメントにより、研究および産業界で広く使用されています。
zh_cn: ``scikit-learn`` 因其简单性、高效性和丰富的文档而在研究和工业领域得到广泛应用。

source: A Broad Toolbox of Models and Methods
es: Una Amplia Caja de Herramientas de Modelos y Métodos
ja: 幅広いモデルと手法のツールボックス
zh_cn: 广泛的模型和方法工具箱

source: One of the biggest strengths of ``scikit-learn`` is its vast selection of models and tools. Some key categories include:
es: Una de las mayores fortalezas de ``scikit-learn`` es su amplia selección de modelos y herramientas. Algunas categorías clave incluyen:
ja: ``scikit-learn`` の最大の強みの1つは、その豊富なモデルとツールの選択肢です。主なカテゴリには以下が含まれます：
zh_cn: ``scikit-learn`` 的最大优势之一是其丰富的模型和工具选择。一些关键类别包括：

source: Regression
es: Regresión
ja: 回帰
zh_cn: 回归

source: **Linear Regression** (``LinearRegression``): A simple yet effective model for continuous target variables.
es: **Regresión Lineal** (``LinearRegression``): Un modelo simple pero efectivo para variables objetivo continuas.
ja: 線形回帰 ( ``LinearRegression`` ) ：連続的な目的変数に対するシンプルかつ効果的なモデル。
zh_cn: 线性回归 (``LinearRegression``)：一个简单但有效的连续目标变量模型。

source: **Partial Least Squares** (``PLSRegression``): A powerful method often used in chemometrics.
es: **Mínimos Cuadrados Parciales** (``PLSRegression``): Un método poderoso frecuentemente usado en quimiometría.
ja: 部分最小二乗回帰 ( ``PLSRegression`` ) ：ケモメトリクスで頻繁に使用される強力な手法。
zh_cn: 偏最小二乘法 (``PLSRegression``)：化学计量学中常用的强大方法。

source: **Support Vector Regression** (``SVR``): Effective for nonlinear relationships.
es: **Regresión de Vectores de Soporte** (``SVR``): Efectivo para relaciones no lineales.
ja: サポートベクター回帰 ( ``SVR`` ) ：非線形関係に対して効果的です。
zh_cn: 支持向量回归 (``SVR``)：对非线性关系有效。

source: Classification
es: Clasificación
ja: 分類
zh_cn: 分类

source: **Logistic Regression** (``LogisticRegression``): For binary and multi-class classification.
es: **Regresión Logística** (``LogisticRegression``): Para clasificación binaria y multiclase.
ja: ロジスティック回帰 ( ``LogisticRegression`` ) ：二値および多クラス分類用。
zh_cn: 逻辑回归 (``LogisticRegression``)：用于二元和多类分类。

source: **Random Forest** (``RandomForestClassifier``): A robust ensemble method for better accuracy.
es: **Bosque Aleatorio** (``RandomForestClassifier``): Un método de conjunto robusto para mejor precisión.
ja: ランダムフォレスト ( ``RandomForestClassifier`` ) ：より高い精度を得るための堅牢なアンサンブル手法。
zh_cn: 随机森林 (``RandomForestClassifier``)：一种稳健的集成方法，可提高准确性。

source: **Support Vector Machines** (``SVC``): Effective for complex decision boundaries.
es: **Máquinas de Vectores de Soporte** (``SVC``): Efectivo para fronteras de decisión complejas.
ja: サポートベクターマシン ( ``SVC`` ) ：複雑な決定境界に対して効果的です。
zh_cn: 支持向量机 (``SVC``)：对复杂决策边界有效。

source: Dimensionality Reduction
es: Reducción de Dimensionalidad
ja: 次元削減
zh_cn: 降维

source: **Principal Component Analysis** (``PCA``): Extracts the most important features in your dataset.
es: **Análisis de Componentes Principales** (``PCA``): Extrae las características más importantes de tu conjunto de datos.
ja: 主成分分析 ( ``PCA`` ) ：データセット内の最も重要な特徴量を抽出します。
zh_cn: 主成分分析 (``PCA``)：提取数据集中最重要的特征。

source: **Non Negative Matrix Factorization** (``NMF``): Useful for signal decomposition.
es: **Factorización de Matrices No Negativas** (``NMF``): Útil para descomposición de señales.
ja: 非負値行列因子分解 ( ``NMF`` ) ：信号分解に有用です。
zh_cn: 非负矩阵分解 (``NMF``)：对信号分解有用。

source: **t-SNE** (``TSNE``): Helps visualize complex high-dimensional data.
es: **t-SNE** (``TSNE``): Ayuda a visualizar datos complejos de alta dimensionalidad.
ja: t-SNE ( ``TSNE`` ) ：複雑な高次元データの可視化を支援します。
zh_cn: t-SNE (``TSNE``)：有助于可视化复杂的高维数据。

source: Preprocessing Tools
es: Herramientas de Preprocesamiento
ja: 前処理ツール
zh_cn: 预处理工具

source: **Feature Scaling** (``StandardScaler``, ``MinMaxScaler``): Essential for models that rely on distance metrics.
es: **Escalado de Características** (``StandardScaler``, ``MinMaxScaler``): Esencial para modelos que dependen de métricas de distancia.
ja: 特徴量スケーリング ( ``StandardScaler`` , ``MinMaxScaler`` ) ：距離指標に依存するモデルにとって必須です。
zh_cn: 特征缩放 (``StandardScaler``, ``MinMaxScaler``)：对于依赖距离度量的模型至关重要。

source: **Encoding Categorical Data** (``OneHotEncoder``, ``LabelEncoder``): Transforms categorical variables into numerical format.
es: **Codificación de Datos Categóricos** (``OneHotEncoder``, ``LabelEncoder``): Transforma variables categóricas a formato numérico.
ja: カテゴリカルデータのエンコーディング ( ``OneHotEncoder`` , ``LabelEncoder`` ) ：カテゴリカル変数を数値形式に変換します。
zh_cn: 分类数据编码 (``OneHotEncoder``, ``LabelEncoder``)：将分类变量转换为数值格式。

source: **Feature Selection** (``SelectKBest``, ``RFE``): Helps choose the most relevant variables.
es: **Selección de Características** (``SelectKBest``, ``RFE``): Ayuda a elegir las variables más relevantes.
ja: 特徴量選択 ( ``SelectKBest`` , ``RFE`` ) ：最も関連性の高い変数を選択するのに役立ちます。
zh_cn: 特征选择 (``SelectKBest``, ``RFE``)：帮助选择最相关的变量。

source: The scikit-learn workflow
es: El flujo de trabajo de scikit-learn
ja: scikit-learnのワークフロー
zh_cn: Scikit-learn 工作流程

source: Scikit-learn follows an intuitive three-step process outlined in the figure below:
es: Scikit-learn sigue un proceso intuitivo de tres pasos descrito en la figura a continuación:
ja: Scikit-learnは、以下の図に示す直感的な3ステップのプロセスに従います：
zh_cn: Scikit-learn 遵循以下图中概述的直观三步流程：

source: scikit-learn workflow
es: Flujo de trabajo de scikit-learn
ja: scikit-learnワークフロー
zh_cn: scikit-learn 工作流程

source: **Define**: Configure the model/preprocessing parameters.
es: **Definir**: Configurar los parámetros del modelo/preprocesamiento.
ja: 定義：モデル/前処理のパラメータを設定します。
zh_cn: 定义：配置模型/预处理参数。

source: **Fit**: The model learns patterns from training data using ``fit()``
es: **Ajustar**: El modelo aprende patrones de los datos de entrenamiento usando ``fit()``
ja: 学習：モデルが ``fit()`` を使用して訓練データからパターンを学習します。
zh_cn: 拟合：模型使用 ``fit()`` 从训练数据中学习模式。

source: **Apply**: The fitted model processes new data using either:
es: **Aplicar**: El modelo ajustado procesa nuevos datos usando:
ja: 適用：学習済みモデルが以下のいずれかを使用して新しいデータを処理します：
zh_cn: 应用：拟合的模型使用以下任一方法处理新数据：

source: ``transform()`` for preprocessing steps and unsupervised learning
es: ``transform()`` para pasos de preprocesamiento y aprendizaje no supervisado
ja: 前処理ステップと教師なし学習には ``transform()``
zh_cn: ``transform()`` 用于预处理步骤和无监督学习

source: ``predict()`` for supervised learning models (classification and regression)
es: ``predict()`` para modelos de aprendizaje supervisado (clasificación y regresión)
ja: 教師あり学習モデル（分類と回帰）には ``predict()``
zh_cn: ``predict()`` 用于监督学习模型（分类和回归）

source: Let's see two examples, one for a preprocessing and one for a regression model. First, import the required modules:
es: Veamos dos ejemplos, uno para preprocesamiento y otro para un modelo de regresión. Primero, importa los módulos requeridos:
ja: 前処理と回帰モデルの2つの例を見てみましょう。まず、必要なモジュールをインポートします：
zh_cn: 让我们看两个例子，一个是预处理，一个是回归模型。首先，导入所需的模块：

source: Preprocessing with ``StandardScaler``:
es: Preprocesamiento con ``StandardScaler``:
ja: ``StandardScaler`` による前処理：
zh_cn: 使用 ``StandardScaler`` 进行预处理：

source: Building a ``PLSRegression`` model:
es: Construyendo un modelo de ``PLSRegression``:
ja: ``PLSRegression`` モデルの構築：
zh_cn: 构建 ``PLSRegression`` 模型：

source: Extended Ecosystem
es: Ecosistema Extendido
ja: 拡張エコシステム
zh_cn: 扩展生态系统

source: In addition to the ``scikit-learn`` main packages, the ecosystem includes a broad range of complementary open-source libraries that extend its functionality:
es: Además de los paquetes principales de ``scikit-learn``, el ecosistema incluye una amplia gama de bibliotecas complementarias de código abierto que extienden su funcionalidad:
ja: ``scikit-learn`` の主要パッケージに加えて、その機能を拡張する幅広い補完的なオープンソースライブラリがエコシステムに含まれています：
zh_cn: 除了 ``scikit-learn`` 主包之外，该生态系统还包括一系列扩展其功能的互补开源库：

source: `skore <https://docs.skore.probabl.ai/>`_: Streamline and structure model development and interpretation.
es: `skore <https://docs.skore.probabl.ai/>`_: Optimiza y estructura el desarrollo e interpretación de modelos.
ja: `skore <https://docs.skore.probabl.ai/>`_ ：モデルの開発と解釈を効率化し構造化します。
zh_cn: `skore <https://docs.skore.probabl.ai/>`_：简化和结构化模型开发与解释。

source: `astartes <https://jacksonburns.github.io/astartes/README.html>`_: Algorithmic techniques for splitting data into training and test sets.
es: `astartes <https://jacksonburns.github.io/astartes/README.html>`_: Técnicas algorítmicas para dividir datos en conjuntos de entrenamiento y prueba.
ja: `astartes <https://jacksonburns.github.io/astartes/README.html>`_ ：データを訓練セットとテストセットに分割するためのアルゴリズム技術。
zh_cn: `astartes <https://jacksonburns.github.io/astartes/README.html>`_：将数据拆分为训练集和测试集的算法技术。

source: `Imbalanced-learn <https://imbalanced-learn.org/stable/>`_: Techniques for handling imbalanced datasets.
es: `Imbalanced-learn <https://imbalanced-learn.org/stable/>`_: Técnicas para manejar conjuntos de datos desbalanceados.
ja: `Imbalanced-learn <https://imbalanced-learn.org/stable/>`_ ：不均衡データセットを扱うための技術。
zh_cn: `Imbalanced-learn <https://imbalanced-learn.org/stable/>`_：处理不平衡数据集的技术。

source: `skops <https://skops.readthedocs.io/en/stable/>`_: Tools for serializing and sharing machine learning models.
es: `skops <https://skops.readthedocs.io/en/stable/>`_: Herramientas para serializar y compartir modelos de aprendizaje automático.
ja: `skops <https://skops.readthedocs.io/en/stable/>`_ ：機械学習モデルをシリアライズおよび共有するためのツール。
zh_cn: `skops <https://skops.readthedocs.io/en/stable/>`_：用于序列化和共享机器学习模型的工具。
