Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/explore/spectra.po
Languages: es, ja, zh_cn

source: Working with spectra
es: Trabajando con espectros
ja: スペクトルの操作
zh_cn: 处理光谱数据

source: When working with spectroscopic data in ``chemotools`` and ``scikit-learn``, you often need to reshape single spectra to fit the expected data shapes. This guide explains how to reshape single spectra for preprocessing in ``scikit-learn`` and ``chemotools``.
es: Al trabajar con datos espectroscópicos en ``chemotools`` y ``scikit-learn``, a menudo necesitas remodelar espectros individuales para que se ajusten a las formas de datos esperadas. Esta guía explica cómo remodelar espectros individuales para preprocesamiento en ``scikit-learn`` y ``chemotools``.
ja: ``chemotools`` および ``scikit-learn`` で分光データを扱う場合、単一のスペクトルを期待されるデータ形状に合わせてリシェイプする必要が頻繁に生じます。このガイドでは、 ``scikit-learn`` および ``chemotools`` での前処理のために単一スペクトルをリシェイプする方法について説明します。
zh_cn: 在 ``chemotools`` 和 ``scikit-learn`` 中处理光谱数据时，通常需要重新调整单个光谱的形状以符合预期的数据格式。本指南说明如何为 ``scikit-learn`` 和 ``chemotools`` 中的预处理重新调整单个光谱的形状。

source: Understanding Data Shapes
es: Comprendiendo las Formas de Datos
ja: データ形状の理解
zh_cn: 理解数据形状

source: ``chemotools`` and ``scikit-learn`` preprocessing techniques expect 2D arrays (matrices) where:
es: Las técnicas de preprocesamiento de ``chemotools`` y ``scikit-learn`` esperan arreglos 2D (matrices) donde:
ja: ``chemotools`` および ``scikit-learn`` の前処理技術は、以下のような2次元配列（行列）を想定しています：
zh_cn: ``chemotools`` 和 ``scikit-learn`` 的预处理技术期望使用二维数组（矩阵），其中：

source: Each row represents a sample
es: Cada fila representa una muestra
ja: 各行が1つのサンプルを表します
zh_cn: 每一行代表一个样本

source: Each column represents a feature
es: Cada columna representa una característica
ja: 各列が1つの特徴量を表します
zh_cn: 每一列代表一个特征

source: However, spectroscopic data often comes as single spectrum in 1D arrays (vectors). Here's an example of a single spectrum:
es: Sin embargo, los datos espectroscópicos a menudo vienen como un espectro individual en arreglos 1D (vectores). Aquí hay un ejemplo de un espectro individual:
ja: しかしながら、分光データはしばしば1次元配列（ベクトル）としての単一スペクトルとして提供されます。以下に単一スペクトルの例を示します：
zh_cn: 然而，光谱数据通常以一维数组（向量）形式的单个光谱出现。以下是一个单个光谱的示例：

source: To use ``chemotools`` and ``scikit-learn`` with single spectra, you need to reshape the 1D array into a 2D array with one row.
es: Para usar ``chemotools`` y ``scikit-learn`` con espectros individuales, necesitas remodelar el arreglo 1D en un arreglo 2D con una fila.
ja: 単一のスペクトルで ``chemotools`` および ``scikit-learn`` を使用するには、1次元配列を1行の2次元配列にリシェイプする必要があります。
zh_cn: 要在单个光谱上使用 ``chemotools`` 和 ``scikit-learn``，您需要将一维数组重新调整为只有一行的二维数组。

source: Reshaping for Preprocessing
es: Remodelando para Preprocesamiento
ja: 前処理のためのリシェイプ
zh_cn: 为预处理重新调整形状

source: Here's how to reshape a 1D array into a 2D array with a single row:
es: Aquí se muestra cómo remodelar un arreglo 1D en un arreglo 2D con una sola fila:
ja: 1次元配列を単一行の2次元配列にリシェイプする方法は以下の通りです：
zh_cn: 以下是如何将一维数组重新调整为只有一行的二维数组：

source: The ``reshape(1, -1)`` method converts the 1D array ``spectra_1d`` into a 2D array with a single row. The result (``spectra_2d``) looks like this:
es: El método ``reshape(1, -1)`` convierte el arreglo 1D ``spectra_1d`` en un arreglo 2D con una sola fila. El resultado (``spectra_2d``) se ve así:
ja: ``reshape(1, -1)`` メソッドは、1次元配列 ``spectra_1d`` を単一行の2次元配列に変換します。結果 ( ``spectra_2d`` ) は以下のようになります：
zh_cn: ``reshape(1, -1)`` 方法将一维数组 ``spectra_1d`` 转换为只有一行的二维数组。结果（``spectra_2d``）如下所示：

source: The reshaped output is a 2D array with a single row - the format required by ``scikit-learn`` and ``chemotools`` preprocessing techniques.
es: La salida remodelada es un arreglo 2D con una sola fila - el formato requerido por las técnicas de preprocesamiento de ``scikit-learn`` y ``chemotools``.
ja: リシェイプされた出力は単一行の2次元配列であり、これは ``scikit-learn`` および ``chemotools`` の前処理技術で要求される形式です。
zh_cn: 重新调整后的输出是一个只有一行的二维数组——这是 ``scikit-learn`` 和 ``chemotools`` 预处理技术所需的格式。

source: Now, you can use the reshaped single spectrum with ``chemotools`` and ``scikit-learn`` preprocessing techniques:
es: Ahora, puedes usar el espectro individual remodelado con las técnicas de preprocesamiento de ``chemotools`` y ``scikit-learn``:
ja: これで、リシェイプされた単一スペクトルを ``chemotools`` および ``scikit-learn`` の前処理技術で使用できるようになります：
zh_cn: 现在，您可以将重新调整形状后的单个光谱与 ``chemotools`` 和 ``scikit-learn`` 预处理技术一起使用：
