Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/learn/pls_regression.po
Languages: es

source: **Glucose monitoring with PLS**
es: **Monitoreo de glucosa con PLS**

source: 💡\ **NOTE:** This document is a Jupyter notebook. You can download the source file and run it in your Jupyter environment!
es: 💡\ **NOTA:** Este documento es un notebook de Jupyter. ¡Puedes descargar el archivo fuente y ejecutarlo en tu entorno Jupyter!

source: **Introduction**
es: **Introducción**

source: This dataset provides information on lignocellulosic ethanol fermentation through spectroscopic data collected data using attenuated total reflectance, mid-infrared (ATR-MIR) spectroscopy, along with reference measurements using high-performance liquid chromatography (HPLC) for validation.
es: Este conjunto de datos proporciona información sobre fermentación de etanol lignocelulósico a través de datos espectroscópicos recopilados usando espectroscopía de reflectancia total atenuada infrarroja media (ATR-MIR), junto con mediciones de referencia usando cromatografía líquida de alto rendimiento (HPLC) para validación.

source: The project contains two datasets:
es: El proyecto contiene dos conjuntos de datos:

source: **Training Dataset:** Contains spectral data with corresponding HPLC measurements used to train the partial least squares (PLS) models.
es: **Conjunto de datos de entrenamiento:** Contiene datos espectrales con mediciones HPLC correspondientes usadas para entrenar los modelos de mínimos cuadrados parciales (PLS).

source: **Testing Dataset:** Includes a time series of spectra collected during fermentation, plus off-line HPLC measurements.
es: **Conjunto de datos de prueba:** Incluye una serie temporal de espectros recopilados durante la fermentación, más mediciones HPLC fuera de línea.

source: For more information about these datasets and how they can be used to monitor fermentation, please see our article: "Transforming Data to Information: A Parallel Hybrid Model for Real-Time State Estimation in Lignocellulosic Ethanol Fermentation." (Note that the data in the article differs from the data provided here.)
es: Para más información sobre estos conjuntos de datos y cómo pueden usarse para monitorear la fermentación, consulta nuestro artículo: "Transformando datos en información: Un modelo híbrido paralelo para estimación de estado en tiempo real en fermentación de etanol lignocelulósico". (Nota que los datos en el artículo difieren de los datos proporcionados aquí.)

source: **Objective**
es: **Objetivo**

source: In this exercise, you will build a PLS model to monitor glucose concentration in real-time using ATR-MIR spectroscopy. You'll train the model using a small training set of spiked spectra, then test its performance with spectra from an actual fermentation process.
es: En este ejercicio, construirás un modelo PLS para monitorear la concentración de glucosa en tiempo real usando espectroscopía ATR-MIR. Entrenarás el modelo usando un pequeño conjunto de entrenamiento de espectros enriquecidos, luego probarás su rendimiento con espectros de un proceso de fermentación real.

source: **Before starting**
es: **Antes de comenzar**

source: Before we start, you need to be sure to have the following dependencies installed:
es: Antes de comenzar, debes asegurarte de tener las siguientes dependencias instaladas:

source: You can install them using
es: Puedes instalarlas usando

source: **Loading the training data**
es: **Cargando los datos de entrenamiento**

source: You can access the from the ``chemotools.datasets`` module with the ``load_fermentation_train()`` function.
es: Puedes acceder desde el módulo ``chemotools.datasets`` con la función ``load_fermentation_train()``.

source: The ``load_fermentation_train()`` function returns two ``pandas.DataFrame``:
es: La función ``load_fermentation_train()`` devuelve dos ``pandas.DataFrame``:

source: ``spectra``: This dataframe contains spectral data, with columns representing wavenumbers and rows representing samples.
es: ``spectra``: Este dataframe contiene datos espectrales, con columnas que representan números de onda y filas que representan muestras.

source: ``hplc``: Here, you'll find reference HPLC measurements for the glucose concentration (in g/L) of each sample, stored in a single column labeled ``glucose``.
es: ``hplc``: Aquí encontrarás mediciones HPLC de referencia para la concentración de glucosa (en g/L) de cada muestra, almacenadas en una sola columna etiquetada como ``glucose``.

source: 💡\ **NOTE:** If you are interested in working with ``polars.DataFrame`` you can simply use ``load_fermentation_train(set_output="polars")``. Note that if you choose to work with ``polars.DataFrame`` the wavenumbers are given in the column names as ``str`` and not as ``float``. This is because ``polars`` does not support column names with types other than ``str``. To extract the wavenumbers as ``float`` from the ``polars.DataFrame`` you can use the ``df.columns.to_numpy(dtype=np.float64)`` method.
es: 💡\ **NOTA:** Si estás interesado en trabajar con ``polars.DataFrame`` simplemente puedes usar ``load_fermentation_train(set_output="polars")``. Nota que si eliges trabajar con ``polars.DataFrame`` los números de onda se dan en los nombres de columna como ``str`` y no como ``float``. Esto se debe a que ``polars`` no soporta nombres de columna con tipos distintos de ``str``. Para extraer los números de onda como ``float`` del ``polars.DataFrame`` puedes usar el método ``df.columns.to_numpy(dtype=np.float64)``.

source: **Exploring the training data**
es: **Explorando los datos de entrenamiento**

source: Before starting with data modeling, it's important to get familiar with your data. Let's start by answering some basic questions:
es: Antes de comenzar con el modelado de datos, es importante familiarizarse con tus datos. Comencemos respondiendo algunas preguntas básicas:

source: *How many samples are there?*
es: *¿Cuántas muestras hay?*

source: *and how many wavenumbers are available?*
es: *¿y cuántos números de onda están disponibles?*

source: Now that we have the basics down, let's take a closer look at the data.
es: Ahora que tenemos lo básico, echemos un vistazo más de cerca a los datos.

source: For the spectral data, you can use the ``pandas.DataFrame.head()`` method to examine the first 5 rows:
es: Para los datos espectrales, puedes usar el método ``pandas.DataFrame.head()`` para examinar las primeras 5 filas:

source: For brevity, we won't display the entire table here, but you'll notice that each column corresponds to a wavenumber, and each row represents a sample.
es: Por brevedad, no mostraremos la tabla completa aquí, pero notarás que cada columna corresponde a un número de onda, y cada fila representa una muestra.

source: Turning to the HPLC data, the ``pandas.DataFrame.describe()`` method provides a summary of the glucose column:
es: En cuanto a los datos HPLC, el método ``pandas.DataFrame.describe()`` proporciona un resumen de la columna de glucosa:

source: This summary offers insights into the distribution of the glucose concentration. With this practical knowledge, we are now ready to continue with our data modeling journey.
es: Este resumen ofrece información sobre la distribución de la concentración de glucosa . Con este conocimiento práctico, ahora estamos listos para continuar con nuestro viaje de modelado de datos.

source: **Visualizing the training data**
es: **Visualizando los datos de entrenamiento**

source: To better understand our dataset, we will visualize the data. We will plot the spectra in the train dataset, with each spectrum color-coded to reflect its associated glucose concentration. This visual approach provides a didactic means to understand the dataset's characteristics, offering insights into chemical variations among the samples. To do so, we'll use the ``matplotlib.pyplot`` module. Remember to install it first using:
es: Para entender mejor nuestro conjunto de datos, visualizaremos los datos. Graficaremos los espectros en el conjunto de datos de entrenamiento, con cada espectro codificado por color para reflejar su concentración de glucosa asociada. Este enfoque visual proporciona un medio didáctico para entender las características del conjunto de datos, ofreciendo información sobre variaciones químicas entre las muestras. Para hacerlo, usaremos el módulo ``matplotlib.pyplot``. Recuerda instalarlo primero usando:

source: Up until now, we have used ``pandas.DataFrame`` to represent the dataset. ``pandas.DataFrame`` are great for storing and manipulating many large datasets. However, I often find more convenient to use ``numpy.ndarray`` to work with spectral data. Therefore, we will convert the ``pandas.DataFrame`` to ``numpy.ndarray`` using the ``pandas.DataFrame.to_numpy()`` method.
es: Hasta ahora, hemos usado ``pandas.DataFrame`` para representar el conjunto de datos. Los ``pandas.DataFrame`` son excelentes para almacenar y manipular muchos conjuntos de datos grandes. Sin embargo, a menudo encuentro más conveniente usar ``numpy.ndarray`` para trabajar con datos espectrales. Por lo tanto, convertiremos el ``pandas.DataFrame`` a ``numpy.ndarray`` usando el método ``pandas.DataFrame.to_numpy()``.

source: So our first step will be to transform our ``pandas.DataFrame`` to ``numpy.ndarray``:
es: Así que nuestro primer paso será transformar nuestro ``pandas.DataFrame`` a ``numpy.ndarray``:

source: Before plotting our data, we'll create a dedicated plotting function that color-codes each spectrum according to its glucose concentration. This approach helps visualize the relationship between spectral patterns and glucose levels.
es: Antes de graficar nuestros datos, crearemos una función de graficación dedicada que codifique por color cada espectro según su concentración de glucosa. Este enfoque ayuda a visualizar la relación entre patrones espectrales y niveles de glucosa.

source: The function will implement:
es: La función implementará:

source: **Color normalization**: We'll use ``matplotlib.colors.Normalize`` to scale glucose concentration values to a 0-1 range, making them suitable for color mapping.
es: **Normalización de color**: Usaremos ``matplotlib.colors.Normalize`` para escalar valores de concentración de glucosa a un rango 0-1, haciéndolos adecuados para mapeo de color.

source: **Color mapping**: The normalized values will be mapped to colors using a color map via ``matplotlib.cm.ScalarMappable``.
es: **Mapeo de color**: Los valores normalizados se mapearán a colores usando un mapa de colores vía ``matplotlib.cm.ScalarMappable``.

source: **Colorbar**: We'll add a colorbar to indicate how colors correspond to glucose concentration values.
es: **Barra de color**: Agregaremos una barra de color para indicar cómo los colores corresponden a valores de concentración de glucosa.

source: This visualization allows us to compare multiple spectra based on their associated glucose concentrations.
es: Esta visualización nos permite comparar múltiples espectros basados en sus concentraciones de glucosa asociadas.

source: We can now use this function to plot the training dataset:
es: Ahora podemos usar esta función para graficar el conjunto de datos de entrenamiento:

source: These spectra may look unclear because they cover a wide wavenumber range that includes areas with little chemical information. To get a better view, we should focus on the "fingerprint" region between 950 and 1550 cm-1, where the important chemical features appear. For now, we'll use the zoom_in=True parameter in our plot_spectra() function to focus on this region. Later, we'll learn how to properly trim the spectra using preprocessing functions.
es: Estos espectros pueden verse poco claros porque cubren un amplio rango de números de onda que incluye áreas con poca información química. Para obtener una mejor vista, debemos enfocarnos en la región "huella digital" entre 950 y 1550 cm-1, donde aparecen las características químicas importantes. Por ahora, usaremos el parámetro zoom_in=True en nuestra función plot_spectra() para enfocarnos en esta región. Más tarde, aprenderemos cómo recortar apropiadamente los espectros usando funciones de preprocesamiento.

source: **Preprocessing the training data**
es: **Preprocesando los datos de entrenamiento**

source: Now that you've explored the dataset, it's time to preprocess the spectral data. This step is essential for removing unwanted variations, such as baseline shifts and noise, which can negatively impact model performance. We'll use the ``chemotools`` and the ``scikit-learn`` modules to preprocess the spectral data.
es: Ahora que has explorado el conjunto de datos, es hora de preprocesar los datos espectrales. Este paso es esencial para eliminar variaciones no deseadas, como desplazamientos de línea base y ruido, que pueden impactar negativamente el rendimiento del modelo. Usaremos los módulos ``chemotools`` y ``scikit-learn`` para preprocesar los datos espectrales.

source: We will preprocess the spectra using the following steps:
es: Preprocesaremos los espectros usando los siguientes pasos:

source: `Range Cut <https://paucablop.github.io/chemotools/docs/feature_selection.html#range-cut>`__: to remove the wavenumbers outside the range between 950 and 1550 cm-1.
es: `Corte de rango <https://paucablop.github.io/chemotools/docs/feature_selection.html#range-cut>`__: para eliminar los números de onda fuera del rango entre 950 y 1550 cm-1.

source: `Linear Correction <https://paucablop.github.io/chemotools/docs/baseline.html#linear-baseline-correction>`__: to remove the linear baseline shift.
es: `Corrección lineal <https://paucablop.github.io/chemotools/docs/baseline.html#linear-baseline-correction>`__: para eliminar el desplazamiento de línea base lineal.

source: `Savitzky-Golay <https://paucablop.github.io/chemotools/docs/derivative.html#savitzky-golay-derivative>`__: calculates the nth order derivative of the spectra using the Savitzky-Golay method. This is useful to remove additive and multiplicative scatter effects.
es: `Savitzky-Golay <https://paucablop.github.io/chemotools/docs/derivative.html#savitzky-golay-derivative>`__: calcula la derivada de n-ésimo orden de los espectros usando el método de Savitzky-Golay. Esto es útil para eliminar efectos de dispersión aditivos y multiplicativos.

source: `Standard Scaler <https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html>`__: to scale the spectra to zero mean.
es: `Escalador estándar <https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html>`__: para escalar los espectros a media cero.

source: We will chain the preprocessing steps using the ```make_pipeline()`` <https://scikit-learn.org/stable/modules/generated/sklearn.pipeline.make_pipeline.html>`__ function from ``scikit-learn``.
es: Encadenaremos los pasos de preprocesamiento usando la función ```make_pipeline()`` <https://scikit-learn.org/stable/modules/generated/sklearn.pipeline.make_pipeline.html>`__ de ``scikit-learn``.

source: 💡 **NOTE:** *What is a pipeline?* A pipeline is a sequence of steps that are executed in a specific order. In our case, we will create a pipeline that will execute the preprocessing steps in the order described above. You can find more information on working with pipelines at our `documentation page <https://paucablop.github.io/chemotools/get-started/scikit_learn_integration.html#working-with-pipelines>`__.
es: 💡 **NOTA:** *¿Qué es un pipeline?* Un pipeline es una secuencia de pasos que se ejecutan en un orden específico. En nuestro caso, crearemos un pipeline que ejecutará los pasos de preprocesamiento en el orden descrito arriba. Puedes encontrar más información sobre cómo trabajar con pipelines en nuestra `página de documentación <https://paucablop.github.io/chemotools/get-started/scikit_learn_integration.html#working-with-pipelines>`__.

source: Now we can use the preprocessing pipeline to preprocess the spectra:
es: Ahora podemos usar el pipeline de preprocesamiento para preprocesar los espectros:

source: And we can use the ``plot_spectra()`` function to plot the preprocessed spectra:
es: Y podemos usar la función ``plot_spectra()`` para graficar los espectros preprocesados:

source: 💡 **NOTE:** This is cool! See how we are integrating chemometrics with scikit-learn? ``RangeCut`` ``LinearCorrection`` and ``SavitizkyGolay`` are all preprocessing techniques implemented in ``chemotools`` while ``StandardScaler`` and ``pipelines`` are functionalities provided by ``scikit-learn`` This is the power of ``chemotools``— it is designed to work seamlessly with ``scikit-learn``
es: 💡 **NOTA:** ¡Esto es genial! ¿Ves cómo estamos integrando quimiometría con scikit-learn? ``RangeCut``, ``LinearCorrection`` y ``SavitizkyGolay`` son todas técnicas de preprocesamiento implementadas en ``chemotools`` mientras que ``StandardScaler`` y ``pipelines`` son funcionalidades proporcionadas por ``scikit-learn``. Este es el poder de ``chemotools``— está diseñado para trabajar sin problemas con ``scikit-learn``

source: **Training a PLS model**
es: **Entrenando un modelo PLS**

source: Partial Least Squares (PLS) is a powerful regression technique commonly used in chemometrics. It works by finding a latent space representation that maximizes covariance with the target variable.
es: Los Mínimos Cuadrados Parciales (PLS) son una técnica de regresión poderosa comúnmente usada en quimiometría. Funciona encontrando una representación de espacio latente que maximiza la covarianza con la variable objetivo.

source: A critical parameter in PLS modeling is the number of components (dimensions) in the latent space:
es: Un parámetro crítico en el modelado PLS es el número de componentes (dimensiones) en el espacio latente:

source: Too many components leads to overfitting, where the model captures noise rather than signal
es: Demasiados componentes lleva al sobreajuste, donde el modelo captura ruido en lugar de señal

source: Too few components results in underfitting, missing important patterns in the data
es: Muy pocos componentes resulta en subajuste, perdiendo patrones importantes en los datos

source: When working with limited samples, cross-validation provides a reliable method for selecting the optimal number of components. This approach:
es: Al trabajar con muestras limitadas, la validación cruzada proporciona un método confiable para seleccionar el número óptimo de componentes. Este enfoque:

source: Divides the data into training and validation sets
es: Divide los datos en conjuntos de entrenamiento y validación

source: Trains the model on the training set and evaluates it on the validation set
es: Entrena el modelo en el conjunto de entrenamiento y lo evalúa en el conjunto de validación

source: Repeats this process with different data splits
es: Repite este proceso con diferentes divisiones de datos

source: Averages the results to estimate the model's generalization error
es: Promedia los resultados para estimar el error de generalización del modelo

source: For our analysis, we'll use scikit-learn's ``GridSearchCV`` class to systematically test different component numbers through cross-validation. This will identify the optimal complexity for our PLS model based on performance metrics across multiple data splits.
es: Para nuestro análisis, usaremos la clase ``GridSearchCV`` de scikit-learn para probar sistemáticamente diferentes números de componentes mediante validación cruzada. Esto identificará la complejidad óptima para nuestro modelo PLS basándose en métricas de rendimiento a través de múltiples divisiones de datos.

source: Suggesting that the optimal number of components is 6, with a mean absolute error of 0.92 g/L. We can verify this by plotting the mean absolute error as a function of the number of components:
es: Sugiriendo que el número óptimo de componentes es 6, con un error absoluto medio de 0.92 g/L. Podemos verificar esto graficando el error absoluto medio en función del número de componentes:

source: Even though using the number of components that minimize the mean absolute error is a good starting point, it is not always the best. The model with 6 components does not increase the mean absolute error much compared to the model with 3 or even two components. However, the model with 6 components includes components associated with small eigenvalues, which are more uncertain. This means that models with 3 or 2 components might be more robust. Therefore, it is always a good idea to try different numbers of components and select the one that gives the best performance. However, for now we will train the model with 6 components:
es: Aunque usar el número de componentes que minimiza el error absoluto medio es un buen punto de partida, no siempre es lo mejor. El modelo con 6 componentes no aumenta mucho el error absoluto medio comparado con el modelo con 3 o incluso dos componentes. Sin embargo, el modelo con 6 componentes incluye componentes asociados con valores propios pequeños, que son más inciertos. Esto significa que modelos con 3 o 2 componentes podrían ser más robustos. Por lo tanto, siempre es una buena idea probar diferentes números de componentes y seleccionar el que dé el mejor rendimiento. Sin embargo, por ahora entrenaremos el modelo con 6 componentes:

source: Finally we can evaluate the performance of the model on the training set:
es: Finalmente podemos evaluar el rendimiento del modelo en el conjunto de entrenamiento:

source: **Applying the model**
es: **Aplicando el modelo**

source: Now that we have trained our model, we can apply it to the testing dataset. The testing dataset contains spectra recorded in real-time during the fermentation process. The test dataset contains two ``pandas.DataFrame``:
es: Ahora que hemos entrenado nuestro modelo, podemos aplicarlo al conjunto de datos de prueba . El conjunto de datos de prueba contiene espectros registrados en tiempo real durante el proceso de fermentación. El conjunto de datos de prueba contiene dos ``pandas.DataFrame``:

source: ``spectra``: This dataset contains spectral data, with columns representing wavenumbers and rows representing samples. These spectra were recorded in real-time during the fermentation process approximately every 1.5 minutes.
es: ``spectra``: Este conjunto de datos contiene datos espectrales, con columnas que representan números de onda y filas que representan muestras. Estos espectros fueron registrados en tiempo real durante el proceso de fermentación aproximadamente cada 1.5 minutos.

source: ``hplc``: This dataset contains HPLC measurements, specifically glucose concentrations (in g/L), stored in a single column labeled ``glucose``. These measurements were recorded off-line approximately every 60 minutes.
es: ``hplc``: Este conjunto de datos contiene mediciones HPLC, específicamente concentraciones de glucosa (en g/L), almacenadas en una sola columna etiquetada como ``glucose``. Estas mediciones fueron registradas fuera de línea aproximadamente cada 60 minutos.

source: We will use the ``load_fermentation_test()`` function from the ``chemotools.datasets`` module to load the testing dataset:
es: Usaremos la función ``load_fermentation_test()`` del módulo ``chemotools.datasets`` para cargar el conjunto de datos de prueba:

source: Then, we will preprocess the spectra using the same preprocessing pipeline that we used for the training dataset:
es: Luego, preprocesaremos los espectros usando el mismo pipeline de preprocesamiento que usamos para el conjunto de datos de entrenamiento:

source: Finally, we can use the PLS model to predict the glucose concentrations:
es: Finalmente, podemos usar el modelo PLS para predecir las concentraciones de glucosa:
