Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/learn/pls_regression.po
Languages: es

source: We can use the predicted values to plot the spectra color-coded according to the predicted glucose concentrations:
es: Podemos usar los valores predichos para graficar los espectros codificados por color según las concentraciones de glucosa predichas:

source: Now we can compare the predicted glucose concentrations with the off-line HPLC measurements. We will plot the predictions and the off-line measurements over time. Each spectrum was taken every 1.25 minutes, while the off-line measurements were taken every 60 minutes.
es: Ahora podemos comparar las concentraciones de glucosa predichas con las mediciones HPLC fuera de línea. Graficaremos las predicciones y las mediciones fuera de línea a lo largo del tiempo. Cada espectro fue tomado cada 1.25 minutos, mientras que las mediciones fuera de línea fueron tomadas cada 60 minutos.

source: **Recap**
es: **Resumen**

source: In this tutorial, we explored how to apply machine learning to spectroscopic data analysis using the Fermentation dataset. Our goal was to build a regression model capable of predicting glucose concentrations during lignocellulosic ethanol fermentation. Here's a quick summary of what we covered:
es: En este tutorial, exploramos cómo aplicar aprendizaje automático al análisis de datos espectroscópicos usando el conjunto de datos de Fermentación. Nuestro objetivo era construir un modelo de regresión capaz de predecir concentraciones de glucosa durante la fermentación de etanol lignocelulósico. Aquí hay un resumen rápido de lo que cubrimos:

source: **Introduction**: We began by introducing the Fermentation dataset, which includes spectral data collected via attenuated total reflectance mid-infrared spectroscopy (ATR-MIR) and corresponding HPLC reference data. This dataset is especially valuable for studying real-time fermentation processes.
es: **Introducción**: Comenzamos introduciendo el conjunto de datos de Fermentación, que incluye datos espectrales recopilados vía espectroscopía infrarroja media de reflectancia total atenuada (ATR-MIR) y datos de referencia HPLC correspondientes. Este conjunto de datos es especialmente valioso para estudiar procesos de fermentación en tiempo real.

source: **Loading and Exploring the Data:** We loaded the training data, examined its structure, and took a closer look at both the spectral and HPLC measurements. Understanding the data at this stage is a critical foundation for any successful analysis.
es: **Cargando y explorando los datos:** Cargamos los datos de entrenamiento, examinamos su estructura y echamos un vistazo más de cerca a las mediciones espectrales y HPLC . Entender los datos en esta etapa es una base crítica para cualquier análisis exitoso.

source: **Data Visualization:** Through visualization, we gained a clearer picture of the dataset. By plotting spectra color-coded by glucose concentration, we could observe how chemical variations appear across samples.
es: **Visualización de datos:** A través de la visualización, obtuvimos una imagen más clara del conjunto de datos. Al graficar espectros codificados por color según la concentración de glucosa , pudimos observar cómo aparecen las variaciones químicas en las muestras.

source: **Data Preprocessing:** We prepared the spectral data for modeling by applying several preprocessing techniques—range cutting, linear correction, Savitzky-Golay derivatives, and standard scaling. These steps helped reduce noise and improve overall data quality.
es: **Preprocesamiento de datos:** Preparamos los datos espectrales para el modelado aplicando varias técnicas de preprocesamiento: corte de rango, corrección lineal , derivadas de Savitzky-Golay y escalado estándar. Estos pasos ayudaron a reducir el ruido y mejorar la calidad general de los datos.

source: **Model Training:** Using the processed data, we trained a Partial Least Squares (PLS) regression model to predict glucose concentrations. Cross-validation helped us determine the optimal number of components and evaluate the model's performance.
es: **Entrenamiento del modelo:** Usando los datos procesados, entrenamos un modelo de regresión de Mínimos Cuadrados Parciales (PLS) para predecir concentraciones de glucosa. La validación cruzada nos ayudó a determinar el número óptimo de componentes y evaluar el rendimiento del modelo.

source: **Testing and Application:** Finally, we applied our trained model to the testing dataset to predict glucose concentrations in real-time. This demonstrated how the model can be used to track glucose levels during fermentation.
es: **Prueba y aplicación:** Finalmente, aplicamos nuestro modelo entrenado al conjunto de datos de prueba para predecir concentraciones de glucosa en tiempo real. Esto demostró cómo el modelo puede usarse para rastrear niveles de glucosa durante la fermentación.

source: This tutorial offers a practical introduction to using machine learning for spectroscopic data analysis. By following these steps, you can extract meaningful insights from complex spectral data and build predictive models that have real-world applications.
es: Este tutorial ofrece una introducción práctica al uso de aprendizaje automático para análisis de datos espectroscópicos. Siguiendo estos pasos, puedes extraer información significativa de datos espectrales complejos y construir modelos predictivos que tienen aplicaciones en el mundo real.
