Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/learn/pls_classification.po
Languages: es

source: **Classify coffees with PLS-DA**
es: **Clasifica cafés con PLS-DA**

source: 💡\ **NOTE:** This document is a Jupyter notebook. You can download the source file and run it in your Jupyter environment!
es: 💡\ **NOTA:** Este documento es un notebook de Jupyter. ¡Puedes descargar el archivo fuente y ejecutarlo en tu entorno Jupyter!

source: **Introduction**
es: **Introducción**

source: *Can you taste the difference between a coffee from Ethiopia, Brazil, or Vietnam?*
es: *¿Puedes saborear la diferencia entre un café de Etiopía, Brasil o Vietnam?*

source: In this tutorial, we will use spectroscopy and machine learning to find the origin of three different coffees produced in:
es: En este tutorial, usaremos espectroscopía y aprendizaje automático para encontrar el origen de tres cafés diferentes producidos en:

source: These spectra have been collected from brewed coffee using Attenuated Total Reflectance Mid-Infrared Spectroscopy (ATR-MIR).
es: Estos espectros se han recolectado de café preparado usando Espectroscopía Infrarroja Media de Reflectancia Total Atenuada (ATR-MIR).

source: In this guide, we'll walk through the steps to create a classification model that can differenciate the unique fingerprint of each coffee's origin from its spectral signature.
es: En esta guía, seguiremos los pasos para crear un modelo de clasificación que pueda diferenciar la huella única del origen de cada café a partir de su firma espectral.

source: So, grab your favorite coffee mug, prepare to delve into the world of data-driven discovery, and let's embark on this aromatic journey.
es: Así que toma tu taza de café favorita, prepárate para adentrarte en el mundo del descubrimiento basado en datos y embarquémonos en este viaje aromático.

source: 💡\ **NOTE:** In our dataset, we've roasted all the coffee under the same conditions, but here's the twist: Ethiopian and Brazilian beans were brewed into espresso, while Vietnamese coffee was brewed on a moka pot ✨
es: 💡\ **NOTA:** En nuestro conjunto de datos, hemos tostado todo el café bajo las mismas condiciones, pero aquí está el giro: los granos etíopes y brasileños se prepararon como espresso, mientras que el café vietnamita se preparó en una cafetera moka ✨

source: **Objective**
es: **Objetivo**

source: In this exercise we will build a PLS-DA model to classify the origin of coffee samples from three different origins.
es: En este ejercicio construiremos un modelo PLS-DA para clasificar el origen de muestras de café de tres orígenes diferentes.

source: **Before starting**
es: **Antes de comenzar**

source: Before we start, you need to be sure to have the following dependencies installed:
es: Antes de comenzar, debes asegurarte de tener las siguientes dependencias instaladas:

source: You can install them using
es: Puedes instalarlas usando

source: **Loading the coffee dataset**
es: **Cargando el conjunto de datos de café**

source: The coffee dataset can be directly accessed from the ``chemotools.datasets`` module, using the ``load_coffee()`` function.
es: El conjunto de datos de café puede accederse directamente desde el módulo ``chemotools.datasets``, usando la función ``load_coffee()``.

source: The ``load_coffee()`` function returns two variables: ``spectra`` and ``labels``:
es: La función ``load_coffee()`` devuelve dos variables: ``spectra`` y ``labels``:

source: ``spectra``: A ``pandas.DataFrame`` containing the spectra of the coffee samples as rows.
es: ``spectra``: Un ``pandas.DataFrame`` que contiene los espectros de las muestras de café como filas.

source: ``labels``: A ``pandas.DataFrame`` containing the origin of each sample.
es: ``labels``: Un ``pandas.DataFrame`` que contiene el origen de cada muestra.

source: 💡\ **NOTE:** If you are interested in working with ``polars.DataFrame`` you can simply use the ``load_coffee(set_output="polars")``.
es: 💡\ **NOTA:** Si estás interesado en trabajar con ``polars.DataFrame`` simplemente puedes usar ``load_coffee(set_output="polars")``.

source: **Explore, plot and color**
es: **Explorar, graficar y colorear**

source: Before we dive deep into the coffee data analysis, we will quickly inspect datasets. Let's get a snapshot of the data sizes and kickstart our analysis.
es: Antes de sumergirnos profundamente en el análisis de datos de café, inspeccionaremos rápidamente los conjuntos de datos. Obtengamos una instantánea de los tamaños de datos e iniciemos nuestro análisis.

source: The ``spectra`` dataset contains 60 samples (rows) and 1841 features (columns). Each sample is a spectrum, and each feature is a wavenumber. The ``labels`` dataset contains the origin of each sample. To analyze the ``labels`` dataset we can use the ``value_counts()`` method from ``pandas`` and make a bar plot.
es: El conjunto de datos ``spectra`` contiene 60 muestras (filas) y 1841 características (columnas). Cada muestra es un espectro, y cada característica es un número de onda. El conjunto de datos ``labels`` contiene el origen de cada muestra. Para analizar el conjunto de datos ``labels`` podemos usar el método ``value_counts()`` de ``pandas`` y hacer un gráfico de barras.

source: We have a balanced dataset with 20 samples per class. Now that we have a better understanding of our data, let's start plotting the spectra. We will plot the different spectra and color them by their origin.
es: Tenemos un conjunto de datos balanceado con 20 muestras por clase. Ahora que tenemos una mejor comprensión de nuestros datos, comencemos a graficar los espectros. Graficaremos los diferentes espectros y los colorearemos según su origen.

source: Visually, we can see that there are some differences between the spectra of the three coffees. However, we need to dig deeper to understand the origin of such differences. Let's start with an exploratory analysis. We can do that by using a Principal Component Analysis (PCA) to reduce the dimensionality of the data.
es: Visualmente, podemos ver que hay algunas diferencias entre los espectros de los tres cafés. Sin embargo, necesitamos profundizar para entender el origen de tales diferencias. Comencemos con un análisis exploratorio. Podemos hacer eso usando un Análisis de Componentes Principales (PCA) para reducir la dimensionalidad de los datos.

source: To do so, we will first mean center the data using the ``StandardScaler()`` preprocessing method from ``scikit-learn``. Then, we will use the ``PCA()`` method, also from ``scikit-learn``, to reduce the dimensionality of the data to two principal components. Finally, we will plot the scores and color them according to the origin of the coffee.
es: Para hacerlo, primero centraremos la media de los datos usando el método de preprocesamiento ``StandardScaler()`` de ``scikit-learn``. Luego, usaremos el método ``PCA()``, también de ``scikit-learn``, para reducir la dimensionalidad de los datos a dos componentes principales. Finalmente, graficaremos las puntuaciones y las colorearemos según el origen del café.

source: 💡\ **NOTE:** When using spectroscopic data, we do not want to scale the spectra to unit variance. Instead, we want to mean center the data. This is because the variance of the spectra is related to the absorbance of the sample. If we scale the data to unit variance, we will lose the information about the absorbance of the sample. We can mean center the data using the ``StandardScaler()`` and setting the ``use_std`` argument to ``False``.
es: 💡\ **NOTA:** Al usar datos espectroscópicos, no queremos escalar los espectros a varianza unitaria. En su lugar, queremos centrar la media de los datos. Esto es porque la varianza de los espectros está relacionada con la absorbancia del muestra. Si escalamos los datos a varianza unitaria, perderemos la información sobre la absorbancia de la muestra. Podemos centrar la media de los datos usando ``StandardScaler()`` y estableciendo el argumento ``use_std`` en ``False``.

source: The results show that there are some differences between the spectra of the three coffes.
es: Los resultados muestran que hay algunas diferencias entre los espectros de los tres cafés.

source: **Preprocessing the spectra**
es: **Preprocesando los espectros**

source: The objective of the preprocessing is to remove from the spectra non-chemical systematic variation, such as baseline shifts or scattering effects. There has been a lot of research on the preprocessing of spectroscopic data, and this is where ``chemotools`` becomes very handy: we harness the power of such research and make it available to you using ``scikit-learn`` standards.
es: El objetivo del preprocesamiento es eliminar de los espectros variaciones sistemáticas no químicas, como desplazamientos de línea base o efectos de dispersión. Ha habido mucha investigación sobre el preprocesamiento de datos espectroscópicos, y aquí es donde ``chemotools`` se vuelve muy útil: aprovechamos el poder de dicha investigación y lo ponemos a tu disposición usando estándares de ``scikit-learn``.

source: We will build the preprocessing steps in a pipeline using the ``make_pipeline()`` method from ``sklearn.pipeline``. A `pipeline <https://paucablop.github.io/chemotools/get-started/scikit_learn_integration.html#working-with-pipelines>`__ is a sequence of steps that are applied to the data in a given order. In our case, we will apply the following steps:
es: Construiremos los pasos de preprocesamiento en un pipeline usando el método ``make_pipeline()`` de ``sklearn.pipeline``. Un `pipeline <https://paucablop.github.io/chemotools/get-started/scikit_learn_integration.html#working-with-pipelines>`__ es una secuencia de pasos que se aplican a los datos en un orden dado. En nuestro caso, aplicaremos los siguientes pasos:

source: `Standard normal variate (SNV) <https://paucablop.github.io/chemotools/docs/scatter.html#standard-normal-variate>`__ to remove scattering effects.
es: `Variante normal estándar (SNV) <https://paucablop.github.io/chemotools/docs/scatter.html#standard-normal-variate>`__ para eliminar efectos de dispersión.

source: `Derivative <https://paucablop.github.io/chemotools/docs/derivative.html#savitzky-golay-derivative>`__ to remove both additive and multiplicative scattering effects.
es: `Derivada <https://paucablop.github.io/chemotools/docs/derivative.html#savitzky-golay-derivative>`__ para eliminar efectos de dispersión tanto aditivos como multiplicativos.

source: `Range cut <https://paucablop.github.io/chemotools/docs/feature_selection.html#range-cut>`__ to select the most relevant wavenumbers.
es: `Corte de rango <https://paucablop.github.io/chemotools/docs/feature_selection.html#range-cut>`__ para seleccionar los números de onda más relevantes.

source: `Standardize <https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html>`__ remove the mean from the dataset.
es: `Estandarizar <https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html>`__ elimina la media del conjunto de datos.

source: 💡\ **NOTE:** This is cool! See how we are integrating chemometrics with ``scikit-learn``? ``StandardNormalVariate``, and ``SavitizkyGolay`` and ``RangeCut`` are all preprocessing techniques implemented in ``chemotools``, while ``StandardScaler`` and ``pipelines`` are functinlaities provided by ``scikit-learn``. This is the power of ``chemotools``, it is designed to work seamlessly with ``scikit-learn``.
es: 💡\ **NOTA:** ¡Esto es genial! ¿Ves cómo estamos integrando quimiometría con ``scikit-learn``? ``StandardNormalVariate``, ``SavitizkyGolay`` y ``RangeCut`` son todas técnicas de preprocesamiento implementadas en ``chemotools``, mientras que ``StandardScaler`` y ``pipelines`` son funcionalidades proporcionadas por ``scikit-learn``. Este es el poder de ``chemotools``, está diseñado para trabajar sin problemas con ``scikit-learn``.

source: Let's plot the preprocessed spectra to see the effect of the preprocessing steps.
es: Grafiquemos los espectros preprocesados para ver el efecto de los pasos de preprocesamiento.

source: **Building a classifier**
es: **Construyendo un clasificador**

source: In this section, we'll dive into the world of classification. Our goal? To create a classification model that can distinguish the origins of our coffees using their spectral signatures.
es: En esta sección, nos sumergiremos en el mundo de la clasificación. ¿Nuestro objetivo? Crear un modelo de clasificación que pueda distinguir los orígenes de nuestros cafés usando sus firmas espectrales.

source: Partial Least Squares Discriminant Analysis (PLS-DA) is a simple statistical technique used for classification. PLS-DA models the relationship between input variables (spectral data) and class labels (coffee origins), allowing it to classify new samples based on their spectral signatures with high accuracy. It's a powerful tool for pattern recognition in complex datasets, making it ideal for our coffee origin classification.
es: El Análisis Discriminante de Mínimos Cuadrados Parciales (PLS-DA) es una técnica estadística simple usada para clasificación. PLS-DA modela la relación entre variables de entrada (datos espectrales) y etiquetas de clase (orígenes de café), permitiéndole clasificar nuevas muestras basándose en sus firmas espectrales con alta precisión. Es una herramienta poderosa para reconocimiento de patrones en conjuntos de datos complejos, haciéndola ideal para nuestra clasificación de origen de café.

source: Before we start our PLS-DA algorithm, we need to encode the labels into numbers. We can do that using the ``LabelEncoder()`` method from ``scikit-learn``.
es: Antes de comenzar nuestro algoritmo PLS-DA, necesitamos codificar las etiquetas en números. Podemos hacer eso usando el método ``LabelEncoder()`` de ``scikit-learn``.

source: ``LabelEncoder()`` will assign a categorical value to each of the labels in our dataset (0 for Brasil, 1 for Ethiopia an 2 for Vietnam).
es: ``LabelEncoder()`` asignará un valor categórico a cada una de las etiquetas en nuestro conjunto de datos (0 para Brasil, 1 para Etiopía y 2 para Vietnam).

source: Now that our coffee origin labels have been encoded into numerical values, we are ready to train our PLS-DA model. However, before we start, we will divide our data into a training and a testing sets using the ``train_test_split()`` method from the ``scikit-learn`` library.
es: Ahora que nuestras etiquetas de origen de café han sido codificadas en valores numéricos, estamos listos para entrenar nuestro modelo PLS-DA. Sin embargo, antes de comenzar, dividiremos nuestros datos en conjuntos de entrenamiento y prueba usando el método ``train_test_split()`` de la biblioteca ``scikit-learn``.

source: Our strategy is to allocate 80% of our dataset for training our model, allowing it to learn from disticnt features from spectral data, while reserving the remaining 20% for testing. This division ensures that our model's performance can be evaluated on unseen data, a crucial step in assessing its real-world applicability and predictive power.
es: Nuestra estrategia es asignar el 80% de nuestro conjunto de datos para entrenar nuestro modelo, permitiéndole aprender de características distintas de datos espectrales, mientras reservamos el 20% restante para pruebas. Esta división asegura que el rendimiento de nuestro modelo pueda evaluarse en datos no vistos, un paso crucial para evaluar su aplicabilidad en el mundo real y poder predictivo.

source: 💡\ **NOTE:** We set the ``random_state`` argument to 42 to ensure reproducibility of the results.
es: 💡\ **NOTA:** Establecemos el argumento ``random_state`` en 42 para asegurar la reproducibilidad de los resultados.

source: Now that we have our training and testing sets, we can start building our PLS-DA model. We will use the ``PLSRegression()`` method from ``scikit-learn``. We will set the number of components to 2 and the ``scale`` argument to ``False``. This is because we have already scaled the data in the preprocessing step.
es: Ahora que tenemos nuestros conjuntos de entrenamiento y prueba, podemos comenzar a construir nuestro modelo PLS-DA. Usaremos el método ``PLSRegression()`` de ``scikit-learn``. Estableceremos el número de componentes en 2 y el argumento ``scale`` en ``False``. Esto es porque ya hemos escalado los datos en el paso de preprocesamiento.

source: 💡\ **NOTE:** We have chosen two components because from our PCA analysis we saw that using two components we can separate the three classes.
es: 💡\ **NOTA:** Hemos elegido dos componentes porque de nuestro análisis PCA vimos que usando dos componentes podemos separar las tres clases.

source: Now that we have trained our model, we can evaluate its performance. We will use the `accuracy score <https://scikit-learn.org/stable/modules/generated/sklearn.metrics.accuracy_score.html>`__ and the `confusion matrix <https://scikit-learn.org/stable/modules/generated/sklearn.metrics.confusion_matrix.html>`__ methods from ``scikit-learn`` to evaluate the performance of the model.
es: Ahora que hemos entrenado nuestro modelo, podemos evaluar su rendimiento. Usaremos la `puntuación de precisión <https://scikit-learn.org/stable/modules/generated/sklearn.metrics.accuracy_score.html>`__ y la `matriz de confusión <https://scikit-learn.org/stable/modules/generated/sklearn.metrics.confusion_matrix.html>`__ de ``scikit-learn`` para evaluar el rendimiento del modelo.

source: **Recap**
es: **Resumen**

source: **The Coffee Dataset:** Explore the unique world of coffee differentiation through Infrared Spectroscopy. This dataset contains IR spectra of coffee samples from Ethiopia, Brazil, and Vietnam.
es: **El conjunto de datos de café:** Explora el mundo único de la diferenciación de café a través de Espectroscopía Infrarroja. Este conjunto de datos contiene espectros IR de muestras de café de Etiopía, Brasil y Vietnam.

source: **Importing the Data:** Effortlessly load the coffee spectra into a Pandas DataFrame using chemotools, making data analysis a breeze.
es: **Importando los datos:** Carga sin esfuerzo los espectros de café en un DataFrame de Pandas usando chemotools, haciendo que el análisis de datos sea muy fácil.

source: **Explore, Plot, and Color:** Gain insights into the dataset's size and composition, showcasing its 60 samples and 1841 features. Visualize the data with colorful coffee spectra plots.
es: **Explorar, graficar y colorear:** Obtén información sobre el tamaño y composición del conjunto de datos, mostrando sus 60 muestras y 1841 características. Visualiza los datos con gráficos coloridos de espectros de café.

source: **Preprocessing the Spectra:** Dive into the world of preprocessing, where chemotools comes into play. Eliminate non-chemical systematic variations using techniques like Standard Normal Variate (SNV), Derivative, Range Cut, and Standardization.
es: **Preprocesando los espectros:** Sumérgete en el mundo del preprocesamiento, donde chemotools entra en juego. Elimina variaciones sistemáticas no químicas usando técnicas como Variante Normal Estándar (SNV), Derivada, Corte de Rango y Estandarización.

source: **Modelling the Data:** Enter the realm of machine learning with Partial Least Squares Discriminant Analysis (PLS-DA), a powerful tool for classification. Encode labels into numerical values and split the data into training and testing sets. Train the model and evaluate its performance, achieving an impressive confusion matrix.
es: **Modelando los datos:** Entra en el reino del aprendizaje automático con Análisis Discriminante de Mínimos Cuadrados Parciales (PLS-DA), una herramienta poderosa para clasificación. Codifica etiquetas en valores numéricos y divide los datos en conjuntos de entrenamiento y prueba. Entrena el modelo y evalúa su rendimiento, logrando una impresionante matriz de confusión.

source: This tutorial showcases the beauty of data science and chemistry, bringing the art of coffee classification to life within the rich world of spectral data.
es: Este tutorial muestra la belleza de la ciencia de datos y la química, dando vida al arte de la clasificación de café dentro del rico mundo de los datos espectrales.
