name: "video_decoder"
backend: "python"
max_batch_size: 8

input [
  {
    name: "video_path"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "time_sec"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

output [
  {
    name: "frame"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]  # Dynamic height/width, 3 color channels
  }
]

instance_group [
  {
    count: 16
    kind: KIND_CPU
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 5000
}