Repository: pypi-data/pypi-mirror-396
Catalog: packages/indico/indico-3.3.9-py3-none-any.whl/indico/translations/*/LC_MESSAGES/messages-js.po
Languages: fi_fi

source: be fitted to their content.
fi_fi: sovitettava niiden sisältöön.

source: Then, all entries
fi_fi: Sitten kaikki merkinnät

source: All entries
fi_fi: Kaikki merkinnät

source: will have their
fi_fi: saavat

source: starting times
fi_fi: aloitusajat

source: duration
fi_fi: kesto

source: changed.
fi_fi: muuttunut.

source: Please review your choice
fi_fi: Tarkista valintasi

source: Please select the rescheduling type
fi_fi: Valitse aikataulun muutoksen tyyppi

source: Reschedule Entries
fi_fi: Aikatauluta merkinnät uudelleen

source: This will change the starting and ending times of the session block {0} so that it encompasses all entries defined in its timetable.
fi_fi: Tämä muuttaa ohjelmaosion {0} alkamis- ja päättymisajat siten, että se kattaa kaikki sen aikataulussa määritellyt merkinnät.

source: Are you sure you want to proceed?
fi_fi: Haluatko varmasti jatkaa?

source: Fitting...
fi_fi: Sovitetaan...

source: Fit timetable to content
fi_fi: Sovita aikataulu sisältöön

source: Undo last operation
fi_fi: Peruuta viimeisin toiminto

source: Show more
fi_fi: Näytä lisää

source: Show less
fi_fi: Näytä vähemmän

source: Add new keyword
fi_fi: Lisää uusi avainsana
