Repository: pypi-data/pypi-mirror-396
Catalog: packages/indico/indico-3.3.9-py3-none-any.whl/indico/translations/*/LC_MESSAGES/messages-js.po
Languages: fi_fi

source: This file no longer exists. Please reload the page.
fi_fi: Tämä tiedosto ei ole enää olemassa. Lataa sivu uudelleen.

source: You are not authorized to access this file.
fi_fi: Sinulla ei ole oikeutta käyttää tätä tiedostoa.

source: Access Denied
fi_fi: Pääsy evätty

source: This file is protected. You will be redirected to the login page.
fi_fi: Tämä tiedosto on suojattu. Sinut ohjataan kirjautumissivulle.

source: Manage material
fi_fi: Hallitse materiaalia

source: Building package
fi_fi: Paketin kokoaminen

source: Login with {0}
fi_fi: Kirjaudu sisään {0}

source: Today
fi_fi: Tänään

source: {0} long-lasting event not shown
fi_fi: {0} pitkäkestoinen tapahtuma ei näkyvissä

source: Long lasting events
fi_fi: Pitkäkestoiset tapahtumat

source: empty
fi_fi: tyhjä

source: {0} event
fi_fi: {0} tapahtuma

source: Undo
fi_fi: Kumoa

source: The category order has been restored.
fi_fi: Luokkien järjestys on palautettu.

source: The category list has been sorted.
fi_fi: Luokkien luettelo on lajiteltu.

source: Delete category
fi_fi: Poista kategoria

source: This category cannot be deleted because it is not empty.
fi_fi: Tätä kategoriaa ei voi poistaa, koska se ei ole tyhjä.

source: At least one selected category cannot be deleted because it is not empty.
fi_fi: Ainakin yhtä valittua kategoriaa ei voi poistaa, koska se sisältää tapahtumia tai alakategorioita.

source: Delete the selected category
fi_fi: Poista valittu kategoria

source: Select the categories to delete first.
fi_fi: Valitse ensin poistettavat kategoriat.

source: Delete categories
fi_fi: Poista kategoriat

source: Move the selected category
fi_fi: Siirrä valittu kategoria

source: Select the categories to move first.
fi_fi: Valitse ensin siirrettävät kategoriat.

source: Only {0} out of {1} events is currently selected.
fi_fi: Tällä hetkellä on valittuna vain {0} tapahtumaa {1} tapahtumasta.

source: Move here
fi_fi: Siirrä tänne

source: Move category
fi_fi: Siirrä kategoria

source: Select new category parent for the category
fi_fi: Valitse kategorialle uusi pääkategoria

source: The category is already here
fi_fi: Kategoria on jo täällä

source: This is the category you are trying to move
fi_fi: Tämä on kategoria, jota yrität siirtää

source: Navigate to
fi_fi: Siirry kohtaan

source: Navigate to a category
fi_fi: Siirry kategoriaan

source: Unknown error while contacting the Community Hub
fi_fi: Tuntematon virhe yhteyden muodostamisessa yhteisökeskukseen

source: Internal error: Parse error on the reply of the Community Hub.
fi_fi: Sisäinen virhe: Virhe viestin jäsentämisessä yhteisökeskukselta.

source: Unable to contact the Community Hub.
fi_fi: Yhteyttä yhteisökeskukseen ei voida muodostaa.

source: The connection to the Community Hub timed out.
fi_fi: Yhteys yhteisökeskukseen aikakatkaistiin.

source: Your server is not registered with the Community Hub.
fi_fi: Palvelintasi ei ole rekisteröity yhteisökeskukseen.

source: Disabled
fi_fi: Pois käytöstä

source: This server is not registered as part of the community.
fi_fi: Tätä palvelinta ei ole rekisteröity osaksi yhteisöä.

source: Synchronized
fi_fi: Synkronoitu

source: This server is registered as part of the community and is up to date.
fi_fi: Tämä palvelin on rekisteröity osaksi yhteisöä ja on ajan tasalla.

source: Out of sync
fi_fi: Ei synkronoitu

source: Your Indico server is out of sync. Synchronize it with the button on the right.
fi_fi: Indico-palvelintasi ei ole synkronoitu. Voit synkronoida sen painamalla oikeanpuoleista painiketta.

source: Error!
fi_fi: Virhe!

source: Your Indico server is not synchronized with the Community Hub! You can solve this <a href="{0}">here</a>.
fi_fi: Indico-palvelintasi ei ole synkronoitu yhteisökeskuksen kanssa! <a href="{0}"> Voit synkronoida Indico-palvelimesi tästä </a>.

source: The back side of the templates that use this one as the back side will be removed.
fi_fi: Tämän mallin taustapuolta käyttävien mallien taustapuoli poistetaan.

source: Disassociate back sides
fi_fi: Irrota taustapuolet

source: Fixed text
fi_fi: Kiinteä teksti

source: Please choose a name for the template
fi_fi: Valitse mallille nimi

source: Warning
fi_fi: Varoitus

source: The template cannot be empty. Add some elements or a background image.
fi_fi: Malli ei voi olla tyhjä. Lisää joitakin elementtejä tai taustakuva.

source: The Fixed image element cannot be empty. Upload an image inside it or remove it.
fi_fi: Kiinteä kuvaelementti ei voi olla tyhjä. Lataa kuva sen sisään tai poista se.

source: Are you sure you want to change the dimensions of this template?
fi_fi: Haluatko varmasti muuttaa tämän mallin mitat?

source: Choose a file
fi_fi: Valitse tiedosto

source: Fixed Image
fi_fi: Kiinteä kuva

source: This back side template will be removed
fi_fi: Tämä taustapuolimalli poistetaan

source: The back side of this template will be removed
fi_fi: Mallin taustapuoli poistetaan

source: Disassociate back side
fi_fi: Irrota taustapuoli

source: The back side is empty.
fi_fi: Kääntöpuolella ei ole mitään.

source: Error
fi_fi: Virhe

# Designer template linked to registration form
source: Linked to
fi_fi: Liitetty

source: Show preview
fi_fi: Näytä esikatselu

source: Hide preview
fi_fi: Piilota esikatselu

# track convener
source: Convener
fi_fi: Koollekutsuja

source: You won't be able to change your decision later. If necessary, please contact the manager of the event.
fi_fi: Et voi muuttaa päätöstäsi myöhemmin. Ota tarvittaessa yhteyttä tapahtuman vastuuhenkilöön.

source: {0} new event will be created.
fi_fi: Luodaan {0} uutta tapahtumaa.

source: Menu Entry Settings
fi_fi: Valikkokohdan asetukset

source: {0} out of {1} displayed
fi_fi: {0} / {1} näytetty

source: There are no entries that match your search criteria.
fi_fi: Hakuehtojasi vastaavia tuloksia ei löytynyt.

source: Filter sessions
fi_fi: Suodata istunnot

source: Assign new session
fi_fi: Määritä uusi istunto

source: Add new session
fi_fi: Lisää uusi istunto

source: No session
fi_fi: Ei istuntoa

source: Not scheduled
fi_fi: Ei aikataulutettu

source: '{0}' has been unscheduled due to the session change.
fi_fi: '{0}' on poistettu aikataulusta istunnossa tapahtuneen muutoksen takia.

source: Undo successful! Timetable entry and session have been restored.
fi_fi: Peruutus onnistui! Aikataulutiedot ja istunto on palautettu.

source: Filter tracks
fi_fi: Suodata osiot

source: Add new track
fi_fi: Lisää uusi osio

source: No track
fi_fi: Ei osiota

# Salutation
source: Title:
fi_fi: Otsikko:

source: Undoing previous operation...
fi_fi: Peruutetaan edellistä toimintoa...

source: Terms and Conditions
fi_fi: Käyttöehdot

source: Email Preview
fi_fi: Sähköpostin esikatselu

source: Do you really want to delete the selected registration?
fi_fi: Haluatko varmasti poistaa valitun ilmoittautumisen?

source: Registration
fi_fi: Rekisteröityminen

source: Day left<br>to register
fi_fi: Päivä jäljellä<br>ilmoittautua

source: Country
fi_fi: Maa

source: Filter types
fi_fi: Suodatintyypit

source: Add new type
fi_fi: Lisää uusi tyyppi

source: No type
fi_fi: Ei tyyppiä

source: Submit
fi_fi: Lähetä

source: Submitting...
fi_fi: Lähetetään...

source: Your answers have been saved, do not forget to submit the survey when you finish!
fi_fi: Vastauksesi on tallennettu. Muista vielä lähettää ne, kun olet valmis!

source: Invalid access key
fi_fi: Virheellinen pääsykoodi

source: The timetable has not been filled yet.
fi_fi: Aikataulua ei ole vielä täytetty.

source: Speaker
fi_fi: Puhuja

source: Convener
fi_fi: Koollekutsuja

source: You have favorited this category
fi_fi: Olet lisännyt tämän kategorian suosikkeihisi

source: E-mail
fi_fi: Sähköposti

source: Affiliation
fi_fi: Affiliaatio

source: Are you sure you want to merge those two users?
fi_fi: Haluatko varmasti yhdistää nämä kaksi käyttäjää?

source: Please notice there are warning messages!
fi_fi: Huomioithan varoitusviestit!

source: Confirm user merge
fi_fi: Vahvista käyttäjien yhdistäminen

source: This videoconference has been deleted and cannot be used. You can detach it from the event, however.
fi_fi: Tämä videoyhteys on poistettu eikä sitä voi käyttää. Voit kuitenkin irrottaa sen tapahtumasta.

source: Click to toggle collapse status
fi_fi: Napsauta vaihtaaksesi tiivistystilaa

source: Copied to clipboard
fi_fi: Kopioitu leikepöydälle

source: Press {0} to copy
fi_fi: Paina {0} kopioidaksesi

source: Create new lecture
fi_fi: Luo uusi luento

source: Create new meeting
fi_fi: Luo uusi kokous

source: Create new conference
fi_fi: Luo uusi konferenssi

source: You have unsaved changes. Do you really want to close the dialog without saving?
fi_fi: Sinulla on tallentamattomia muutoksia. Haluatko todella sulkea valintaikkunan tallentamatta?

source: Unsaved changes
fi_fi: Tallentamattomat muutokset

source: Close
fi_fi: Sulje

source: You have unsaved changes that will be lost.
fi_fi: Sinulla on tallentamattomia muutoksia, jotka menetetään.

source: Confirm action
fi_fi: Vahvista toiminto

source: Direct link to this item
fi_fi: Suora linkki tähän kohteeseen

source: Next
fi_fi: Seuraava

source: Previous
fi_fi: Edellinen

source: Something went wrong
fi_fi: Jotain meni pieleen

source: The passwords do not match.
fi_fi: Salasanat eivät täsmää.

source: Field must be at least {0} character long.
fi_fi: Kentän pituuden on oltava vähintään {0} merkki.

source: Field cannot be longer than {0} character.
fi_fi: Kenttä ei voi olla pidempi kuin {0} merkki.

source: Field must be between {0} and {1} characters long.
fi_fi: Kentän pituuden on oltava {0} ja {1} merkin välillä.

source: Field must contain at least {0} word.
fi_fi: Kentän on sisällettävä vähintään {0} sana.

source: Field cannot contain more than {0} word.
fi_fi: Kenttä ei voi sisältää enempää kuin {0} sanan.

source: Field must contain between {0} and {1} words.
fi_fi: Kentän on sisällettävä {0} – {1} sanaa.

source: Save now
fi_fi: Tallenna nyt

source: Saving...
fi_fi: Tallennetaan...

source: Do not forget to save your changes!
fi_fi: Muista tallentaa muutokset!

source: Only {0} out of {1} rows is currently selected
fi_fi: Vain {0} / {1} rivistä on tällä hetkellä valittuna

source: Select only the current page.
fi_fi: Valitse vain nykyinen sivu.

source: Click here to select them all.
fi_fi: Valitse kaikki napsauttamalla tätä.

source: Please confirm
fi_fi: Vahvista

source: Executing operation...
fi_fi: Toimintoa suoritetaan...

source: Operation done!
fi_fi: Toiminto suoritettu!

source: Operation failed!
fi_fi: Toiminto epäonnistui!

source: Loading...
fi_fi: Latautuu...

source: Select
fi_fi: Valitse

source: This category doesn't contain any subcategory
fi_fi: Tämä kategoria ei sisällä alakategorioita

source: Select a category
fi_fi: Valitse kategoria

source: Not possible for categories where you cannot propose events
fi_fi: Ei mahdollista kategorioissa, joissa et voi ehdottaa tapahtumia

source: Not possible for categories where you cannot propose/create events
fi_fi: Ei mahdollista kategorioissa, joissa et voi ehdottaa/luoda tapahtumia

source: Not possible for categories where you cannot create events
fi_fi: Ei mahdollista kategorioissa, joissa et voi luoda tapahtumia

source: Not possible for categories where you are not a manager
fi_fi: Ei mahdollista kategorioissa, joissa et ole vastuuhenkilö

source: Not possible for categories descending from category "{0}"
fi_fi: Ei mahdollista kategorioille, jotka ovat peräisin kategoriasta "{0}"

source: Not possible for this category
fi_fi: Ei mahdollista tässä kategoriassa

source: Search
fi_fi: Haku

source: Go to: {0}
fi_fi: Siirry kohtaan: {0}

source: This category is protected
fi_fi: Tämä kategoria on suojattu

source: Go to parent: {0}
fi_fi: Siirry yläkategoriaan {0}

source: {0} category
fi_fi: {0} kategoria

source: You can only <a class="js-action" data-category-id="{0}">{1}</a> this one.
fi_fi: Voit vain <a class="js-action" data-category-id="{0}">{1}</a> tätä.

source: You can <a class="js-action" data-category-id="{0}">{1}</a> this one, <a class="js-navigate-up" data-parent-id="{2}">navigate up</a> or <a class="js-search">search</a>.
fi_fi: Voit <a class="js-action" data-category-id="{0}">{1}</a> tätä, <a class="js-navigate-up" data-parent-id="{2}">siirtyä yläluokkaan</a> tai <a class="js-search">hakea</a>.

source: You can <a class="js-navigate-up" data-parent-id="{2}">navigate up</a> or <a class="js-search">search</a>.
fi_fi: Voit <a class="js-navigate-up" data-parent-id="{2}">siirtyä yläluokkaan</a> tai <a class="js-search">hakea</a>.

source: Your search doesn't match any category
fi_fi: Hakusi ei vastaa mitään kategoriaa

source: You can <a class="js-search">modify</a> or <a class="js-clear-search">clear</a> your search.
fi_fi: Voit <a class="js-search">muokata</a> tai <a class="js-clear-search">tyhjentää</a> hakusi.

source: In favorite categories
fi_fi: Suosikkikategorioissa

source: Search result
fi_fi: Hakutulos

source: Displaying {0} out of {1} results.
fi_fi: Näytetään {0} tulosta {1} tuloksesta.

source: There are no results.
fi_fi: Tuloksia ei löytynyt.

source: Clear search
fi_fi: Tyhjennä haku

source: You selected category "{0}". Are you sure you want to proceed?
fi_fi: Valitsit kategorian "{0}". Haluatko varmasti jatkaa?

source: Type to filter...
fi_fi: Kirjoita suodattaaksesi...

source: You can copy the URL below using CTRL + C (&#8984; + C on OSX):
fi_fi: Voit kopioida alla olevan URL-osoitteen painamalla CTRL + C (&#8984; + C OSX-käyttöjärjestelmässä):

source: Type to add {0}
fi_fi: Kirjoita lisätäksesi {0}

source: Delete
fi_fi: Poista

source: Empty values are not allowed.
fi_fi: Tyhjiä arvoja ei sallita.

source: Select an option
fi_fi: Valitse vaihtoehto

source: Using default location from: {0} ({1})
fi_fi: Käytetään oletussijaintia : {0} ({1})

source: Using custom location
fi_fi: Käytetään mukautettua sijaintia

source: Just use "{0}"
fi_fi: Käytä vain "{0}".

source: <strong>1</strong> char left
fi_fi: <strong>1</strong> merkki jäljellä

source: <strong>1</strong> word left
fi_fi: <strong>1</strong> merkki jäljellä

source: Save
fi_fi: Tallenna

source: Edit
fi_fi: Muokkaa

source: Cancel
fi_fi: Peruuta

source: Must be between {0} and {1}
fi_fi: Täytyy olla välillä {0} ja {1}

source: Must be above {0}
fi_fi: Täytyy olla yli {0}

source: Must be below {0}
fi_fi: Täytyy olla alle {0}

source: Please fill in the required fields.
fi_fi: Täytä pakolliset kentät.

source: IP networks cannot have management permissions
fi_fi: IP-verkoilla ei voi olla hallintaoikeuksia

source: Registrants cannot have management permissions
fi_fi: Ilmoittautuneilla ei voi olla hallintaoikeuksia

source: Assign Permissions
fi_fi: Määritä käyttöoikeudet

source: Delete entry '{0}'
fi_fi: Poista merkintä '{0}'

source: Are you sure you want to remove yourself from the list?
fi_fi: Haluatko varmasti poistaa itsesi listalta?

source: All options have been added
fi_fi: Kaikki vaihtoehdot on lisätty

source: This entry was already added
fi_fi: Tämä merkintä on jo lisätty

source: Anonymous
fi_fi: Anonyymi

source: Additional users
fi_fi: Lisäkäyttäjät

source: {0} user has implicit read access due to other roles
fi_fi: {0} käyttäjällä on implisiittinen lukuoikeus muiden roolien vuoksi

source: Category Managers
fi_fi: Kategorioiden vastuuhenkilöt

source: Parent Category Managers
fi_fi: Pääkategorioiden vastuuhenkilöt

source: Event Managers
fi_fi: Tapahtumien vastuuhenkilöt

source: Registrants in "{0}"
fi_fi: Ilmoittautuneet kohteessa ”{0}”

source: Previous tab
fi_fi: Edellinen välilehti

source: Next tab
fi_fi: Seuraava välilehti

source: At least one must be selected
fi_fi: Vähintään yksi vaihtoehto on valittava

source: Please enable the checkbox
fi_fi: Valitse valintaruutu

source: Please choose an option
fi_fi: Valitse vaihtoehto

source: Field must be a number
fi_fi: Kentän on oltava numero

source: Field must be a positive number
fi_fi: Kentän on oltava positiivinen luku

source: Date format is not valid. It should be dd/mm/yyyy hh:mm
fi_fi: Päivämäärämuoto ei ole kelvollinen. Sen tulee olla pp/kk/vvvv hh:mm

source: Invalid e-mail address
fi_fi: Virheellinen sähköpostiosoite

source: Invalid URL
fi_fi: Virheellinen URL

source: Time format is not valid. It should be hh:mm
fi_fi: Aikamuoto ei ole kelvollinen. Sen pitäisi olla hh:mm

source: Field is mandatory
fi_fi: Kenttä on pakollinen

source: Add break
fi_fi: Lisää tauko

source: Add session
fi_fi: Lisää istunto

source: Add session block
fi_fi: Lisää istuntojakso

source: Session
fi_fi: Istunto

source: Room
fi_fi: Tila

source: Updating the timetable...
fi_fi: Päivitetään aikataulua...

source: Filter
fi_fi: Suodata

source: Printable version
fi_fi: Tulostettava versio

source: Go back
fi_fi: Palaa takaisin

source: Print
fi_fi: Tulosta

source: Export to PDF
fi_fi: Vie PDF-tiedostoksi

source: Switching to full screen mode...
fi_fi: Siirtyminen koko näytön tilaan...

source: Exit Full Screen
fi_fi: Poistu koko näytöstä

source: Full screen
fi_fi: Koko näyttö

source: Link
fi_fi: Linkki

source: Detailed view
fi_fi: Yksityiskohtainen näkymä

source: All days
fi_fi: Kaikki päivät

source: You are viewing the contents of the session block:
fi_fi: Tarkastelet istuntojaksoa:

source: Your changes triggered the automatic modification of some settings:
fi_fi: Muutoksesi laukaisivat joidenkin asetusten automaattisen muokkauksen:

source: The <strong>starting time</strong> of the session interval <strong>
fi_fi: Istunnon aikavälin <strong>alkamisaika</strong> <strong>

source: </strong> was moved from
fi_fi: </strong> siirrettiin kohdasta

source: The <strong>starting time</strong> of the <strong>Event</strong> was moved from
fi_fi: <strong>Tapahtuman</strong> <strong>alkamisaika</strong> siirrettiin

source: The <strong>ending time</strong> of the session interval <strong>
fi_fi: Istunnon aikavälin <strong>päättymisaika</strong> <strong>

source: The <strong>ending time</strong> of the <strong>Event</strong> was moved from
fi_fi: <strong>Tapahtuman</strong> <strong>päättymisaika</strong> siirrettiin

source: The contents of the interval <strong>
fi_fi: Aikavälin sisältö <strong>

source: </strong> were moved from
fi_fi: </strong> siirrettiin

source: to
fi_fi: kohteeseen

source: Session block
fi_fi: Istuntojakso

source: Contribution
fi_fi: Esitys

source: Break
fi_fi: Tauko

source: Add poster
fi_fi: Lisää posteri

# Timetable entry
source: Add new
fi_fi: Lisää uusi

source: Reschedule
fi_fi: Aikatauluta uudelleen

source: Fit to content
fi_fi: Sovita sisältöön

source: Add new block
fi_fi: Lisää uusi jakso

source: Add one hour
fi_fi: Lisää yksi tunti

source: Session legend
fi_fi: Istunnon selite

source: see more...
fi_fi: katso lisää...

source: less...
fi_fi: vähemmän...

source: Go to event timetable
fi_fi: Siirry tapahtuman aikatauluun

source: Up to timetable
fi_fi: Aikataulun mukaisesti

source: move to resize
fi_fi: siirrä koon muuttamiseksi

source: <kbd class="tt-key">Shift</kbd> is currently pressed. Changes will be applied to blocks after.
fi_fi: <kbd class="tt-key">Shift</kbd> on painettuna. Muutokset otetaan käyttöön jaksoihin myöhemmin.

source: Drop to move block inside session
fi_fi: Pudota siirtääksesi jaksoa istunnon sisällä

source: Show materials
fi_fi: Näytä materiaalit

source: et al.
fi_fi: ym.

source: This poster session has
fi_fi: Tässä posterinäyttelyssä on

source: contribution(s).
fi_fi: esitys(tä).

source: Please click for more information.
fi_fi: Klikkaa tästä saadaksesi lisätietoja.

source: Move entry
fi_fi: Siirrä merkintä

source: This timetable entry does not exist anymore. Please refresh the page.
fi_fi: Tämä aikataulutieto ei ole enää voimassa. Päivitä sivu.

source: Refresh
fi_fi: Päivitä

source: Move up
fi_fi: Siirry ylöspäin

source: Move down
fi_fi: Siirry alas

source: Edit poster
fi_fi: Muokkaa posteria

source: Manage protection
fi_fi: Hallitse suojausta

source: Manage poster protection
fi_fi: Hallitse postereiden suojausta

source: Unschedule
fi_fi: Peruuta aikataulu

source: Unschedule poster
fi_fi: Peruuta posteri

source: Are you sure you want to unschedule the poster?
fi_fi: Haluatko varmasti poistaa posterin aikataulusta?

source: Delete poster
fi_fi: Poista posteri

source: Are you sure you want to delete the poster?
fi_fi: Haluatko varmasti poistaa posterin?

source: Sessions
fi_fi: Istunnot

source: No sessions in the timetable
fi_fi: Aikataulussa ei ole istuntoja

source: Rooms
fi_fi: Tilat

source: No rooms found in the timetable
fi_fi: Aikataulusta ei löytynyt tiloja

source: Filter options
fi_fi: Suodatinvaihtoehdot

source: Reset filter
fi_fi: Nollaa suodatin

# Selection
source: All
fi_fi: Kaikki

# Selection
source: None
fi_fi: Ei mitään

source: ID
fi_fi: Tunnus

source: Title
fi_fi: Otsikko

source: Sort by:
fi_fi: Lajittele:

source: Select:
fi_fi: Valitse:

source: Add Contribution
fi_fi: Lisää esitys

source: Add selected
fi_fi: Lisää valitut

source: Create a new one
fi_fi: Luo uusi

source: You may choose to:
fi_fi: Voit valita seuraavista vaihtoehdoista:

source: Choose one (or more) unscheduled
fi_fi: Valitse yksi (tai useampi), jota ei ole vielä aikataulutettu

source: To add an unscheduled contribution, please select at least one
fi_fi: Lisätäksesi ajoittamattoman esityksen valitse ainakin yksi

source: Add contribution
fi_fi: Lisää esitys

source: Step 1: Choose type of rescheduling
fi_fi: Vaihe 1: Valitse uudelleenjärjestelyn tyyppi

source: See an example
fi_fi: Katso esimerkki

source: Adjust starting time of all entries
fi_fi: Säädä kaikkien merkintöjen alkamisaika

source: Move the entries of
fi_fi: Siirrä merkinnät

source: by changing their
fi_fi: muuttamalla niiden

source: Move the entries of the interval
fi_fi: Siirrä aikavälin merkinnät

source: starting times.
fi_fi: aloitusajat.

source: The first entry will start when the event starts (
fi_fi: Ensimmäinen merkintä alkaa, kun tapahtuma alkaa (

source: The first entry will start when the interval starts (
fi_fi: Ensimmäinen merkintä alkaa, kun aikaväli alkaa (

source: and the other entries will follow consecutively after it. The durations of the entries will not change.
fi_fi: ja muut merkinnät seuraavat sitä peräkkäin. Merkintöjen kesto ei muutu.

source: Adjust duration of all entries
fi_fi: Säädä kaikkien merkintöjen kestoa

source: Adjust the
fi_fi: Säädä

source: duration
fi_fi: kesto

source: of the entries of
fi_fi: vaihtoehdot

source: the interval
fi_fi: aikaväli

source: to fill the gaps between them, so that their starting time don't change. If a time gap is specified, the duration will be extended up to the value of this time gap before the starting time of the next entry.
fi_fi: täyttää niiden väliset aukot, jotta niiden alkamisaika ei muutu. Jos aikaväli on määritetty, kestoa jatketaan tämän aikavälin arvoon asti ennen seuraavan merkinnän alkamisaikaa.

source: Step 2: Choose time gap between entries
fi_fi: Vaihe 2: Valitse merkintöjen välinen aikaväli

source: Step 3: Choose to fit sessions to their content
fi_fi: Vaihe 3: Valitse istuntojen sovittaminen niiden sisältöön

source: There will be no gaps between consecutive entries.
fi_fi: Peräkkäisten merkintöjen välillä ei saa olla aukkoja.

source: Entries will be separated by gaps of
fi_fi: Merkinnät erotetaan toisistaan välilyönneillä

source: 1 hour
fi_fi: 1 tunti

source: hours
fi_fi: tuntia

source: and
fi_fi: ja

source: 1 minute.
fi_fi: 1 minuutti.

source: minutes.
fi_fi: minuuttia.

source: Rescheduling...
fi_fi: Päivitetään aikataulua...

source: Are you sure you want to reschedule entries ?
fi_fi: Haluatko varmasti päivittää aikataulun merkinnät?

source: The entries that are part of a session will
fi_fi: Istuntoon kuuluvat merkinnät

source: first
fi_fi: ensimmäinen
