Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0-py3-none-any.whl/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: be, da, fr, nl, pt, pt_br

source: Impossible to parse parameters
be: Немагчыма разабраць параметры
da: Umuligt at fortolke parametre
fr: Lecture des paramètres impossible
nl: Lezen van parameters onmogelijk
pt: Não é possível analisar os parâmetros
pt_br: Não é possível analisar os parâmetros

source: Parameter `override_capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
be: Параметр `override_capture_time` не з'яўляецца сапраўднай датай і часам, павінен быць у фармаце iso (напрыклад '2017-07-21T17:32:28Z').
da: Parameter `override_capture_time` er ikke en gyldig datetime, det skal være en iso-formateret datetime (som '2017-07-21T17:32:28Z').
fr: Le paramètre `override_capture_time`n'est pas un horodatage valide, il devrait être au format ISO (exemple '2017-07-21T17:32:28Z').
nl: Parameter `override_capture_time` is geen geldige datetime, het moet een iso-geformatteerde datetime zijn (zoals '2017-07-21T17:32:28Z').
pt: O parâmetro `override_capture_time` não é uma data e hora válida, deve ser uma data e hora no formato ISO (como '2017-07-21T17:32:28Z').
pt_br: O parâmetro `override_capture_time` não é uma data e hora válida, deve ser uma data e hora no formato ISO (como '2017-07-21T17:32:28Z').

source: For parameter `override_longitude`, `{value}` is not a valid longitude
fr: La valeur `{value}` du paramètre `override_longitude` n'est pas valide

source: For parameter `override_latitude`, `{value}` is not a valid longitude
fr: La valeur `{value}` du paramètre `override_latitude` n'est pas valide

source: No file was sent
be: Ніводны файл не быў адпраўлены
da: Der blev ikke sendt nogen fil
fr: Aucun fichier n'a été envoyé
nl: Er is geen bestand verzonden
pt: Nenhum ficheiro foi enviado
pt_br: Nenhum arquivo foi enviado

source: Impossible to create an UploadSet
be: Немагчыма стварыць UploadSet
da: Umuligt at oprette et UploadSet
fr: Création d'un UploadSet impossible
nl: Kan UploadSet niet aanmaken
pt: Impossível criar um UploadSet
pt_br: Não é possível criar um UploadSet

source: The same picture has already been sent in a past upload
be: Тая ж выява ўжо была адпраўлена ў папярэдняй загрузцы
da: Det samme billede er allerede sendt i et tidligere upload
fr: Cette même photo a déjà été envoyée par le passé
nl: Dezelfde afbeelding is al verzonden in een eerdere upload
pt: A mesma imagem já foi enviada num upload anterior
pt_br: A mesma imagem já foi enviada em um upload anterior

source: UploadSet doesn't exists
fr: L'UploadSet n'existe pas

source: You're not authorized to complete this upload set
be: Вы не аўтарызаваны завяршаць гэты набор загрузкі
da: Du er ikke autoriseret til at gennemføre dette upload-sæt
fr: Vous n'avez pas la permission de finaliser cet UploadSet
nl: Je bent niet gemachtigd om deze UploadSet te voltooien
pt: Não está autorizado a concluir este conjunto de uploads
pt_br: Você não tem permissão para concluir este conjunto de uploads

source: The upload set is already completed, cannot complete it several times for the moment
fr: Cet UploadSet est déjà finalisé, il n'est pas permis de le finaliser plusieurs fois pour l'instant

source: UploadSet %(u)s does not exist
be: Набор загрузкі %(u)s не існуе
da: UploadSet %(u)s findes ikke
fr: L'UploadSet %(u)s n'existe pas
nl: UploadSet %(u)s bestaat niet
pt: UploadSet %(u)s não existe
pt_br: UploadSet %(u)s não existe

source: You're not authorized to add picture to this upload set
be: Вы не аўтарызаваны дадаваць выявы ў гэты набор загрузкі
da: Du er ikke autoriseret til at tilføje et billede til dette upload-sæt
fr: Vous n'avez pas la permission d'ajouter des photos à cet Upload Set
nl: Je bent niet gemachtigd om afbeeldingen toe te voegen aan deze UploadSet
pt: Não está autorizado a adicionar imagens a este conjunto de uploads
pt_br: Você não tem permissão para adicionar uma imagem a este conjunto de uploads

source: The picture is too similar to another one (nearby and taken almost at the same time)
be: Выява занадта падобная на іншую (побач і зробленая амаль у той жа час)
da: Billedet ligner for meget et andet (i nærheden og taget på næsten samme tidspunkt)
fr: La photo est trop similaire à une autre (trop proche et prise presque à la même heure)
nl: De foto is te gelijkaardig aan een andere (te dichtbij en bijna op hetzelfde moment genomen)
pt: A imagem é muito semelhante a outra (tirada nas proximidades e quase ao mesmo tempo)
pt_br: A foto é muito semelhante a outra (tirada nas proximidades e quase ao mesmo tempo)

source: The sent file is not a valid JPEG
be: Адпраўлены файл не з'яўляецца сапраўдным JPEG
da: Den sendte fil er ikke en gyldig JPEG
fr: Le fichier envoyé n'est pas une image JPEG valide
nl: Het geüploade bestand is geen geldige JPEG-afbeelding
pt: O ficheiro enviado não é um JPEG válido
pt_br: O arquivo enviado não é um arquivo JPEG válido

source: The picture has invalid EXIF or XMP metadata, making it impossible to use
be: Выява мае несапраўдныя EXIF або XMP метаданы, што робіць яе выкарыстанне немагчымым
da: Billedet har ugyldige EXIF- eller XMP-metadata, hvilket gør det umuligt at bruge
fr: La photo a des métadonnées EXIF ou XMP invalides, la rendant impossible à utiliser
nl: De foto heeft ongeldige EXIT- of XMP-metadata, wat haar onbruikbaar maakt
pt: A imagem tem metadados EXIF ou XMP inválidos, impossibilitando a sua utilização
pt_br: A imagem tem metadados EXIF ou XMP inválidos, impossibilitando seu uso

source: Impossible to create a Report
be: Немагчыма стварыць Справаздачу
da: Umuligt at oprette en rapport
fr: Impossible de créer un signalement
nl: Onmogelijk om een rapport te maken
pt: Impossível criar um Relatório
pt_br: Não é possível criar um Relatório

source: Parameter for creating a Report should be a valid JSON
be: Параметр для стварэння Справаздачы павінен быць сапраўдным JSON
da: Parameter til oprettelse af en rapport skal være en gyldig JSON
fr: Les paramètres pour créer un signalement doivent être sous forme d'un JSON valide
nl: De parameter voor het maken van een rapport moet een geldige JSON zijn
pt: O parâmetro para criar um Relatório deve ser um JSON válido
pt_br: Os parâmetros para a criação de um Relatório deve estar um JSON válido

source: Impossible to open file as image. The only supported image format is jpg.
be: Немагчыма адкрыць файл як выяву. Адзіны падтрыманы фармат выявы - jpg.
da: Det er umuligt at åbne filen som billede. Det eneste understøttede billedformat er jpg.
fr: Impossible d'ouvrir le fichier en tant qu'image. Le seul format accepté est le JPEG.
nl: Kan bestand niet als afbeelding openen. Het enige ondersteunde afbeeldingsformaat is jpg.
pt: Impossível abrir o ficheiro como imagem. O único formato de imagem suportado é jpg.
pt_br: Não é possível abrir o arquivo como imagem. O único formato compatível é jpg.

source: Something went very wrong, but not due to the picture itself
be: Нешта пайшло вельмі дрэнна, але не з-за самой выявы
da: Noget gik helt galt, men ikke på grund af selve billedet
fr: Quelque chose s'est mal passé, mais pas à cause de l'image
nl: Er is iets grondig verkeerd gegaan, maar niet door de afbeelding zelf
pt: Algo correu muito mal, mas não devido à imagem em si
pt_br: Algo deu muito errado, mas não devido à imagem em si

source: Collection %(s)s wasn't found in database
be: Калекцыя %(s)s не знойдзена ў базе даных
da: Samling %(s)s blev ikke fundet i database
fr: La séquence %(s)s n'a pas été trouvée en base
nl: Verzameling %(s)s is niet gevonden in database
pt: A coleção %(s)s não foi encontrada na base de dados
pt_br: A coleção %(s)s não foi encontrada no banco de dados

source: The collection has been deleted, impossible to add pictures to it
be: Калекцыя была выдаленая, немагчыма дадаваць выявы ў яе
da: Samlingen er blevet slettet, det er umuligt at tilføje billeder til den
fr: La séquence a été supprimée, il n'est pas possible d'y ajouter des images
nl: De collectie is verwijderd, het is onmogelijk om er afbeeldingen aan toe te voegen
pt: A coleção foi eliminada, impossível adicionar imagens a ela
pt_br: A coleção foi excluída, não é possível adicionar imagens a ela

source: Only authenticated users can access reports
be: Толькі аўтэнтыфікаваныя карыстальнікі могуць атрымліваць доступ да справаздач
da: Kun godkendte brugere kan få adgang til rapporter
fr: Seules les personnes authentifiées peuvent accéder aux signalements
nl: Alleen geverifieerde gebruikers hebben toegang tot rapporten
pt: Apenas utilizadores autenticados podem aceder aos relatórios
pt_br: Somente usuários autenticados podem acessar relatórios

source: Report doesn't exist
be: Справаздача не існуе
da: Rapporten findes ikke
fr: Le signalement n'existe pas
nl: Rapport bestaat niet
pt: O relatório não existe
pt_br: O relatório não existe

source: You're not authorized to access this report
be: Вы не аўтарызаваны для доступу да гэтай справаздачы
da: Du er ikke autoriseret til at få adgang til denne rapport
fr: Vous n'avez pas l'autorisation d'accéder à ce signalement
nl: je bent niet gemachtigd om dit rapport te raadplegen
pt: Não tem autorização para aceder a este relatório
pt_br: Você não tem permissão para acessar este relatório

source: You're not authorized to edit this Report
be: Вы не аўтарызаваны рэдагаваць гэтую Справаздачу
da: Du er ikke autoriseret til at redigere denne rapport
fr: Vous n'avez pas l'autorisation d'éditer ce signalement
nl: je bent niet gemachtigd om dit rapport te bewerken
pt: Não tem autorização para editar este Relatório
pt_br: Você não tem permissão para editar este Relatório

source: Impossible to edit the Report
be: Немагчыма адрэдагаваць Справаздачу
da: Umuligt at redigere rapporten
fr: Impossible d'éditer le signalement
nl: Het is niet mogelijk om dit rapport te bewerken
pt: Impossível editar o Relatório
pt_br: Não é possível editar o Relatório

source: Parameter for editing the Report should be a valid JSON
be: Параметр для рэдагавання Справаздачы павінен быць сапраўдным JSON
da: Parameter til redigering af rapporten skal være en gyldig JSON
fr: Les paramètres pour éditer le signalement doivent êtres sous forme d'un JSON valide
nl: De parameter voor het bewerken van het rapport moet een geldige JSON zijn
pt: O parâmetro para editar o relatório deve ser um JSON válido
pt_br: O parâmetro para a edição do Relatório deve estar um JSON válido

source: You're not authorized to list reports
be: Вы не аўтарызаваны праглядаць спіс справаздач
da: Du er ikke autoriseret til at opliste rapporter
fr: Vous n'avez pas l'autorisation de lister les signalements
nl: Je hebt geen toestemming voor de rapportenweergave
pt: Não está autorizado a listar relatórios
pt_br: Você não tem permissão para listar relatórios

source: You're not authorized to list pictures in this upload set
da: Du er ikke autoriseret til at vise billeder i dette upload-sæt
fr: Vous n'avez pas l'autorisation de lister les photos dans cet Upload Set

source: Impossible to find excluded area
be: Немагчыма знайсці выключаную вобласць
da: Umuligt at finde ekskluderet område
fr: Impossible de trouver une zone exclue
nl: Onmogelijk om uitgesloten gebied te vinden
pt: Impossível encontrar área excluída
pt_br: Não é possível encontrar a área excluída

source: You must be logged-in as admin to access all excluded areas
be: Вы павінны ўвайсці як адміністратар для доступу да ўсіх выключаных абласцей
da: Du skal være logget ind som administrator for at få adgang til alle ekskluderede områder
fr: Vous devez vous identifier en admin pour accéder à toutes les zones exclues
nl: Je moet ingelogd zijn als admin om toegang te hebben tot alle uitgesloten zones
pt: Tem de estar conectado como administrador para aceder a todas as áreas excluídas
pt_br: Você deve estar logado como administrador para acessar todas as áreas excluídas

source: You're not authorized to access all excluded areas
be: Вы не аўтарызаваны для доступу да ўсіх выключаных абласцей
da: Du er ikke autoriseret til at få adgang til alle ekskluderede områder
fr: Vous n'êtes pas autorisé à accéder à toutes les zones exclues
nl: Je hebt geen toegang tot alle uitgesloten zones
pt: Não está autorizado a aceder a todas as áreas excluídas
pt_br: Você não tem permissão para acessar todas as áreas excluídas

source: Impossible to create an Excluded Area
be: Немагчыма стварыць Выключаную вобласць
da: Umuligt at oprette et ekskluderet område
fr: Impossible de créer une zone exclue
nl: Onmogelijk om een uitgesloten zone te creëren
pt: Impossível criar uma Área Excluída
pt_br: Não é possível criar uma Área Excluída

source: Parameter for creating an Excluded Area should be a valid JSON
be: Параметр для стварэння Выключанай вобласці павінен быць сапраўдным JSON
da: Parameter til oprettelse af et ekskluderet område skal være en gyldig JSON
fr: Les paramètres pour créer une zone exclue doivent être un JSON valide
nl: De parameters om een uitgesloten zone te creëren moeten geldige JSON zijn
pt: O parâmetro para criar uma área excluída deve ser um JSON válido
pt_br: O parâmetro para a criação de uma Área Excluída deve ser um JSON válido

source: You must be logged-in as admin to edit excluded areas
be: Вы павінны ўвайсці як адміністратар для рэдагавання выключаных абласцей
da: Du skal være logget ind som administrator for at redigere ekskluderede områder
fr: Vous devez être identifié en admin pour éditer les zones exclues
nl: Je moet ingelogd zijn als admin om uitgesloten zones te bewerken
pt: Tem de estar conectado como administrador para editar áreas excluídas
pt_br: Você deve estar logado como administrador para editar áreas excluídas

source: Impossible to replace all Excluded Areas
be: Немагчыма замяніць усе Выключаныя вобласці
da: Umuligt at erstatte alle ekskluderede områder
fr: Impossible de remplacer toutes les zones exclues
nl: Onmogelijk om alle uitgesloten zones te vervangen
pt: Impossível substituir todas as Áreas Excluídas
pt_br: Não é possível substituir todas as Áreas Excluídas

source: Picture has invalid metadata
be: Выява мае несапраўдныя метаданы
da: Billede har ugyldige metadata
fr: L'image contient un metadata invalide
nl: Afbeelding heeft ongeldige metadata
pt: A imagem tem metadados inválidos
pt_br: A imagem tem metadados inválidos

source: Parameter for replacing all Excluded Areas should be a valid JSON
be: Параметр для замены ўсіх Выключаных абласцей павінен быць сапраўдным JSON
da: Parameter til udskiftning af alle ekskluderede områder skal være en gyldig JSON
fr: Le paramètre pour remplacer toutes les Zones Exclues doit être un JSON valide
nl: De parameter om alle uitgesloten zones te vervangen moet geldige JSON zijn
pt: O parâmetro para substituir todas as áreas excluídas deve ser um JSON válido
pt_br: O parâmetro para a substituição de todas as Áreas Excluídas deve ser um JSON válido

source: You must be logged-in as admin to delete excluded areas
be: Вы павінны ўвайсці як адміністратар для выдалення выключаных абласцей
da: Du skal være logget ind som administrator for at slette ekskluderede områder
fr: Vous devez être connecté en tant qu'administrateur pour supprimer des zones exclues
nl: Je moet ingelogd zijn als admin om uitgesloten zones te verwijderen
pt: Tem de estar conectado como administrador para excluir áreas excluídas
pt_br: Você deve estar logado como administrador para remover áreas excluídas

source: You're not authorized to delete this upload set
be: Вы не аўтарызаваны выдаляць гэты набор загрузкі
da: Du er ikke autoriseret til at slette dette upload-sæt
fr: Vous n'avez pas l'autorisation de supprimer cet UploadSet
nl: Je bent niet gemachtigd om deze UploadSet te verwijderen
pt: Não tem autorização para eliminar este conjunto de uploads
pt_br: Você não tem permissão para excluir este conjunto de uploads

source: A different picture with the same name has already been added to this uploadset
be: Іншая выява з такой жа назвай ужо дададзена ў гэты набор загрузкі
da: Et andet billede med samme navn er allerede blevet tilføjet til dette upload-sæt
fr: Une photo différente ayant le même nom a déjà été ajoutée à cet uploadset
nl: Een andere foto met dezelfde naam is al toegevoegd aan deze uploadset
pt: Uma imagem diferente com o mesmo nome já foi adicionada a este conjunto de uploads
pt_br: Uma imagem diferente com o mesmo nome já foi adicionada a este conjunto de uploads

source: For parameter `longitude`, `%(v)s` is not a valid longitude
be: Для параметра `longitude`, `%(v)s` не з'яўляецца сапраўднай даўгатой
da: For parameter `longitude`, er `%(v)s` ikke en gyldig længdegrad
fr: Pour le paramètre `longitude`, `%(v)s` n'est pas une longitude correcte
nl: Voor de parameter `longitude` is `%(v)s` geen geldige lengtegraad
pt: Para o parâmetro `longitude`, `%(v)s` não é uma longitude válida
pt_br: Para o parâmetro `longitude`, `%(v)s` não é uma longitude válida

source: For parameter `latitude`, `%(v)s` is not a valid latitude
be: Для параметра `latitude`, `%(v)s` не з'яўляецца сапраўднай шыратой
da: For parameter `latitude`, er `%(v)s` ikke en gyldig breddegrad
fr: Pour le paramètre `latitude`, `%(v)s`n'est pas une correct latitude
nl: Voor de parameter `latitude` is `%(v)s` geen geldige breedtegraad
pt: Para o parâmetro latitude, `%(v)s` não é uma latitude válida
pt_br: Para o parâmetro latitude, `%(v)s` não é uma latitude válida

source: Parameter `capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
be: Параметр `capture_time` не з'яўляецца сапраўднай датай і часам, павінен быць у фармаце iso (напрыклад '2017-07-21T17:32:28Z').
da: Parameter `capture_time` er ikke en gyldig datetime, det skal være en iso-formateret datetime (som '2017-07-21T17:32:28Z').
fr: Le paramètre`capture_time` n'est pas un correct datetime, il est préférable d'utiliser le format ISO (comme '2017-07-21T17:32:28Z').
nl: Parameter 'capture_time' is geen geldige datetime, het moet een iso-geformatteerde datetime zijn (zoals '2017-07-21T17:32:28Z').
pt: O parâmetro `capture_time` não é uma data e hora válida, deve ser uma data e hora no formato ISO (como '2017-07-21T17:32:28Z').
pt_br: O parâmetro `capture_time` não é uma data e hora válida, deve ser uma data e hora no formato ISO (como '2017-07-21T17:32:28Z').

source: Longitude cannot be overridden alone, latitude also needs to be set
be: Даўгату нельга пераазначыць адну, шырата таксама павінна быць зададзена
da: Længdegrad kan ikke overskrives alene, breddegrad skal også indstilles
fr: La longitude ne peut pas être renseignée seule, la latitude doit être également renseignée
nl: Lengtegraad kan niet alleen worden overschreven, breedtegraad moet ook worden ingesteld
pt: A longitude não pode ser sobrescrita sozinha, a latitude também precisa ser definida
pt_br: A longitude não pode ser sobrescrita sozinha, a latitude também precisa ser definida

source: Latitude cannot be overridden alone, longitude also needs to be set
be: Шырату нельга пераазначыць адну, даўгата таксама павінна быць зададзена
da: Breddegrad kan ikke overskrives alene, længdegrad skal også indstilles
fr: La latitude ne peut pas être indiquée seule, la longitude doit être également indiquée
nl: De breedtegraad kan niet alleen worden overschreven, de lengtegraad moet ook worden ingesteld
pt: A latitude não pode ser sobrescrita sozinha, a longitude também precisa ser definida
pt_br: A latitude não pode ser sobrescrita sozinha, a longitude também precisa ser definida

source: You need to accept the terms of service before uploading any pictures. You can do so by validating them here: %(url)s
be: Перад загрузкай любых выяў вам неабходна прыняць умовы абслугоўвання. Вы можаце зрабіць гэта, пацвердзіўшы іх тут: %(url)s
da: Du skal acceptere servicevilkårene, før du uploader billeder. Det kan du gøre ved at validere dem her: %(url)s
fr: Vous devez accepter les conditions d'utilisation du service avant d'uploader des images. Vous pouvez le faire en les validant ici : %(url)s
nl: Je moet de gebruiksvoorwaarden accepteren voor het uploaden van foto's. Je kan dat doen door ze hier te valideren: %(url)s
pt: Tem de aceitar os termos de serviço antes de carregar quaisquer imagens. Pode fazê-lo validando-os aqui: %(url)s
pt_br: Você precisa aceitar os termos de serviço antes de enviar qualquer foto. Você pode fazer isso validando-os aqui: %(url)s

source: You're not authorized to edit those fields for this sequence. Only the owner can change the visibility and the title
be: Вы не аўтарызаваны рэдагаваць гэтыя палі для гэтай паслядоўнасці. Толькі ўладальнік можа змяняць бачнасць і назву
da: Du er ikke autoriseret til at redigere disse felter for denne sekvens. Kun ejeren kan ændre synligheden og titlen
fr: Vous n'êtes pas autorisé à modifier ces champs pour cette séquence. Seul le propriétaire peut modifier la visibilité et le titre
nl: Je hebt geen toestemming om die velden te bewerken voor deze sequentie. Alleen de eigenaar kan de zichtbaarheid en de titel aanpassen
pt: Não está autorizado a editar esses campos para esta sequência. Apenas o proprietário pode alterar a visibilidade e o título
pt_br: Você não tem permissão para editar esses campos desta sequência. Somente o proprietário pode alterar a visibilidade e o título

source: You're not authorized to edit this sequence, collaborative editing is not allowed
be: Вы не аўтарызаваны рэдагаваць гэтую паслядоўнасць, каляборатыўнае рэдагаванне не дазволена
da: Du er ikke autoriseret til at redigere denne sekvens, fælles redigering er ikke tilladt
fr: Vous n'êtes pas autorisé à éditer cette séquence, l'édition collaborative n'est pas autorisée
nl: Je hebt geen toestemming om deze sequentie te bewerken, collaboratieve bewerkingen zijn niet toegestaan
pt: Não tem autorização para editar esta sequência, a edição colaborativa não é permitida
pt_br: Você não tem permissão para editar esta sequência, edição colaborativa não está permitida

source: You're not authorized to edit the visibility of this picture. Only the owner can change this.
be: Вы не аўтарызаваны рэдагаваць бачнасць гэтай выявы. Толькі ўладальнік можа змяняць гэта.
da: Du er ikke autoriseret til at redigere synligheden af dette billede. Kun ejeren kan ændre dette.
fr: Vous n'êtes pas autorisé à éditer la visibilité de cette photo. Seulement le dépositaire peut la changer.
nl: Je hebt geen toestemming om de zichtbaarheid van deze afbeelding te bewerken. Alleen de eigenaar kan dit wijzigen.
pt: Não tem autorização para editar a visibilidade desta imagem. Apenas o proprietário pode alterar isso.
pt_br: Você não tem permissão para editar a visibilidade desta imagem. Somente o proprietário pode alterar isso.

source: There is already a picture with the same index in the sequence
be: У паслядоўнасці ўжо ёсць выява з такім жа індэксам
da: Der er allerede et billede med samme indeks i sekvensen
fr: Une photo existe déjà à cette position (index) dans cette séquence
nl: Er is al een foto met dezelfde index in de sequentie
pt: Já existe uma imagem com o mesmo índice na sequência
pt_br: Já existe uma imagem com o mesmo índice na sequência

source: You're not authorized to edit this picture, collaborative editing is not allowed
be: Вы не аўтарызаваны рэдагаваць гэтую выяву, каляборатыўнае рэдагаванне не дазволена
da: Du er ikke autoriseret til at redigere dette billede, fælles redigering er ikke tilladt
fr: Vous n'avez pas les droits suffisants pour modifier cette photo, l'édition collaborative est désactivée
nl: Je hebt geen toestemming om deze foto te bewerken, gezamenlijk bewerken is niet toegestaan
pt: Não tem autorização para editar esta imagem, a edição colaborativa não é permitida
pt_br: Você não tem permissão para editar esta imagem, edição colaborativa não é permitida
