Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0-py3-none-any.whl/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: be, da, fr, nl, pt, pt_br

source: Unsupported sortby parameter: invalid field
be: Непадтрыманы параметр sortby: несапраўднае поле
da: Ikke-understøttet sortby-parameter: ugyldigt felt
fr: Paramètre "sortby" non-géré : champ invalide
nl: Niet-ondersteunde `sortby`-parameter: ongeldig veld
pt: Parâmetro sortby não suportado: campo inválido
pt_br: Parâmetro sortby não compatível: campo inválido

source: Impossible to create an annotation
be: Немагчыма стварыць анатацыю
da: Ikke muligt at oprette en annotation
fr: Impossible de créer une annotation
nl: Onmogelijk om een annotatie te maken
pt: Impossível criar uma anotação
pt_br: Não é possível criar uma anotação

source: Parameter for creating an annotation should be a valid JSON
be: Параметр для стварэння анатацыі павінен быць сапраўдным JSON
da: Parameter til oprettelse af en annotation skal være en gyldig JSON
fr: Le paramètre pour créer une annotation doit être un JSON valide
nl: De parameter voor het maken van een aantekening moet een geldige JSON zijn
pt: O parâmetro para criar uma anotação deve ser um JSON válido
pt_br: O parâmetro para criar uma anotação deve ser um JSON válido

source: Annotation %(p)s not found
be: Анатацыя %(p)s не знойдзена
da: Annotation %(p)s ikke fundet
fr: Annotation %(p)s introuvable
nl: Annotatie %(p)s niet gevonden
pt: Anotação %(p)s não encontrada
pt_br: Anotação %(p)s não encontrada

source: Parameter for updating an annotation should be a valid JSON
be: Параметр для абнаўлення анатацыі павінен быць сапраўдным JSON
da: Parameteren til opdatering af en annotation skal være en gyldig JSON
fr: Le paramètre pour actualiser une annotation doit être un JSON valide
nl: De parameter voor het bijwerken van een annotatie moet een geldige JSON zijn
pt: O parâmetro para atualizar uma anotação deve ser um JSON válido
pt_br: O parâmetro para atualizar uma anotação deve ser um JSON válido

source: CSV export does not support pagination
be: CSV экспарт не падтрымлівае пагінацыю
da: CSV-eksport understøtter ikke sideopdeling
fr: L'export CSV ne gère pas la pagination
nl: CSV-export ondersteunt geen paginering
pt: A exportação CSV não suporta paginação
pt_br: A exportação CSV não é compatível com a paginação

source: CSV export does not support filters
be: CSV экспарт не падтрымлівае фільтры
da: CSV-eksport understøtter ikke filtre
fr: L'export CSV ne gère pas les filtres
nl: CSV-export ondersteunt geen filters
pt: A exportação CSV não suporta filtros
pt_br: A exportação CSV não é compatível com filtros

source: Page not available in language %(l)s
be: Старонка недаступная на мове %(l)s
da: Siden er ikke tilgængelig på sproget %(l)s
fr: La page n'est pas disponible dans la langue %(l)s
nl: Pagina niet beschikbaar in taal %(l)s
pt: A página não disponível no idioma %(l)s
pt_br: A página não disponível no idioma %(l)s

source: Page content must be HTML (with Content-Type: text/html header set)
be: Змесціва старонкі павінна быць HTML (з устаноўленым загалоўкам Content-Type: text/html)
da: Sidens indhold skal være HTML (med Content-Type: text/html header indstillet)
fr: Le contenu de la page doit être du HTML (avec l'en-tête Content-Type : text/html)
nl: Pagina-inhoud moet HTML zijn (met header Content-Type: text/html)
pt: O conteúdo da página deve ser HTML (com o cabeçalho Content-Type: text/html definido)
pt_br: O conteúdo da página deve ser HTML (com o cabeçalho Content-Type: text/html definido)

source: Could not update page content
be: Не ўдалося абнавіць змесціва старонкі
da: Kunne ikke opdatere sidens indhold
fr: Impossible de modifier le contenu de la page
nl: Kan de pagina-inhoud niet bijwerken
pt: Não foi possível atualizar o conteúdo da página
pt_br: Não foi possível atualizar o conteúdo da página

source: Could not delete page content
be: Не ўдалося выдаліць змесціва старонкі
da: Kunne ikke slette sideindhold
fr: Impossible de supprimer le contenu de la page
nl: Kan de pagina-inhoud niet verwijderen
pt: Não foi possível eliminar o conteúdo da página
pt_br: Não possível excluir o conteúdo da página

source: Impossible to update the UploadSet
be: Немагчыма абнавіць UploadSet
da: Ikke muligt at opdatere UploadSet
fr: Impossible de modifier l'Upload Set
nl: Kan UploadSet niet bijwerken
pt: Impossível atualizar o UploadSet
pt_br: Não é possível atualizar o UploadSet

source: Parameter for updating an UploadSet should be a valid JSON
be: Параметр для абнаўлення UploadSet павінен быць сапраўдным JSON
da: Parameteren til opdatering af et UploadSet skal være en gyldig JSON
fr: Le paramètre pour modifier un Upload Set doit être un JSON valide
nl: Parameter voor het bijwerken van een UploadSet moet een geldige JSON zijn
pt: O parâmetro para atualizar um UploadSet deve ser um JSON válido
pt_br: O parâmetro para atualizar um UploadSet deve estar um JSON válido

source: You are not allowed to update this upload set
be: Вам не дазволена абнаўляць гэты набор загрузкі
da: Du må ikke opdatere dette uploadsæt
fr: Vous n'avez pas les droits suffisants pour modifier cet upload set
nl: Het is niet toegestaan om deze UploadSet bij te werken
pt: Não é permitido atualizar este conjunto de uploads
pt_br: Você não tem permissão para atualizar este conjunto de uploads

source: Impossible to patch annotation, invalid parameters
be: Немагчыма абнавіць анатацыю, несапраўдныя параметры
da: Ikke muligt at rette annotation, ugyldige parametre
fr: Impossible de modifier l'annotation, les paramètres sont invalides
nl: Onmogelijk om annotatie te herstellen, ongeldige parameters
pt: Impossível atualizar anotação, parâmetros inválidos
pt_br: Não é possível atualizar a anotação, parâmetros inválidos

source: CSV export does not support sorting by anything but creation date
be: CSV экспарт падтрымлівае сарціроўку толькі па даце стварэння
da: CSV-eksport understøtter ikke sortering efter andet end oprettelsesdato
fr: L'export CSV gère uniquement le tri par date de création
nl: CSV-export ondersteunt alleen sortering op aanmaakdatum
pt: A exportação CSV não suporta ordenação por nenhum outro critério além da data de criação
pt_br: A exportação CSV não é compatível com a ordenação por nenhum outro critério além da data de criação

source: Page name is not recognized
be: Назва старонкі не распазнана
da: Sidens navn genkendes ikke
fr: Nom de page non reconnu
nl: Paginanaam wordt niet herkend
pt: O nome da página não é reconhecido
pt_br: Nome da página não é reconhecido

source: You must be logged-in as admin to edit pages
be: Вы павінны ўвайсці як адміністратар для рэдагавання старонак
da: Du skal være logget ind som administrator for at redigere sider
fr: Vous devez être connecté en tant qu'admin pour éditer les pages
nl: je moet ingelogd zijn als beheerder om pagina's te kunnen bewerken
pt: Tem de estar conectado como administrador para editar páginas
pt_br: Você deve estar logado como administrador para editar páginas

source: Sequence doesn't exists
da: Sekvens findes ikke
nl: Sequentie bestaat niet
pt: A sequência não existe
pt_br: A sequência não existe

source: Picture is not available (currently in processing)
da: Billede er ikke tilgængeligt (behandles i øjeblikket)
nl: Afbeelding is niet beschikbaar (momenteel in verwerking)
pt: A imagem não está disponível (atualmente em processamento)
pt_br: A imagem não está disponível (atualmente em processamento)

source: Impossible to add the picture to this uploadset
da: Det er ikke muligt at tilføje billedet til dette upload-sæt
nl: Afbeelding kan niet worden toegevoegd aan deze uploadset
pt: Impossível adicionar a imagem a este uploadset
pt_br: Não é possível adicionar a imagem a este uploadset

source: RSS format does not support deleted sequences
da: RSS-formatet understøtter ikke slettede sekvenser
nl: Het RSS-formaat ondersteund geen verwijderde sequenties
pt: O formato RSS não suporta sequências eliminadas
pt_br: O formato RSS não é compatível com sequências excluídas

source: Visibility and visible parameters are mutually exclusive parameters
da: Synlighed og synlige parametre er gensidigt udelukkende parametre
nl: Zichtbaarheid en zichtbare parameters kunnen niet samen gebruikt worden
pt: Os parâmetros visibility e visible são parâmetros mutuamente exclusivos
pt_br: Os parâmetros visibility e visible são parâmetros mutuamente exclusivos

source: The status filter is not supported anymore, use the `visibility` filter instead
da: Statusfilteret understøttes ikke længere. Brug i stedet filteret `visibility`
nl: De statusfilter wordt niet meer ondersteund, gebruik in de plaats de `zichtbaarheid`-filter
pt: O filtro status já não é suportado, utilize o filtro `visibility` em vez disso
pt_br: O filtro status não é mais compatível. Use o filtro `visibility` em seu lugar

source: The status filter is not supported anymore, use the `show_deleted` parameter instead if you need to query deleted collections
da: Statusfilteret understøttes ikke længere. Brug i stedet parameteren `show_deleted`, hvis du har brug for at søge i slettede samlinger
nl: De statusfilter wordt niet meer ondersteund, gebruik in de plaats de `toon_verwijderd`-parameter indien je verwijderde collecties moet doorzoeken
pt: O filtro status já não é suportado. Utilize o parâmetro `show_deleted` se precisar consultar coleções eliminadas
pt_br: O filtro status não é mais compatível. Use o parâmetro `show_deleted` em seu lugar se precisar consultar coleções excluídas

source: The logged-only visibility is not allowed on this instance since anybody can create an account
da: Kun-loggede synligheden er ikke tilladt på denne instans, da alle kan oprette en konto
nl: De “alleen ingelogd”-zichtbaarheid is niet toegelaten op deze instantie, aangezien iedereen een account kan aanmaken
pt: A visibilidade apenas para contas conectadas não é permitida nesta instância, porque qualquer pessoa pode criar uma conta
pt_br: A visibilidade apenas para contas conectadas não é permitida nesta instância, porque qualquer pessoa pode criar uma conta
