Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0-py3-none-any.whl/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: be, da, fr, nl, pt, pt_br

source: Position in sequence should be a positive integer
be: Пазіцыя ў паслядоўнасці павінна быць станоўчым цэлым лікам
da: Position i sekvensen skal være et positivt heltal
fr: La position dans la séquence doit être un nombre entier positif
nl: De positie in serie moet een positief geheel getal zijn
pt: A posição na sequência deve ser um número inteiro positivo
pt_br: A posição na sequência deve ser um número inteiro positivo

source: Longitude cannot be overridden alone, override_latitude also needs to be set
be: Даўгату нельга пераазначыць адну, override_latitude таксама павінен быць зададзены
da: Længdegrad kan ikke overskrives alene, override_latitude skal også indstilles
fr: La longitude ne peut pas être surchargée seule, "override_latitude" doit aussi être renseigné
nl: De lengtegraad kan niet alleen worden overschreven, override_latitude moet ook worden ingesteld
pt: A longitude não pode ser sobrescrita sozinha, override_latitude também precisa ser definido
pt_br: A longitude não pode ser sobrescrita sozinha, override_latitude também precisa ser definido

source: Latitude cannot be overridden alone, override_longitude also needs to be set
be: Шырату нельга пераазначыць адну, override_longitude таксама павінен быць зададзены
da: Breddegrad kan ikke overskrives alene, override_longitude skal også indstilles
fr: La latitude ne peut pas être surchargée seule, "override_longitude" doit aussi être renseigné
nl: Breedtegraad kan niet alleen worden overschreven, override_longitude moet ook worden ingesteld
pt: A latitude não pode ser sobrescrita sozinha, override_longitude também precisa ser definido
pt_br: A latitude não pode ser sobrescrita sozinha, override_longitude também precisa ser definido

source: For parameter `override_longitude`, `%(v)s` is not a valid longitude
be: Для параметра `override_longitude`, `%(v)s` не з'яўляецца сапраўднай даўгатой
da: For parameteren `override_longitude`, er `%(v)s` ikke en gyldig længdegrad
fr: Le paramètre `override_longitude` a une valeur %(v)s invalide
nl: Voor parameter 'override_longitude' is '%(v)s' geen geldige lengtegraad
pt: Para o parâmetro `override_longitude`, `%(v)s` não é uma longitude válida
pt_br: Para o parâmetro `override_longitude`, `%(v)s` não é uma longitude válida

source: For parameter `override_latitude`, `%(v)s` is not a valid latitude
be: Для параметра `override_latitude`, `%(v)s` не з'яўляецца сапраўднай шыратой
da: For parameteren `override_latitude`, er `%(v)s` ikke en gyldig breddegrad
fr: Le paramètre `override_latitude` a une valeur %(v)s invalide
nl: Voor parameter 'override_latitude' is '%(v)s' geen geldige breedtegraad
pt: Para o parâmetro `override_latitude`, `%(v)s` não é uma latitude válida
pt_br: Para o parâmetro `override_latitude`, `%(v)s` não é uma latitude válida

source: Picture blur status should be either unset, true or false
be: Статус размыцця выявы павінен быць unset, true або false
da: Status for billedsløring skal være enten unset, true eller false
fr: L'état de floutage de la photo (blur) doit être soit vide, "true" ou "false"
nl: De status van beeldvervaging moet waar of onwaar of niet ingesteld zijn
pt: O status de desfoque da imagem deve ser não definido, true ou false
pt_br: O status de desfoque da imagem deve ser não definido, true ou false

source: No picture file was sent
be: Файл выявы не быў адпраўлены
da: Ingen billedfil blev sendt
fr: Aucun fichier de photo n'a été envoyé
nl: Er is geen afbeelding verzonden
pt: Nenhum ficheiro de imagem foi enviado
pt_br: Nenhum arquivo de imagem foi enviado

source: Picture file is either missing or in an unsupported format (should be jpg)
be: Файл выявы альбо адсутнічае, альбо ў непрыдатным фармаце (павінен быць jpg)
da: Billedfilen mangler eller er i et ikke-understøttet format (bør være jpg)
fr: Le fichier photo est soit manquant, soit dans un format non-supporté (doit être en JPEG)
nl: Afbeelding ontbreekt of is niet van het juiste type (moet jpg zijn)
pt: O ficheiro de imagem está em falta ou num formato não suportado (deve ser jpg)
pt_br: O arquivo de imagem está ausente ou em um formato não compatível (deve ser jpg)

source: Sequence %(s)s wasn't found in database
fr: La séquence %(s)s est introuvable en base

source: Picture at given position already exist
da: Billede på den givne position findes allerede
fr: Une photo à cette position existe déjà
nl: Afbeelding op de gegeven positie bestaat al

source: Impossible to parse picture metadata
be: Немагчыма разабраць метаданы выявы
da: Umuligt at fortolke billedmetadata
fr: Impossible de lire les métadonnées de la photo
nl: Metadata van afbeelding is niet te verwerken
pt: Impossível analisar os metadados de imagem
pt_br: Não é possível analisar os metadados de imagem

source: Picture wasn't correctly saved in filesystem
be: Выява не была карэктна захавана ў файлавай сістэме
da: Billede blev ikke gemt korrekt i filsystemet
fr: La photo n'a pas été correctement enregistrée sur le système de fichiers
nl: Afbeelding is niet correct opgeslagen in het bestandssysteem
pt: A imagem não foi guardada corretamente no sistema de ficheiros
pt_br: A imagem não foi salva corretamente no sistema de arquivos

source: Heading is not valid, should be an integer in degrees from 0° to 360°. North is 0°, East = 90°, South = 180° and West = 270°.
be: Напрамак несапраўдны, павінен быць цэлым лікам у градусах ад 0° да 360°. Поўнач = 0°, Усход = 90°, Поўдзень = 180° і Захад = 270°.
da: Retning er ikke gyldig, den skal være et heltal i grader fra 0° til 360°. Nord er 0°, øst = 90°, syd = 180° og vest = 270°.
fr: L'orientation ("heading") est invalide, ce doit être un nombre entier de 0 à 360°. Le Nord est à 0°, l'Est à 90°, le Sud à 180° et l'Ouest à 270°.
nl: Richtingshoek is niet geldig, moet een geheel getal zijn in graden van 0° tot 360°. Noord is 0°, Oost = 90°, Zuid = 180° en West = 270°.
pt: A direção não é válida, deve ser um número inteiro em graus de 0° a 360°. Norte é 0°, Leste = 90°, Sul = 180° e Oeste = 270°.
pt_br: A direção não é válida, deve ser um número inteiro em graus de 0° a 360°. Norte é 0°, Leste = 90°, Sul = 180° e Oeste = 270°.

source: Picture %(p)s wasn't found in database
be: Выява %(p)s не знойдзена ў базе даных
da: Billede %(p)s blev ikke fundet i database
fr: La photo %(p)s est introuvable en base
nl: Afbeelding %(p)s is niet gevonden in de database
pt: A imagem %(p)s não foi encontrada na base de dados
pt_br: A imagem %(p)s não foi encontrada no banco de dados

source: You're not authorized to edit this picture
be: Вы не аўтарызаваны рэдагаваць гэтую выяву
da: Du er ikke autoriseret til at redigere dette billede
fr: Vous n'avez pas la permission de modifier cette photo
nl: je bent niet gemachtigd om deze afbeelding te bewerken
pt: Não tem autorização para editar esta imagem
pt_br: Você não tem permissão para editar esta imagem

source: Picture %(p)s is in %(s)s state, its visibility can't be changed for now
be: Выява %(p)s знаходзіцца ў стане %(s)s, яе бачнасць цяпер нельга змяніць
da: Billede %(p)s er i %(s)s tilstand, dets synlighed kan ikke ændres i øjeblikket
fr: La photo %(p)s est en état "%(s)s", sa visibilité ne peut pas être changée pour l'instant
nl: Afbeelding %(p)s heeft de status %(s)s, de zichtbaarheid kan voorlopig niet worden gewijzigd
pt: A imagem %(p)s está no estado %(s)s, sua visibilidade não pode ser alterada no momento
pt_br: A imagem %(p)s está no estado %(s)s, sua visibilidade não pode ser alterada no momento

source: One of required parameter is empty
be: Адзін з абавязковых параметраў пусты
da: En af de krævede parametre er tom
fr: L'un des paramètres obligatoires est manquant
nl: Een van de vereiste parameters is leeg
pt: Um dos parâmetros necessários é vazio
pt_br: Um dos parâmetros necessários é vazio

source: Tile format is invalid, should be either pbf or mvt
be: Фармат тайла несапраўдны, павінен быць pbf або mvt
da: Fliseformatet er ugyldigt, bør være enten pbf eller mvt
fr: Le format de tuile est invalide, ce doit être pbf ou mvt
nl: Het tegelformaat is ongeldig, moet pbf of mvt zijn
pt: O formato de mosaico é inválido, deve ser pbf ou mvt
pt_br: O formato de mosaico é inválido, deve ser pbf ou mvt

source: X or Y parameter is out of bounds
be: Параметр X або Y выходзіць за межы
da: X- eller Y-parameter er uden for grænserne
fr: Le paramètre X ou Y est hors limites
nl: De parameter X of Y is buiten de grenzen
pt: O parâmetro X ou Y está fora dos limites
pt_br: O parâmetro X ou Y está fora dos limites

source: Z parameter is out of bounds (should be 0-15)
be: Параметр Z выходзіць за межы (павінен быць 0-15)
da: Z-parameter er uden for grænserne (bør være 0-15)
fr: Le paramètre Z est hors limites (doit être entre 0 et 15)
nl: Z-parameter is buiten de grenzen (moet 0-15 zijn)
pt: O parâmetro Z está fora dos limites (deve estar entre 0 e 15)
pt_br: O parâmetro Z está fora dos limites (deve estar entre 0 e 15)

source: Impossible to get tile
be: Немагчыма атрымаць тайл
da: Umuligt at hente fliser
fr: Impossible de récupérer la tuile
nl: Tegel niet beschikbaar
pt: Impossível obter mosaico
pt_br: Não é possível obter mosaico

source: Parameter datetime should contain one or two dates
be: Параметр datetime павінен утрымліваць адну або дзве даты
da: Parameter datetime skal indeholde en eller to datoer
fr: Le paramètre "datetime" doit contenir une ou deux dates
nl: De parameter `datetime` moet één of twee datums bevatten
pt: O parâmetro datetime deve conter uma ou duas datas
pt_br: O parâmetro datetime deve conter uma ou duas datas

source: Parameter bbox must contain valid longitude (-180 to 180) and latitude (-90 to 90) values
be: Параметр bbox павінен утрымліваць сапраўдныя значэнні даўгаты (-180 да 180) і шыраты (-90 да 90)
da: Parameter bbox skal indeholde gyldige værdier for længdegrad (-180 til 180) og breddegrad (-90 til 90)
fr: Le paramètre "bbox" doit contenir des valeurs valides de longitude (-180 à 180°) et de latitude (-90 à 90°)
nl: Parameter `bbox` moet een geldige lengtegraad (-180 tot 180) en breedtegraad (-90 tot 90) bevatten
pt: O parâmetro bbox deve conter uma valores válidos de longitude (de -180 a 180) e latitude (de -90 a 90)
pt_br: O parâmetro bbox deve conter uma valores válidos de longitude (de -180 a 180) e latitude (de -90 a 90)

source: Parameter bbox must be in format [minX, minY, maxX, maxY]
be: Параметр bbox павінен быць у фармаце [minX, minY, maxX, maxY]
da: Parameter bbox skal være i formatet [minX, minY, maxX, maxY]
fr: Le paramètre "bbox" doit être au format [minX, minY, maxX, maxY]
nl: Parameter bbox moet zijn opgemaakt als [minX, minY, maxX, maxY]
pt: O parâmetro bbox deve ser no formato [minX, minY, maxX, maxY]
pt_br: O parâmetro bbox deve ser no formato [minX, minY, maxX, maxY]

source: Parameter %(p)s must be coordinates in lat,lon format
be: Параметр %(p)s павінен быць каардынатамі ў фармаце шырата,даўгата
da: Parameter %(p)s skal være koordinater i lat,lon-format
fr: Le paramètre "%(p)s" doit être une position au format lat,lon
nl: Parameter %(p)s moet bestaan uit coördinaten in breedtegraad,lengtegraad formaat (lat,lon)
pt: O parâmetro %(p)s deve ser coordenadas no formato lat,lon
pt_br: O parâmetro %(p)s deve ser coordenadas no formato lat,lon

source: Longitude in parameter %(p)s is not valid (should be between -180 and 180)
be: Даўгата ў параметры %(p)s несапраўдная (павінна быць паміж -180 і 180)
da: Længdegrad i parameter %(p)s er ikke gyldig (skal være mellem -180 og 180)
fr: La longitude dans le paramètre "%(p)s" est invalide (doit être comprise entre -180 et 180°)
nl: De lengtegraad in parameter %(p)s is niet geldig (moet tussen -180 en 180 liggen)
pt: A longitude no parâmetro %(p)s não é válida (deve estar entre -180 e 180)
pt_br: A longitude no parâmetro %(p)s não é válida (deve estar entre -180 e 180)

source: Latitude in parameter %(p)s is not valid (should be between -90 and 90)
be: Шырата ў параметры %(p)s несапраўдная (павінна быць паміж -90 і 90)
da: Breddegrad i parameter %(p)s er ikke gyldig (skal være mellem -90 og 90)
fr: La latitude dans le paramètre "%(p)s" est invalide (doit être comprise entre -90 et 90°)
nl: De breedtegraad in parameter %(p)s is niet geldig (moet tussen -90 en 90 liggen)
pt: A latitude no parâmetro %(p)s não é válida (deve estar entre -90 e 90)
pt_br: A latitude no parâmetro %(p)s não é válida (deve estar entre -90 e 90)

source: Parameter %(p)s is invalid (should be a distance range in meters like "5-15")
be: Параметр %(p)s несапраўдны (павінен быць дыяпазонам адлегласці ў метрах, напрыклад "5-15")
da: Parameter %(p)s er ugyldig (skal være en distance-spændvidde i meter som "5-15")
fr: Le paramètre "%(p)s" est invalide (doit être un intervalle de distance tel que "5-15")
nl: Parameter %(p)s is ongeldig (moet een afstandsbereik zijn in meters zoals "5-15")
pt: O parâmetro %(p)s é inválido (deve ser um intervalo de distância em metros, como "5-15")
pt_br: O parâmetro %(p)s é inválido (deve ser um intervalo de distância em metros, como "5-15")

source: Parameter %(p)s has a min value greater than its max value
be: Параметр %(p)s мае мінімальнае значэнне большае за максімальнае
da: Parameter %(p)s har en min-værdi, der er større end dens maks-værdi
fr: Le paramètre "%(p)s" a une valeur minimale plus grande que sa valeur maximale
nl: Parameter %(p)s heeft een min-waarde die groter is dan de max-waarde
pt: O parâmetro %(p)s tem um valor min maior do que seu valor max
pt_br: O parâmetro %(p)s tem um valor min maior do que seu valor max

source: Parameter %(p)s must be a valid list
be: Параметр %(p)s павінен быць сапраўдным спісам
da: Parameter %(p)s skal være en gyldig liste
fr: Le paramètre "%(p)s" doit être une liste valide
nl: Parameter %(p)s moet een geldige lijst zijn
pt: O parâmetro %(p)s deve ser uma lista válida
pt_br: O parâmetro %(p)s deve ser uma lista válida

source: Unsupported filter parameter
be: Непадтрыманы параметр фільтра
da: Ikke-understøttet filterparameter
fr: Paramètre de filtre non supporté
nl: Filter parameter is niet ondersteund
pt: Parâmetro de filtro não suportado
pt_br: Parâmetro de filtro não compatível

source: Unsupported sortby parameter: invalid column name
be: Непадтрыманы параметр sortby: несапраўднае імя слупка
da: Ikke-understøttet sortby-parameter: ugyldigt kolonnenavn
fr: Paramètre de tri "sortby" non supporté : le nom de colonne est invalide
nl: Niet-ondersteunde `sortby`-parameter: ongeldige kolomnaam
pt: Parâmetro sortby não suportado: nome de coluna inválido
pt_br: Parâmetro sortby não compatível: nome de coluna inválido

source: Unsupported sortby parameter: syntax isn't correct
be: Непадтрыманы параметр sortby: сінтаксіс няправільны
da: Ikke-understøttet sortby-parameter: syntaksen er ikke korrekt
fr: Paramètre de tri "sortby" invalide : la syntaxe n'est pas correcte
nl: Niet-ondersteunde `sortby`-parameter: syntaxis is niet correct
pt: Parâmetro sortby não suportado: a sintaxe não está correta
pt_br: Parâmetro sortby não compatível: a sintaxe não está correta

source: limit parameter should be a valid, positive integer (between 1 and %(v)s)
be: Параметр limit павінен быць сапраўдным станоўчым цэлым лікам (паміж 1 і %(v)s)
da: afgrænsningsparameter skal være et gyldigt, positivt heltal (mellem 1 og %(v)s)
fr: Le paramètre "limit" doit être un nombre entier positif (entre 1 et %(v)s)
nl: Limietparameter moet een geldig, positief geheel getal zijn (tussen 1 en %(v)s)
pt: O parâmetro limit deve ser um número inteiro positivo válido (entre 1 e %(v)s)
pt_br: O parâmetro limit deve ser um número inteiro positivo válido (entre 1 e %(v)s)

source: limit parameter should be an integer between 1 and %(v)s
be: Параметр limit павінен быць цэлым лікам паміж 1 і %(v)s
da: afgrænsningsparameter skal være et heltal mellem 1 og %(v)s
fr: Le paramètre "limit" doit être un nombre compris entre 1 et %(v)s
nl: De limietparameter moet een geheel getal zijn tussen 1 en %(v)s
pt: O parâmetro limit deve ser um número inteiro entre 1 e %(v)s
pt_br: O parâmetro limit deve ser um número inteiro entre 1 e %(v)s

source: longitude needs to be between -180 and 180
be: даўгата павінна быць паміж -180 і 180
da: længdegrad skal være mellem -180 og 180
fr: La longitude doit être comprise entre -180 et 180°
nl: De lengtegraad moet tussen -180 en 180 liggen
pt: longitude deve estar entre -180 e 180
pt_br: longitude deve estar entre -180 e 180

source: latitude needs to be between -90 and 90
be: шырата павінна быць паміж -90 і 90
da: breddegrad skal være mellem -90 og 90
fr: La latitude doit être comprise entre -90 et 90°
nl: De breedtegraad moet tussen -90 en 90 liggen
pt: latitude deve estar entre -90 e 90
pt_br: latitude deve estar entre -90 e 90

source: Tiles are not available for flat pictures
be: Тайлы недаступныя для плоскіх выяў
da: Fliser er ikke tilgængelige for flade billeder
fr: Les tuiles ne sont pas disponibles pour les photos classiques
nl: Tegels zijn niet beschikbaar voor platte afbeeldingen
pt: Os mosaicos não estão disponíveis para imagens planas
pt_br: Os mosaicos não estão disponíveis para imagens planas

source: Column parameter is invalid, should be an integer
be: Параметр column несапраўдны, павінен быць цэлым лікам
da: Kolonneparameter er ugyldig, skal være et heltal
fr: Le paramètre "column" est invalide, ce doit être un nombre entier
nl: Kolomparameter is ongeldig, moet een geheel getal zijn
pt: O parâmetro column é inválido, deve ser um número inteiro
pt_br: O parâmetro column está inválido, deve estar um número inteiro

source: Column parameter is invalid
be: Параметр column несапраўдны
da: Kolonneparameter er ugyldig
fr: Le paramètre "column" est invalide
nl: Kolomparameter is ongeldig
pt: O parâmetro column é inválido
pt_br: O parâmetro column está inválido

source: Row parameter is invalid, should be an integer
be: Параметр row несапраўдны, павінен быць цэлым лікам
da: Rækkeparameter er ugyldig, skal være et heltal
fr: Le paramètre "row" est invalide, ce doit être un nombre entier
nl: Rijparameter is ongeldig, moet een geheel getal zijn
pt: O parâmetro row é inválido, deve ser um número inteiro
pt_br: O parâmetro row está inválido, deve estar um número inteiro

source: Row parameter is invalid
be: Параметр row несапраўдны
da: Rækkeparameter er ugyldig
fr: Le paramètre "row" est invalide
nl: Rijparameter is ongeldig
pt: O parâmetro row é inválido
pt_br: O parâmetro row está inválido

source: Sequence "%(name)s" by "%(user)s" was captured on %(date)s.
be: Серыя "%(name)s" ад "%(user)s" была знятая %(date)s.
da: Sekvens "%(name)s" af "%(user)s" blev optaget %(date)s.
fr: La séquence "%(name)s" par "%(user)s" a été prise le %(date)s.
nl: Serie "%(name)s" door "%(user)s" werd vastgelegd op %(date)s.
pt: A sequência "%(name)s" por "%(user)s" foi capturada em %(date)s.
pt_br: A sequência "%(name)s" de "%(user)s" foi capturada em %(date)s.

source: View on the map
be: Паглядзець на карце
da: Vis på kortet
fr: Voir sur la carte
nl: Bekijk op de kaart
pt: Ver no mapa
pt_br: Ver no mapa

source: JSON metadata
be: JSON метаданы
fr: Métadonnées JSON
pt: Metadados JSON
pt_br: Metadados JSON

source: GeoVisio collections
be: Калекцыі GeoVisio
da: GeoVisio-samlinger
fr: Séquences GeoVisio
nl: Panoramax collecties
pt: Coleções GeoVisio
pt_br: Coleções GeoVisio

source: List of collections from this GeoVisio server
be: Спіс калекцый з гэтага GeoVisio сервера
da: Liste over samlinger fra denne GeoVisio-server
fr: Liste des séquences de cette instance GeoVisio
nl: Lijst met verzamelingen van deze Panoramax-server
pt: Lista de coleções deste servidor GeoVisio
pt_br: Lista das coleções deste servidor GeoVisio

source: Impossible to find token
be: Немагчыма знайсці токен
da: Umuligt at finde token
fr: Impossible de trouver le jeton
nl: Kan token niet vinden
pt: Impossível encontrar token
pt_br: Não foi possível encontrar token

source: Impossible to generate a new token
be: Немагчыма згенераваць новы токен
da: Umuligt at generere et nyt token
fr: Impossible de générer un nouveau jeton
nl: Kan geen nieuwe token genereren
pt: Impossível gerar um novo token
pt_br: Não é possível gerar um novo token

source: Token already claimed by another account
be: Токен ужо запатрабаваны іншым уліковым запісам
da: En anden konto har allerede gjort krav på tokenet
fr: Le jeton a déjà été associée à un autre compte utilisateur
nl: Token al geclaimd door een andere account
pt: Token já reclamado por outra conta
pt_br: Token já reivindicado por outra conta

source: Impossible to find user
be: Немагчыма знайсці карыстальніка
da: Umuligt at finde bruger
fr: Impossible de trouver l'utilisateur
nl: Kan gebruiker niet vinden
pt: Impossível encontrar o utilizador
pt_br: Não é possível encontrar o usuário

source: No search parameter given, you should provide `q=<pattern>` as query parameter
be: Параметр пошуку не зададзены, вы павінны прадаставіць `q=<pattern>` у якасці параметра запыту
da: Ingen søgeparameter angivet, du skal angive `q=<pattern>` som forespørgselsparameter
fr: Aucun paramètre de recherche fourni, vous devez renseigner `q=<motif>` comme valeur de recherche
nl: Geen zoekparameter opgegeven, je moet 'q=<parameter> ' opgeven als queryparameter
pt: Nenhum parâmetro de pesquisa fornecido, você deve fornecer `q=<padrão>` como parâmetro de consulta
pt_br: Nenhum parâmetro de pesquisa fornecido, você deve fornecer `q=<padrão>` como parâmetro de consulta

source: No default account defined, please contact your instance administrator
be: Ўліковы запіс па змаўчанні не вызначаны, калі ласка, звяжыцеся з адміністратарам вашай інстанцыі
da: Ingen standardkonto defineret, kontakt din instansadministrator
fr: Aucun compte par défaut défini, merci de contacter l'administrateur de votre instance
nl: Er is geen standaardaccount gedefinieerd, neem contact op met de beheerder van je instance
pt: Nenhuma conta padrão definida, entre em contacto com a administração da sua instância
pt_br: Nenhuma conta padrão definida. Entre em contato com a administraçáo da sua instância

source: The item has already been added to this upload set
be: Элемент ужо дададзены ў гэты набор загрузкі
da: Elementet er allerede tilføjet til dette upload-sæt
fr: L'item a déjà été ajouté à cet UploadSet
nl: Het item is al toegevoegd aan deze UploadSet
pt: O item já foi adicionado a este conjunto de uploads
pt_br: O item já foi adicionado a este conjunto de uploads

source: You're not authorized to add picture to this collection
be: Вы не аўтарызаваны дадаваць выявы ў гэтую калекцыю
da: Du er ikke autoriseret til at tilføje billeder til denne samling
fr: Vous n'avez pas la permission d'ajouter une photo dans cette séquence
nl: Het is niet toegestaan om foto's aan deze collectie toe te voegen
pt: Não está autorizado a adicionar imagens a esta coleção
pt_br: Você não tem permissão para adicionar uma imagem a esta coleção

source: The upload set is already completed, files cannot be pushed to it
fr: L'UploadSet est déjà complet, aucun fichier supplémentaire ne peut être ajouté

source: UploadSet {u} does not exist
fr: L'UploadSet {u} n'existe pas

source: Parameter for creating an UploadSet should be a valid JSON
be: Параметр для стварэння UploadSet павінен быць сапраўдным JSON
da: Parameter til oprettelse af et UploadSet skal være en gyldig JSON
fr: Le paramètre pour créer un UploadSet doit être un JSON valide
nl: Parameter voor het maken van een UploadSet moet een geldige JSON zijn
pt: O parâmetro para criar um UploadSet deve ser um JSON válido
pt_br: O parâmetro para a criação de um UploadSet deve estar um JSON válido

source: UploadSet doesn't exist
be: UploadSet не існуе
da: UploadSet findes ikke
fr: L'UploadSet n'existe pas
nl: UploadSet bestaat niet
pt: O UploadSet não existe
pt_br: O UploadSet não existe
