Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0-py3-none-any.whl/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: be, da, fr, nl, pt, pt_br

source: Simple 360° geolocated pictures hosting
be: Просты хостынг 360° геалагізаваных выяў
da: Enkel hosting af 360° geolokaliserede billeder
fr: Hébergement facile de photos géolocalisées
nl: Eenvoudige hosting van 360°-geolokaliseerde foto's
pt: Hospedagem simples de imagens geolocalizadas em 360°
pt_br: Hospedagem simples de fotos geolocalizadas em 360°

source: Full page version
be: Поўнаэкранная версія
da: Helside-version
fr: Version pleine page
nl: Volledige pagina
pt: Versão em página inteira
pt_br: Versão em página inteira

source: Viewer
be: Праглядальнік
da: Fremviser
fr: Visionneuse
pt: Visualizador
pt_br: Visualizador

source: Embed pre-configured viewer
be: Убудаваць папярэдне настроены праглядальнік
da: Indlejr forudkonfigureret fremviser
fr: Embarquer la visionneuse pré-configurée
nl: De gepreconfigureerde viewer insluiten
pt: Incorporar visualizador pré-configurado
pt_br: Incorporar visualizador pré-configurado

source: Easiest way to have a working GeoVisio viewer on your website
be: Найпрасцейшы спосаб мець працоўны GeoVisio праглядальнік на вашым сайце
da: Den nemmeste måde at få en fungerende GeoVisio-fremviser på din hjemmeside
fr: La méthode la plus simple pour embarquer la visionneuse GeoVisio sur votre site web
nl: Gemakkelijkste manier om een GeoVisio viewer op uw webpagina te plaatsen
pt: A maneira mais fácil de ter um visualizador GeoVisio funcional no seu site
pt_br: A maneira mais fácil de ter um visualizador GeoVisio funcionando em seu site

source: Use JS library
be: Выкарыстоўваць JS бібліятэку
da: Brug JS-bibliotek
fr: Utiliser la bibliothèque JS
nl: Gebruik JS bibliotheek
pt: Usar a biblioteca JS
pt_br: Usar biblioteca JS

source: A completely configurable viewer for your website
be: Поўнасцю настройвальны праглядальнік для вашага сайта
da: En fuldt konfigurerbar fremviser til din hjemmeside
fr: Une visionneuse entièrement configurable pour votre site web
nl: Een compleet configureerbare viewer voor uw website
pt: Um visualizador totalmente configurável para o seu site
pt_br: Um visualizador totalmente configurável para o seu site

source: Links
be: Спасылкі
fr: Liens

source: Pictures viewer
be: Праглядальнік выяў
da: Billedfremviser
fr: Visionneuse photos
nl: Foto viewer
pt: Visualizador de imagens
pt_br: Visualizador de imagens

source: API docs
be: Дакументацыя API
da: API-dokumentation
fr: Doc de l'API
nl: API documentatie
pt: Documentação da API
pt_br: Documentação da API

source: JS library docs
be: Дакументацыя JS бібліятэкі
da: JS-bibliotek dokumenter
fr: Doc de la bibliothèque JS
nl: JS bibliotheek documentatie
pt: Documentação da biblioteca JS
pt_br: Documentação da biblioteca JS

source: Repositories
be: Рэпазіторыі
da: Depoter
fr: Dépôts logiciels
nl: Archief
pt: Repositórios
pt_br: Repositórios

source: You need to enable JavaScript to run this app.
be: Для працы гэтай праграмы неабходна ўключыць JavaScript.
da: Du skal aktivere JavaScript for at køre denne app.
fr: Vous devez activer JavaScript pour exécuter cette application.
nl: U moet JavaScript toestaan om deze app te kunnen gebruiken.
pt: É necessário ativar o JavaScript para executar esta aplicação.
pt_br: Você precisa ativar JavaScript para executar este aplicativo.

source: Authentication is mandatory
be: Аўтэнтыфікацыя абавязковая
da: Autentifikation er obligatorisk
fr: L'authentification est obligatoire
nl: Authenticatie is verplicht
pt: Autenticação é obrigatória
pt_br: Autenticação é obrigatória

source: Only Bearer token are supported
be: Падтрымліваюцца толькі Bearer токены
da: Kun Bearer-token er understøttet
fr: Seul le « Bearer Token » est supporté
nl: Alleen bearer tokens worden ondersteund
pt: Apenas tokens Bearer são suportados
pt_br: Somente tokens Bearer são compatíveis

source: Invalid '%(format)s' format for image, only the following formats are available: %(allowed_formats)s
be: Несапраўдны фармат '%(format)s' для выявы, даступныя толькі наступныя фарматы: %(allowed_formats)s
da: Ugyldigt '%(format)s' format for billede, kun følgende formater er tilgængelige: %(allowed_formats)s
fr: Format d'image "%(format)s" invalide, seuls les formats suivants sont autorisés : %(allowed_formats)s
nl: Ongeldig %(format)s-formaat voor de afbeelding, alleen de volgende formaten zijn toegestaan: %(allowed_formats)s
pt: Formato '%(format)s' inválido para imagem, apenas os seguintes formatos estão disponíveis: %(allowed_formats)s
pt_br: Formato '%(format)s' inválido para imagem, apenas os seguintes formatos estão disponíveis: %(allowed_formats)s

source: Picture can't be found, you may check its ID
be: Выяву немагчыма знайсці, праверце яе ID
da: Billedet kan ikke findes, du kan tjekke dets ID
fr: Photo introuvable, vérifiez son identifiant
nl: Foto onvindbaar, verifieer haar identificator
pt: Não é possível encontrar a imagem, verifique o seu ID
pt_br: Não é possível encontrar a imagem, verifique o seu ID

source: Picture is not available (either hidden by admin or processing)
be: Выява недаступная (альбо схаваная адміністратарам, альбо ў працэсе апрацоўкі)
da: Billedet er ikke tilgængeligt (enten skjult af administrator eller under behandling)
fr: Photo non-disponible (soit cachée, soit en cours de traitement)
nl: Foto niet beschikbaar (ofwel verborgen, ofwel in behandeling)
pt: A imagem não está disponível (ocultada pela administração ou em processamento)
pt_br: Imagem não está disponível (ou oculta pela administração ou em processamento)

source: HD Picture file is not available
be: Высакаякасны файл выявы недаступны
da: HD-billedfil er ikke tilgængelig
fr: Fichier HD de la photo non disponible
nl: HD-bestand van de foto is niet beschikbaar
pt: O ficheiro de imagem HD não está disponível
pt_br: Arquivo de Imagem HD não está disponível

source: Picture derivates file are not available
be: Файлы вытворных выяў недаступныя
da: Fil med billedderivater er ikke tilgængelig
fr: Fichiers dérivés de la photo non disponibles
nl: Bestanden afgeleid van de foto niet beschikbaar
pt: O ficheiro derivado da imagem não está disponível
pt_br: Arquivo derivado da imagem não está disponível

source: Unable to read picture on filesystem
be: Немагчыма прачытаць выяву ў файлавай сістэме
da: Kan ikke læse billede på filsystem
fr: Lecture de la photo sur le système de fichiers impossible
nl: Lezen van foto op bestandssysteem onmogelijk
pt: Não é possível ler a imagem no sistema de ficheiros
pt_br: Não é possível ler a imagem do sistema de arquivos

source: Sort by file date is not possible on this sequence (no file date information available on pictures)
be: Сарціроўка па даце файла немагчымая для гэтай паслядоўнасці (на выявах адсутнічае інфармацыя пра дату файла)
da: Sortering efter fildato er ikke mulig på denne sekvens (ingen information om fildato tilgængelig på billeder)
fr: Tri par date de fichier indisponible sur cette séquence (pas d'info de date de fichier sur les photos)
nl: Sorteren op bestandsdatum is niet beschikbaar voor deze sequentie (geen bestandsdatum beschikbaar op de foto's)
pt: Não é possível ordenar por data do ficheiro nesta sequência (não há informações sobre a data do ficheiro disponíveis nas imagens)
pt_br: Ordenação por data de arquivo não é possível nesta sequência (não há informações sobre a data do arquivo disponíveis nas imagens)

source: Sort using %(sort)s is not possible on this sequence, picture %(pic)s is missing mandatory metadata
be: Сарціроўка з выкарыстаннем %(sort)s немагчымая для гэтай паслядоўнасці, выяве %(pic)s не хапае абавязковых метаданых
da: Sortering ved brug af %(sort)s er ikke mulig på denne sekvens, billede %(pic)s mangler obligatoriske metadata
fr: Tri par %(sort)s indisponible sur cette séquence, des attributs obligatoires sont manquants sur la photo %(pic)s
nl: Sorteren op %(sort)s is niet beschikbaar voor deze sequentie, foto %(pic)s ontbreekt verplichte metadata
pt: Não é possível ordenar usando %(sort)s nesta sequência, a imagem %(pic)s está sem os metadados obrigatórios
pt_br: Ordenação por %(sort)s não é possível nesta sequência, a imagem %(pic)s está sem os metadados obrigatórios

source: JWT token signature does not match
be: Подпіс JWT токена не супадае
da: JWT-token-signatur stemmer ikke overens
fr: La signature du jeton JWT ne correspond pas
nl: Handtekening van de JWT-token komt niet overeen
pt: A assinatura do token JWT não corresponde
pt_br: A assinatura do token JWT não corresponde

source: Token does not exist anymore
be: Токен больш не існуе
da: Token eksisterer ikke længere
fr: Jeton indisponible
nl: Token onbeschikbaar
pt: O token já não existe
pt_br: O token não existe mais

source: Token not yet claimed, this token cannot be used yet. Either claim this token or generate a new one
be: Токен яшчэ не запатрабаваны, яго яшчэ нельга выкарыстоўваць. Запатрабуйце гэты токен альбо згенерыруйце новы
da: Token endnu ikke gjort krav på, dette token kan ikke bruges endnu. Gør enten krav på dette token, eller generer et nyt
fr: Jeton pas encore réclamé, il ne peut pas être utilisé pour l'instant. Vous pouvez soit le réclamer (claim), soit en générer un nouveau
nl: Token nog niet geclaimd, dit token kan nog niet gebruikt worden. Claim dit token of genereer een nieuw
pt: Token ainda não reclamado, este token ainda não pode ser usado. Reclame este token ou gere um novo
pt_br: Token ainda não reivindicado, este token ainda não pode ser usado. Reivindique este token ou gere um novo

source: Impossible to finish authentication flow
be: Немагчыма завяршыць працэс аўтэнтыфікацыі
da: Umuligt at afslutte godkendelsesprocessen
fr: Impossible de finir le flux d'authentification
nl: Onmogelijk om de authenticatieflow te voltooiien
pt: Impossível concluir o fluxo de autenticação
pt_br: Não é possível finalizar o fluxo de autenticação

source: You can try to clear your cookies and retry. If the problem persists, contact your instance administrator.
be: Вы можаце паспрабаваць ачысціць кукі і паўтарыць спробу. Калі праблема застанецца, звяжыцеся з адміністратарам вашай інстанцыі.
da: Du kan prøve at rydde dine cookies og prøve igen. Hvis problemet fortsætter, skal du kontakte din instansadministrator.
fr: Vous pouvez tenter de supprimer vos cookies et réessayer. Si le problème persiste, contactez l'administrateur de votre instance.
nl: Je kan proberen je cookies te verwijderen en opnieuw te proberen. Als het probleem aanhoudt, contacteer dan de administrator van je instantie.
pt: Pode tentar limpar os cookies e tentar novamente. Se o problema persistir, contacte a administração da sua instância.
pt_br: Você pode tentar limpar seus cookies e tentar novamente. Se o problema persistir, entre em contato com a administração da sua instância.

source: There is no collection created after %(d)s
be: Няма калекцый, створаных пасля %(d)s
da: Der er ingen samling oprettet efter %(d)s
fr: Il n'y a pas de séquence créée après le %(d)s
nl: Er is geen sequentie gecreëerd na %(d)s
pt: Não há nenhuma coleção criada após %(d)s
pt_br: Não há nenhuma coleção criada após %(d)s

source: There is no collection created before %(d)s
be: Няма калекцый, створаных да %(d)s
da: Der er ingen samling oprettet før %(d)s
fr: Il n'y a pas de séquence créée avant le %(d)s
nl: Er is geen sequentie gecreëerd voor %(d)s
pt: Não há nenhuma coleção criada antes de %(d)s
pt_br: Não há nenhuma coleção criada antes de %(d)s

source: Collection doesn't exist
be: Калекцыя не існуе
da: Samling findes ikke
fr: La collection n'existe pas
nl: De collectie bestaat niet
pt: A coleção não existe
pt_br: A coleção não existe

source: Impossible to find a thumbnail for the collection
be: Немагчыма знайсці мініяцюру для калекцыі
da: Umuligt at finde et miniaturebillede til samlingen
fr: Impossible de trouver une miniature pour la séquence
nl: Onmogelijk om een thumbnail voor de sequentie te vinden
pt: Impossível encontrar uma miniatura para esta coleção
pt_br: Não é possível encontrar uma miniatura para esta coleção

source: Picture visibility parameter (visible) should be either unset, true or false
be: Параметр бачнасці выявы (visible) павінен быць unset, true або false
da: Billedets synlighedsparameter (synlig) skal enten være ikke-indstillet, sand eller falsk
fr: Le paramètre de visibilité de la photo ("visible") doit être soit vide, "true" ou "false"
nl: De parameter voor de zichtbaarheid van de foto (“visible”) moet ofwel niet ingesteld zijn, ofwel “true” of “false”
pt: O parâmetro de visibilidade da imagem (visible) deve ser não definido, true ou false
pt_br: O parâmetro da visibilidade da imagem (visible) deve estar não definido, true ou false

source: Sequence title is not valid, should be a string with a max of 250 characters
da: Sekvenstitel er ikke gyldig, skal være en streng med maks. 250 tegn
fr: Le titre de la séquence est invalide, ce doit être une chaîne de 250 caractères maximum

source: Sort order parameter is invalid
be: Параметр парадку сарціроўкі несапраўдны
da: Parameter for sorteringsrækkefølge er ugyldig
fr: Le paramètre d'ordre de tri est invalide
nl: De parameter voor de sorteervolgorde is ongeldig
pt: O parâmetro de ordem de ordenação é inválido
pt_br: O parâmetro de ordem da ordenação é inválido

source: Relative heading is not valid, should be an integer in degrees from -180 to 180
be: Адносны напрамак несапраўдны, павінен быць цэлым лікам у градусах ад -180 да 180
da: Relativ retning er ikke gyldig, skal være et heltal i grader fra -180 til 180
fr: L'orientation relative est invalide, ce doit être un nombre entier de -180 à 180 degrés
nl: De relatieve richting is ongeldig, moet een geheel getal tussen -180 en 180 graden zijn
pt: A direção relativa não é válida, deve ser um número inteiro em graus entre -180 e 180
pt_br: A direção relativa não é válida, deve ser um número inteiro em graus entre -180 e 180

source: Sequence %(c)s wasn't found in database
fr: La séquence %(c)s n'a pas été trouvée

source: You're not authorized to edit this sequence
da: Du er ikke autoriseret til at redigere denne sekvens
fr: Vous n'avez pas la permission de modifier cette séquence

source: Sequence %(c)s is in %(s)s state, its visibility can't be changed for now
be: Паслядоўнасць %(c)s знаходзіцца ў стане %(s)s, яе бачнасць цяпер нельга змяніць
da: Sekvens %(c)s er i %(s)s tilstand, dens synlighed kan ikke ændres på nuværende tidspunkt
fr: La séquence %(c)s est en état "%(s)s", sa visibilité ne peut pas être changée pour l'instant
nl: Sequentie %(c)s is in toestand “%(s)s”, de zichtbaarheid kan op dit moment niet aangepast worden
pt: A sequência %(c)s está no estado %(s)s, sua visibilidade não pode ser alterada no momento
pt_br: A sequência %(c)s está no estado %(s)s, sua visibilidade não pode ser alterada no momento

source: Collection %(c)s wasn't found in database
be: Калекцыя %(c)s не знойдзена ў базе даных
da: Samling %(c)s blev ikke fundet i database
fr: La séquence %(c)s n'a pas été trouvée en base
nl: Sequentie %(c)s werd niet gevonden in de database
pt: A coleção %(c)s não foi encontrada na base de dados
pt_br: Coleção %(c)s não foi encontrada no banco de dados

source: Impossible to find user %(u)s
be: Немагчыма знайсці карыстальніка %(u)s
da: Umuligt at finde bruger %(u)s
fr: Impossible de trouver l'utilisateur %(u)s
nl: Onmogelijk om gebruiker %(u)s te vinden
pt: Impossível encontrar o utilizador %(u)s
pt_br: Não é possível encontrar o usuário %(u)s

source: No data loaded for user %(u)s
be: Няма загружаных даных для карыстальніка %(u)s
da: Ingen data indlæst for bruger %(u)s
fr: Pas de données chargées pour l'utilisateur %(u)s
nl: Geen gegevens geladen voor gebruiker %(u)s
pt: Nenhuns dados carregados para o utilizador %(u)s
pt_br: Nenhuns dados carregados para o usuário %(u)s

source: No matching sequences found
be: Адпаведных паслядоўнасцей не знойдзена
da: Ingen matchende sekvenser fundet
fr: Aucune séquence correspondante trouvée
nl: Geen overeenkomende sequentie gevonden
pt: Nenhuma sequência correspondente encontrada
pt_br: Nenhuma sequência correspondente encontrada

source: limit parameter should be an integer between 1 and 10000
be: Параметр limit павінен быць цэлым лікам паміж 1 і 10000
da: afgrænsningsparameter skal være et heltal mellem 1 og 10000
fr: Le paramètre "limit" doit être un nombre entier compris entre 1 et 10000
nl: Limietparameter moet een geheel getal zijn tussen 1 en 10000
pt: O parâmetro limit deve ser um número inteiro entre 1 e 10000
pt_br: O parâmetro limit dever ser um número inteiro entre 1 e 10000

source: limit parameter should be a valid, positive integer (between 1 and 10000)
be: Параметр limit павінен быць сапраўдным станоўчым цэлым лікам (паміж 1 і 10000)
da: afgrænsningsparameter skal være et gyldigt, positivt heltal (mellem 1 og 10000)
fr: Le paramètre "limit" doit être un nombre entier valide (entre 1 et 10000)
nl: Limietparameter moet een geldig, positief geheel getal zijn (tussen 1 en 10000)
pt: O parâmetro limit deve ser um número inteiro positivo válido (entre 1 e 10000)
pt_br: O parâmetro limit deve ser um número inteiro positivo válido (entre 1 e 10000)

source: `startAfterRank` and `withPicture` are mutually exclusive parameters
be: `startAfterRank` і `withPicture` з'яўляюцца ўзаемавыключальнымі параметрамі
da: `startAfterRank` og `withPicture` er gensidigt udelukkende parametre
fr: Les paramètres `startAfterRank` et `withPicture` ne peuvent être utilisés ensemble
nl: Gebruik `startAfterRank` en `withPicture` afzonderlijk, niet gezamelijk
pt: `startAfterRank` e `withPicture` são parâmetros mutuamente exclusivos
pt_br: `startAfterRank` e `withPicture` são parâmetros mutuamente exclusivos

source: startAfterRank parameter should be a positive integer (starting from 1)
be: Параметр startAfterRank павінен быць станоўчым цэлым лікам (пачынаючы з 1)
da: startAfterRank parameteren skal være et positivt heltal (startende fra 1)
fr: Le paramètre "startAfterRank" doit être un nombre entier positif (supérieur ou égal à 1)
nl: De parameter `startAfterRank` moet een positief geheel getal zijn (beginnend bij 1)
pt: O parâmetro startAfterRank deve ser um número inteiro positivo (começando em 1)
pt_br: O parâmetro startAfterRank deve ser um número inteiro positivo (começando em 1)

source: startAfterRank parameter should be a valid, positive integer
be: Параметр startAfterRank павінен быць сапраўдным станоўчым цэлым лікам
da: startAfterRank parameteren skal være et gyldigt, positivt heltal
fr: Le paramètre "startAfterRank" doit être un nombre entier positif
nl: De parameter `startAfterRank` moet een geldig, positief geheel getal zijn
pt: O parâmetro startAfterRank deve ser um número inteiro positivo válido
pt_br: O parâmetro startAfterRank deve ser um número inteiro positivo válido

source: No more items in this collection (last available rank is %(r)s)
be: Больш няма элементаў у гэтай калекцыі (апошні даступны ранг %(r)s)
da: Ikke flere elementer i denne samling (sidste tilgængelige rang er %(r)s)
fr: Plus de photos dans cette séquence (dernier rang disponible : %(r)s)
nl: Geen items meer in deze collectie (laatst beschikbare rang is %(r)s)
pt: Não há mais itens nesta coleção (a última classificação disponível é %(r)s)
pt_br: Não há mais itens nesta coleção (a última classificação disponível é %(r)s)

source: Picture with id %(p)s does not exist
be: Выява з id %(p)s не існуе
da: Billede med id %(p)s findes ikke
fr: La photo avec l'ID %(p)s n'existe pas
nl: Afbeelding met id %(p)s bestaat niet
pt: A imagem com ID %(p)s não existe
pt_br: A imagem com ID %(p)s não existe

source: Item doesn't exist
be: Элемент не існуе
da: Element findes ikke
fr: Cet élément n'existe pas
nl: Item bestaat niet
pt: O item não existe
pt_br: O item não existe

source: Search using POST method should have a JSON body
be: Пошук з выкарыстаннем метаду POST павінен мець JSON цела
da: Søgning med POST-metoden skal have en JSON-body
fr: La recherche par méthode POST doit avoir un corps de requête en JSON
nl: Zoeken met de POST-methode moet een JSON-body hebben
pt: A pesquisa utilizando o método POST deve ter um corpo JSON
pt_br: A pesquisa usando o método POST deve ter um corpo JSON

source: Parameter limit must be either empty or a number between 1 and 10000
be: Параметр limit павінен быць альбо пустым, альбо лікам паміж 1 і 10000
da: Parametergrænsen skal enten være tom eller et tal mellem 1 og 10000
fr: Le paramètre "limit" doit être soit vide, soit un nombre entre 1 et 10000
nl: De parameterlimiet moet leeg zijn of een getal tussen 1 en 10000
pt: O parâmetro limit deve ser ou vazio ou um número entre 1 e 10000
pt_br: O parâmetro limit deve ser ou vazio ou um número entre 1 e 10000

source: Parameter place_fov_tolerance must be either empty or a number between 2 and 180
be: Параметр place_fov_tolerance павінен быць альбо пустым, альбо лікам паміж 2 і 180
da: Parameteren place_fov_tolerance skal enten være tom eller et tal mellem 2 og 180
fr: Le paramètre "place_fov_tolerance" doit être soit vide, soit un nombre compris entre 2 et 180
nl: Parameter place_fov_tolerance moet leeg zijn of een getal tussen 2 en 180
pt: O parâmetro place_fov_tolerance deve ser ou vazio ou um número entre 2 e 180
pt_br: O parâmetro place_fov_tolerance deve ser ou vazio ou um número entre 2 e 180

source: Parameter intersects should contain a valid GeoJSON Geometry (not a Feature)
be: Параметр intersects павінен утрымліваць сапраўдную GeoJSON Geometry (не Feature)
da: Parameteren intersects skal indeholde en gyldig GeoJSON-geometri (ikke en feature)
fr: Le paramètre "intersects" doit contenir une géométrie GeoJSON valide (pas une "Feature")
nl: Parameter “kruisingen” moet een geldige GeoJSON-geometrie bevatten (geen eigenschap)
pt: O parâmetro intersects deve conter uma Geometry GeoJSON válida (não um Feature)
pt_br: O parâmetro intersects deve conter uma Geometry GeoJSON válida (não um Feature)

source: Parameter ids should be a JSON array of strings
be: Параметр ids павінен быць JSON масівам радкоў
da: Parameter-id'er skal være et JSON-array af strenge
fr: Le paramètres "ids" doit être une liste JSON de chaînes de caractères
nl: Parameter-id's moeten een JSON-matrix van tekenreeksen zijn
pt: O parâmetro ids deve ser um arranjo JSON de cadeias de caracteres
pt_br: O parâmetro ids deve ser um arranjo JSON de cadeias de caracteres

source: Parameter collections should be a JSON array of strings
be: Параметр collections павінен быць JSON масівам радкоў
da: Parametersamlinger skal være et JSON-array af strenge
fr: Le paramètre "collections" doit être une liste JSON de chaînes de caractères
nl: Parameterverzamelingen moeten een JSON-serie van tekenreeksen zijn
pt: O parâmetro collections deve ser um arranjo de cadeias de caracteres
pt_br: O parâmetro collections deve ser um arranjo JSON de cadeias de caracteres

source: Picture doesn't exist
be: Выява не існуе
da: Billede findes ikke
fr: La photo n'existe pas
nl: Afbeelding bestaat niet
pt: A imagem não existe
pt_br: A imagem não existe

source: Content type should be multipart/form-data
be: Content type павінен быць multipart/form-data
da: Indholdstypen skal være multipart/form-data
fr: Le type de contenu ("Content-type") doit être "multipart/form-data"
nl: Het content-type moet 'multipart/form-data' zijn
pt: O Content type deve ser multipart/form-data
pt_br: O Content type deve ser multipart/form-data

source: Missing "position" parameter
be: Адсутнічае параметр "position"
da: Manglende "position"-parameter
fr: Paramètre "position" manquant
nl: Ontbrekende parameter "positie"
pt: Parâmetro "position" ausente
pt_br: Parâmetro "position" ausente
