Repository: pypi-data/pypi-mirror-396
Catalog: packages/interaktiv.aiclient/interaktiv_aiclient-1.0.0.tar.gz/interaktiv_aiclient-1.0.0/src/interaktiv/aiclient/locales/*/LC_MESSAGES/interaktiv.aiclient.po
Languages: de

source: AI Client
de: KI-Client

source: AI Client Settings
de: KI-Client Einstellungen

source: API Key used to connect to OpenRouter
de: API Schlüssel zur Verbindung mit OpenRouter

source: Could not retrieve models from OpenRouter API. Please try again later.
de: Modelle konnten nicht von der OpenRouter API abgerufen werden. Bitte versuche es später erneut.

source: Failed to initialise AI Client.
de: Der KI-Client konnte nicht initialisiert werden.

source: Installs the interaktiv.aiclient add-on.
de: Installiert die interaktiv.aiclient Erweiterung.

source: Interaktiv AI Client: Install
de: Interaktiv KI-Client: Installieren

source: Interaktiv AI Client: Uninstall
de: Interaktiv KI-Client: Deinstallieren

source: No API Key provided.
de: Es wurde kein API Schlüssel angegeben.

source: No API URL provided.
de: Es wurde keine API URL angegeben.

source: No model selected.
de: Es wurde kein Modell ausgewählt.

source: OpenRouter API Key
de: OpenRouter API Schlüssel

source: OpenRouter model
de: OpenRouter Modell

source: Select the model you want to use for the AI Client.
de: Wähle das Modell aus, welches für den KI-Client verwendet werden soll.

source: The selected model is no longer available. Please choose another one from the list.
de: Das ausgewählte Modell ist nicht mehr verfügbar. Bitte wähle ein anderes aus der Liste.

source: Uninstalls the interaktiv.aiclient add-on.
de: Deinstalliert die interaktiv.aiclient Erweiterung.
