Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/augmentation.po
Languages: es, ja, zh_cn

source: Data augmentation methods for spectral analysis. These methods add controlled variation to your data to simulate different real-world scenarios and improve model robustness.
es: Métodos de aumento de datos para análisis espectral. Estos métodos añaden variación controlada a tus datos para simular diferentes escenarios del mundo real y mejorar la robustez del modelo.
ja: スペクトル分析のためのデータ拡張手法。これらの手法は、さまざまな実世界のシナリオをシミュレートし、モデルの堅牢性を向上させるために、データに制御された変動を追加します。
zh_cn: 光谱分析的数据增强方法。这些方法为您的数据添加受控变化，以模拟不同的真实场景并提高模型的鲁棒性。

source: **Import from this module:**
es: **Importar desde este módulo:**
ja: このモジュールからのインポート:
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
ja: 利用可能なクラス
zh_cn: 可用类

source: Class
es: Clase
ja: クラス
zh_cn: 类

source: Description
es: Descripción
ja: 説明
zh_cn: 描述

source: Add random noise to spectra
es: Añadir ruido aleatorio a los espectros
ja: スペクトルにランダムノイズを追加
zh_cn: 向光谱添加随机噪声

source: Shift baseline by a constant value
es: Desplazar la línea base por un valor constante
ja: ベースラインを定数値でシフト
zh_cn: 通过常数值偏移基线

source: Apply fractional wavelength shifts
es: Aplicar desplazamientos fraccionarios de longitud de onda
ja: 波長の分数シフトを適用
zh_cn: 应用分数波长偏移

source: Broaden peaks with Gaussian kernel
es: Ensanchar picos con núcleo gaussiano
ja: ガウシアンカーネルでピークを広げる
zh_cn: 使用高斯核展宽峰

source: Shift spectra by index positions
es: Desplazar espectros por posiciones de índice
ja: インデックス位置でスペクトルをシフト
zh_cn: 按索引位置偏移光谱

source: Scale spectrum intensity
es: Escalar la intensidad del espectro
ja: スペクトル強度をスケーリング
zh_cn: 缩放光谱强度

source: See Also
es: Ver también
ja: 関連項目
zh_cn: 另请参阅

source: :doc:`Augmentation Methods Overview </methods/augmentation>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de aumento de datos </methods/augmentation>` - Documentación completa con ejemplos y guías visuales
ja: :doc:`データ拡張手法の概要 </methods/augmentation>` - 例とビジュアルガイドを含む完全なドキュメント
zh_cn: :doc:`数据增强方法概述 </methods/augmentation>` - 包含示例和可视化指南的完整文档
