Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/baseline.po
Languages: es, ja, zh_cn

source: Baseline correction methods for spectral preprocessing. These methods remove baseline drift and offset to isolate the chemical signal.
es: Métodos de corrección de línea base para preprocesamiento espectral. Estos métodos eliminan la deriva y el desplazamiento de la línea base para aislar la señal química.
ja: スペクトル前処理のためのベースライン補正手法。これらの手法は、化学シグナルを分離するためにベースラインドリフトとオフセットを除去します。
zh_cn: 光谱预处理的基线校正方法。这些方法可以去除基线漂移和偏移，以分离化学信号。

source: **Import from this module:**
es: **Importar desde este módulo:**
ja: このモジュールからのインポート:
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
ja: 利用可能なクラス
zh_cn: 可用类

source: Class
es: Clase
ja: クラス
zh_cn: 类

source: Description
es: Descripción
ja: 説明
zh_cn: 描述

source: Adaptive iteratively reweighted penalized least squares
es: Mínimos cuadrados penalizados reponderados iterativamente adaptativos
ja: 適応的反復再重み付けペナルティ付き最小二乗法
zh_cn: 自适应迭代加权惩罚最小二乘法

source: Asymmetrically reweighted penalized least squares
es: Mínimos cuadrados penalizados reponderados asimétricamente
ja: 非対称再重み付けペナルティ付き最小二乗法
zh_cn: 非对称加权惩罚最小二乘法

source: Asymmetric least squares smoothing
es: Suavizado de mínimos cuadrados asimétricos
ja: 非対称最小二乗平滑化
zh_cn: 非对称最小二乘平滑

source: Subtract a constant baseline value
es: Restar un valor constante de línea base
ja: 定数ベースライン値を減算
zh_cn: 减去常数基线值

source: Fit and subtract cubic spline baseline
es: Ajustar y restar línea base de spline cúbico
ja: 3次スプラインベースラインをフィットして減算
zh_cn: 拟合并减去三次样条基线

source: Linear baseline correction
es: Corrección de línea base lineal
ja: 線形ベースライン補正
zh_cn: 线性基线校正

source: Enforce non-negative values
es: Forzar valores no negativos
ja: 非負値を強制
zh_cn: 强制非负值

source: Polynomial baseline fitting and subtraction
es: Ajuste y sustracción de línea base polinómica
ja: 多項式ベースラインのフィッティングと減算
zh_cn: 多项式基线拟合和减法

source: Subtract a reference spectrum
es: Restar un espectro de referencia
ja: 参照スペクトルを減算
zh_cn: 减去参考光谱

source: See Also
es: Ver también
ja: 関連項目
zh_cn: 另请参阅

source: :doc:`Baseline Methods Overview </methods/baseline>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de línea base </methods/baseline>` - Documentación completa con ejemplos y guías visuales
ja: :doc:`ベースライン手法の概要 </methods/baseline>` - 例とビジュアルガイドを含む完全なドキュメント
zh_cn: :doc:`基线方法概述 </methods/baseline>` - 包含示例和可视化指南的完整文档
