Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/feature_selection.po
Languages: es, ja, zh_cn

source: Feature selection methods to identify the most chemically relevant wavelengths or variables for your models.
es: Métodos de selección de características para identificar las longitudes de onda o variables químicamente más relevantes para tus modelos.
ja: モデルにとって化学的に最も関連性の高い波長や変数を特定するための特徴選択手法。
zh_cn: 特征选择方法，用于识别模型中最具化学相关性的波长或变量。

source: **Import from this module:**
es: **Importar desde este módulo:**
ja: このモジュールからのインポート:
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
ja: 利用可能なクラス
zh_cn: 可用类

source: Class
es: Clase
ja: クラス
zh_cn: 类

source: Description
es: Descripción
ja: 説明
zh_cn: 描述

source: Select features by specific indices
es: Seleccionar características por índices específicos
ja: 特定のインデックスで特徴を選択
zh_cn: 按特定索引选择特征

source: Select features within a specified range
es: Seleccionar características dentro de un rango especificado
ja: 指定された範囲内の特徴を選択
zh_cn: 选择指定范围内的特征

source: Selectivity ratio based feature selection
es: Selección de características basada en ratio de selectividad
ja: 選択比に基づく特徴選択
zh_cn: 基于选择性比率的特征选择

source: Variable importance in projection (VIP) selector
es: Selector de importancia de variable en proyección (VIP)
ja: 射影における変数重要度（VIP）セレクタ
zh_cn: 投影变量重要性(VIP)选择器

source: See Also
es: Ver también
ja: 関連項目
zh_cn: 另请参阅

source: :doc:`Feature Selection Methods Overview </methods/feature_selection>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de selección de características </methods/feature_selection>` - Documentación completa con ejemplos y guías visuales
ja: :doc:`特徴選択手法の概要 </methods/feature_selection>` - 例とビジュアルガイドを含む完全なドキュメント
zh_cn: :doc:`特征选择方法概述 </methods/feature_selection>` - 包含示例和可视化指南的完整文档
