Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/index.po
Languages: es, ja

source: Augmentation
es: Aumento de datos
ja: データ拡張

source: Baseline
es: Corrección de línea base
ja: ベースライン補正

source: Derivative
es: Derivadas
ja: 微分

source: Feature Selection
es: Selección de características
ja: 特徴選択

source: Outliers
es: Valores atípicos
ja: 外れ値検出

source: Scale
es: Escalado
ja: スケーリング

source: Scatter
es: Corrección de dispersión
ja: 散乱補正

source: Smooth
es: Suavizado
ja: 平滑化

source: Utilities
es: Utilidades
ja: ユーティリティ

source: Core Modules
es: Módulos principales
ja: コアモジュール

source: API Reference
es: Referencia de la API
ja: API リファレンス

source: The public Python API for ``chemotools``. This section provides a technical reference for all importable modules and classes.
es: La API pública de Python para ``chemotools``. Esta sección proporciona una referencia técnica para todos los módulos y clases importables.
ja: ``chemotools`` のパブリック Python API。このセクションでは、すべてのインポート可能なモジュールとクラスの技術的なリファレンスを提供します。

source: For detailed documentation with examples and visual guides, see the :doc:`Methods </methods/index>` section.
es: Para documentación detallada con ejemplos y guías visuales, consulte la sección :doc:`Métodos </methods/index>`.
ja: 例やビジュアルガイドを含む詳細なドキュメントについては、 :doc:`Methods </methods/index>` セクションを参照してください。

source: Quick Import Reference
es: Referencia rápida de importación
ja: クイックインポートリファレンス

source: All classes can be imported directly from their respective modules:
es: Todas las clases se pueden importar directamente desde sus respectivos módulos:
ja: すべてのクラスは、それぞれのモジュールから直接インポートできます:
