Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/outliers.po
Languages: es, ja, zh_cn

source: Outlier detection methods to identify unusual samples and improve model diagnostics.
es: Métodos de detección de valores atípicos para identificar muestras inusuales y mejorar el diagnóstico del modelo.
ja: 異常なサンプルを特定し、モデル診断を改善するための外れ値検出手法。
zh_cn: 异常值检测方法，用于识别异常样本并改进模型诊断。

source: **Import from this module:**
es: **Importar desde este módulo:**
ja: このモジュールからのインポート:
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
ja: 利用可能なクラス
zh_cn: 可用类

source: Class
es: Clase
ja: クラス
zh_cn: 类

source: Description
es: Descripción
ja: 説明
zh_cn: 描述

source: Distance to model in X-space
es: Distancia al modelo en el espacio X
ja: X 空間におけるモデルからの距離
zh_cn: X空间中到模型的距离

source: Hotelling's T² statistic for multivariate outliers
es: Estadístico T² de Hotelling para valores atípicos multivariantes
ja: 多変量外れ値のための Hotelling T² 統計量
zh_cn: 用于多元异常值的Hotelling T²统计量

source: Leverage values for influential point detection
es: Valores de apalancamiento para detección de puntos influyentes
ja: 影響力のある点の検出のためのレバレッジ値
zh_cn: 用于影响点检测的杠杆值

source: Q residuals (squared prediction error)
es: Residuos Q (error de predicción cuadrado)
ja: Q 残差（二乗予測誤差）
zh_cn: Q残差（平方预测误差）

source: Studentized residuals for regression outliers
es: Residuos estudentizados para valores atípicos de regresión
ja: 回帰外れ値のためのスチューデント化残差
zh_cn: 用于回归异常值的学生化残差

source: See Also
es: Ver también
ja: 関連項目
zh_cn: 另请参阅

source: :doc:`Outlier Detection Methods Overview </methods/outliers>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de detección de valores atípicos </methods/outliers>` - Documentación completa con ejemplos y guías visuales
ja: :doc:`外れ値検出手法の概要 </methods/outliers>` - 例とビジュアルガイドを含む完全なドキュメント
zh_cn: :doc:`异常值检测方法概述 </methods/outliers>` - 包含示例和可视化指南的完整文档
