Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/scale.po
Languages: es, ja, zh_cn

source: Scaling methods to normalize spectral intensity and improve model performance.
es: Métodos de escalado para normalizar la intensidad espectral y mejorar el rendimiento del modelo.
ja: スペクトル強度を正規化し、モデル性能を向上させるためのスケーリング手法。
zh_cn: 缩放方法，用于归一化光谱强度并提高模型性能。

source: **Import from this module:**
es: **Importar desde este módulo:**
ja: このモジュールからのインポート:
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
ja: 利用可能なクラス
zh_cn: 可用类

source: Class
es: Clase
ja: クラス
zh_cn: 类

source: Description
es: Descripción
ja: 説明
zh_cn: 描述

source: Scale features to a given range (min-max normalization)
es: Escalar características a un rango dado (normalización min-max)
ja: 特徴を指定された範囲にスケーリング（最小最大正規化）
zh_cn: 将特征缩放到给定范围（最小-最大归一化）

source: Scale by vector norm (L1, L2, or max)
es: Escalar por norma vectorial (L1, L2, o máximo)
ja: ベクトルノルムでスケーリング（L1、L2、または最大値）
zh_cn: 按向量范数缩放（L1、L2或最大值）

source: Scale relative to a specific point in the spectrum
es: Escalar relativo a un punto específico en el espectro
ja: スペクトル内の特定の点を基準にスケーリング
zh_cn: 相对于光谱中特定点进行缩放

source: See Also
es: Ver también
ja: 関連項目
zh_cn: 另请参阅

source: :doc:`Scale Methods Overview </methods/scale>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de escalado </methods/scale>` - Documentación completa con ejemplos y guías visuales
ja: :doc:`スケーリング手法の概要 </methods/scale>` - 例とビジュアルガイドを含む完全なドキュメント
zh_cn: :doc:`缩放方法概述 </methods/scale>` - 包含示例和可视化指南的完整文档
