Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/scatter.po
Languages: es, ja, zh_cn

source: Scatter correction methods to remove multiplicative scatter effects and physical variations in spectral data.
es: Métodos de corrección de dispersión para eliminar efectos de dispersión multiplicativa y variaciones físicas en datos espectrales.
ja: スペクトルデータから乗法散乱効果と物理的変動を除去するための散乱補正手法。
zh_cn: 散射校正方法，用于去除光谱数据中的乘性散射效应和物理变化。

source: **Import from this module:**
es: **Importar desde este módulo:**
ja: このモジュールからのインポート:
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
ja: 利用可能なクラス
zh_cn: 可用类

source: Class
es: Clase
ja: クラス
zh_cn: 类

source: Description
es: Descripción
ja: 説明
zh_cn: 描述

source: EMSC with polynomial baseline correction
es: EMSC con corrección de línea base polinómica
ja: 多項式ベースライン補正を伴う EMSC
zh_cn: 带多项式基线校正的EMSC

source: Classic MSC algorithm
es: Algoritmo MSC clásico
ja: 古典的な MSC アルゴリズム
zh_cn: 经典MSC算法

source: RNV using median and MAD for robustness
es: RNV usando mediana y MAD para robustez
ja: ロバスト性のために中央値と MAD を使用する RNV
zh_cn: 使用中位数和MAD的RNV以提高鲁棒性

source: SNV using mean and standard deviation
es: SNV usando media y desviación estándar
ja: 平均と標準偏差を使用する SNV
zh_cn: 使用均值和标准差的SNV

source: See Also
es: Ver también
ja: 関連項目
zh_cn: 另请参阅

source: :doc:`Scatter Correction Methods Overview </methods/scatter>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de corrección de dispersión </methods/scatter>` - Documentación completa con ejemplos y guías visuales
ja: :doc:`散乱補正手法の概要 </methods/scatter>` - 例とビジュアルガイドを含む完全なドキュメント
zh_cn: :doc:`散射校正方法概述 </methods/scatter>` - 包含示例和可视化指南的完整文档
