Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/api/smooth.po
Languages: es, zh_cn

source: Smoothing methods to reduce noise while preserving spectral features.
es: Métodos de suavizado para reducir ruido mientras se preservan las características espectrales.
zh_cn: 平滑方法，在保留光谱特征的同时减少噪声。

source: **Import from this module:**
es: **Importar desde este módulo:**
zh_cn: **从此模块导入：**

source: Available Classes
es: Clases disponibles
zh_cn: 可用类

source: Class
es: Clase
zh_cn: 类

source: Description
es: Descripción
zh_cn: 描述

source: Moving average smoothing
es: Suavizado de media móvil
zh_cn: 移动平均平滑

source: Median filter for noise reduction
es: Filtro de mediana para reducción de ruido
zh_cn: 用于降噪的中值滤波器

source: Savitzky-Golay smoothing filter
es: Filtro de suavizado de Savitzky-Golay
zh_cn: Savitzky-Golay平滑滤波器

source: Whittaker smoothing with penalized least squares
es: Suavizado de Whittaker con mínimos cuadrados penalizados
zh_cn: 带惩罚最小二乘法的Whittaker平滑

source: See Also
es: Ver también
zh_cn: 另请参阅

source: :doc:`Smoothing Methods Overview </methods/smooth>` - Complete documentation with examples and visual guides
es: :doc:`Resumen de métodos de suavizado </methods/smooth>` - Documentación completa con ejemplos y guías visuales
zh_cn: :doc:`平滑方法概述 </methods/smooth>` - 包含示例和可视化指南的完整文档
