# name: get_timescale_age()
# Get time scale ages
PREFIX gts: <http://resource.geosciml.org/ontology/timescale/gts#>

SELECT *
WHERE {
    ?a a gts:Age .
}
ORDER BY ?a
LIMIT 3

# name: get_by_predicate
# Get time scale ages
PREFIX gts: <http://resource.geosciml.org/ontology/timescale/gts#>

SELECT *
WHERE {
    ?a a :predicate .
}
ORDER BY ?a
LIMIT 3

# name: get_by_predicate_bis(predicate)
# Get time scale ages
PREFIX gts: <http://resource.geosciml.org/ontology/timescale/gts#>

SELECT *
WHERE {
    ?a a :predicate .
}
ORDER BY ?a
LIMIT 3


# name: get_all_predicate()
# Get all predicate
SELECT DISTINCT ?predicate
WHERE {
    ?subject ?predicate ?object .
}
LIMIT 3

# name: get_subject_by_predicate(predicate)
# Get all subject of a given predicate

SELECT DISTINCT ?subject
WHERE {
      ?subject :predicate ?object .
}
