Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/user/user.po
Languages: es

source: Quick start
es: Inicio rápido

source: Check the `installation guide <../user/install.html>`_ to get started.
es: Consulta la `guía de instalación <../user/install.html>`_ para comenzar.

source: **New in chemometrics?** Learn through our step-by-step `tutorials page <../learn/index.html>`_.
es: **¿Nuevo en quimiometría?** Aprende con nuestra `página de tutoriales <../learn/index.html>`_ paso a paso.

source: **Want to explore the tools at your fingertips?** Visit the `explore overview <../explore/index.html>`_.
es: **¿Quieres explorar las herramientas a tu alcance?** Visita la `descripción general de exploración <../explore/index.html>`_.

source: Load data
es: Cargar datos

source: This loads a training set of mid infrared spectra (``X_train``) and associated reference values (``y_train``) from a fermentation process.
es: Esto carga un conjunto de entrenamiento de espectros infrarrojos medios (``X_train``) y valores de referencia asociados (``y_train``) de un proceso de fermentación.

source: **Looking for available datasets?** See the `datasets catalog <../learn/datasets.html>`_.
es: **¿Buscas conjuntos de datos disponibles?** Consulta el `catálogo de conjuntos de datos <../learn/datasets.html>`_.

source: Preprocess spectra
es: Preprocesar espectros

source: Load, define and apply preprocessing steps to the training data. Here we use a Savitzky-Golay filter to compute the first derivative of the sample spectra.
es: Carga, define y aplica pasos de preprocesamiento a los datos de entrenamiento. Aquí usamos un filtro de Savitzky-Golay para calcular la primera derivada de los espectros de muestra.

source: **Want to know more about preprocessing methods?** Read the `methods index <../methods/index.html>`_.
es: **¿Quieres saber más sobre métodos de preprocesamiento?** Lee el `índice de métodos <../methods/index.html>`_.

source: Build a pipeline
es: Construir un pipeline

source: Combine preprocessing and modelling steps in a single pipeline.
es: Combina pasos de preprocesamiento y modelado en un solo pipeline.

source: **Want to know more about pipelines?** Open the `pipelines article <../explore/pipelines.html>`_.
es: **¿Quieres saber más sobre pipelines?** Abre el `artículo de pipelines <../explore/pipelines.html>`_.

source: **Curious about model optimization?** Read the `optimization guide <../explore/optimize.html>`_.
es: **¿Curioso sobre la optimización de modelos?** Lee la `guía de optimización <../explore/optimize.html>`_.

source: **Congratulations!** You have just built your first chemotools workflow in Python 🎯
es: **¡Felicidades!** Acabas de construir tu primer flujo de trabajo de chemotools en Python 🎯
