Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/user/what_*_chemotools.po
Languages: es, ja, zh_cn

source: What is chemotools?
es: ¿Qué es chemotools?
ja: chemotoolsとは？
zh_cn: 什么是 chemotools？

source: ``chemotools`` is an open-source Python package for spectral preprocessing and chemometric modelling. It integrates directly with the ``scikit-learn`` ecosystem, enabling reproducible and scalable development of spectroscopic models.
es: ``chemotools`` es un paquete de Python de código abierto para preprocesamiento espectral y modelado quimiométrico. Se integra directamente con el ecosistema de ``scikit-learn``, permitiendo el desarrollo reproducible y escalable de modelos espectroscópicos.
ja: ``chemotools`` は、スペクトル前処理とケモメトリクスモデリングのためのオープンソースのPythonパッケージです。``scikit-learn`` エコシステムと直接統合されており、再現可能でスケーラブルな分光モデルの開発を可能にします。
zh_cn: ``chemotools`` 是一个用于光谱预处理和化学计量学建模的开源 Python 包。它直接与 ``scikit-learn`` 生态系统集成，支持可重现且可扩展的光谱模型开发。

source: **Extensive toolkit:** transformers for diverse spectroscopic data.
es: **Kit de herramientas extenso:** transformadores para datos espectroscópicos diversos.
ja: 豊富なツールキット：多様な分光データ用のトランスフォーマー。
zh_cn: 丰富的工具集： 适用于各类光谱数据的转换器。

source: **Composable and scalable:** pipelines that integrate directly and grow with your workflow.
es: **Componible y escalable:** pipelines que se integran directamente y crecen con tu flujo de trabajo.
ja: 組み合わせ可能でスケーラブル：直接統合され、ワークフローとともに成長するパイプライン。
zh_cn: 可组合且可扩展：可直接集成并能随您工作流程发展的管道。

source: **Reliable and transparent:** rigorously tested, peer-reviewed, and open.
es: **Confiable y transparente:** rigurosamente probado, revisado por pares y abierto.
ja: 信頼性と透明性：厳密にテストされ、査読を受けた、オープンなツール。
zh_cn: 可靠且透明： 经过严格测试、同行评审并且开源。

source: Build exactly what you need, integrate with the tools you trust, and scale without compromise.
es: Construye exactamente lo que necesitas, integra con las herramientas en las que confías y escala sin compromisos.
ja: 必要なものを正確に構築し、信頼できるツールと統合し、妥協することなくスケールします。
zh_cn: 构建您所需，集成您所信，扩展无妥协。

source: Composable building blocks / lifecycle
es: Bloques de construcción componibles / ciclo de vida
ja: 組み合わせ可能な構成要素 / ライフサイクル
zh_cn: 可组合的构建模块 / 生命周期

source: **Curious about scikit-learn?** See the dedicated `scikit-learn overview <../explore/sklearn.html>`_.
es: **¿Curioso sobre scikit-learn?** Consulta la `descripción general de scikit-learn <../explore/sklearn.html>`_.
ja: ``scikit-learn`` について詳しく知りたいですか？ 専用の `scikit-learn <../explore/sklearn.html>`_ 概要をご覧ください。

source: Extensive Toolkit
es: Kit de herramientas extenso
ja: 豊富なツールキット
zh_cn: 丰富的工具集

source: Spectroscopy is diverse — different **instruments**, **sample matrices**, and **analysis goals** demand different approaches. ``chemotools`` provides a **focused set of transformers** for spectroscopic data and makes it simple to assemble them into **preprocessing pipelines**. By connecting to the wider **Python ecosystem**, you can leverage **state-of-the-art machine learning** and **scientific libraries** to build **robust, end-to-end spectroscopic models**.
es: La espectroscopía es diversa — diferentes **instrumentos**, **matrices de muestras** y **objetivos de análisis** exigen diferentes enfoques. ``chemotools`` proporciona un **conjunto enfocado de transformadores** para datos espectroscópicos y hace simple ensamblarlos en **pipelines de preprocesamiento**. Al conectar con el **ecosistema de Python** más amplio, puedes aprovechar **aprendizaje automático de última generación** y **bibliotecas científicas** para construir **modelos espectroscópicos robustos de extremo a extremo**.
ja: 分光法は多様です。異なる機器、サンプルマトリックス、分析目標には、それぞれ異なるアプローチが必要です。``chemotools`` は、分光データ用の焦点を絞ったトランスフォーマーセットを提供し、それらを前処理パイプラインに簡単に組み立てることができます。より広範なPythonエコシステムと接続することで、最先端の機械学習と科学ライブラリを活用して、堅牢なエンドツーエンドの分光モデルを構築できます。
zh_cn: 光谱学是多样化的——不同的仪器、样品基质和分析目标需要不同的方法。``chemotools`` 为光谱数据提供了一套专注的转换器，并使将它们组装成预处理管道变得简单。通过连接到更广泛的 Python 生态系统，您可以利用先进的机器学习和科学库来构建稳健的端到端光谱模型。

source: Ecosystem: chemotools with sklearn, numpy and friends
es: Ecosistema: chemotools con sklearn, numpy y amigos
ja: エコシステム：chemotoolsとscikit-learn、numpy、その他のライブラリ
zh_cn: 生态系统：chemotools 与 sklearn、numpy 及其伙伴们

source: Connect your preprocessing with the ``scikit-learn`` ecosystem to unlock a wide toolstack for feature selection, model tuning, validation, and deployment.
es: Conecta tu preprocesamiento con el ecosistema de ``scikit-learn`` para desbloquear un amplio conjunto de herramientas para selección de características, ajuste de modelos, validación y despliegue.
ja: 前処理を ``scikit-learn`` エコシステムと接続することで、特徴選択、モデル調整、検証、デプロイメントのための幅広いツールスタックを利用できます。
zh_cn: 将您的预处理与 ``scikit-learn`` 生态系统连接起来，以解锁用于特征选择、模型调优、验证和部署的广泛工具栈。

source: **Want to explore the tools at your fingertips?** Visit the `explore overview <../explore/index.html>`_.
es: **¿Quieres explorar las herramientas a tu alcance?** Visita la `descripción general de exploración <../explore/index.html>`_.
ja: 手元のツールを探索したいですか？ `探索の概要 <../explore/index.html>`_ をご覧ください。

source: Composable and Scalable
es: Componible y escalable
ja: 組み合わせ可能でスケーラブル
zh_cn: 可组合与可扩展

source: ``chemotools`` transforms preprocessing into a **modular, composable process**: each transformer follows the ``fit`` / ``transform`` API and integrates directly with ``scikit-learn`` pipelines. Preprocessing, feature selection, modelling, and validation can be chained directly — no adapters required.
es: ``chemotools`` transforma el preprocesamiento en un **proceso modular y componible**: cada transformador sigue la API ``fit`` / ``transform`` y se integra directamente con pipelines de ``scikit-learn``. El preprocesamiento, selección de características, modelado y validación se pueden encadenar directamente — sin adaptadores requeridos.
ja: ``chemotools`` は、前処理をモジュール化された組み合わせ可能なプロセスに変換します。各トランスフォーマーは ``fit`` / ``transform`` APIに従い、``scikit-learn`` パイプラインと直接統合されます。前処理、特徴選択、モデリング、検証を直接チェーン化できます。アダプターは不要です。
zh_cn: ``chemotools`` 将预处理转变为模块化、可组合的过程：每个转换器都遵循 ``fit`` / ``transform`` API，并直接与 ``scikit-learn`` 管道集成。预处理、特征选择、建模和验证可以直接链接——无需适配器。

source: This composability ensures **reproducibility** (pipelines are declarative), **robustness** (swap blocks without refactoring), and **scalability** (parallelization and deployment patterns leveraging already supported infrastructure by the ecosystem).
es: Esta componibilidad asegura **reproducibilidad** (los pipelines son declarativos), **robustez** (intercambia bloques sin refactorizar) y **escalabilidad** (patrones de paralelización y despliegue aprovechando infraestructura ya soportada por el ecosistema).
ja: この組み合わせ可能性により、再現性（パイプラインは宣言的）、堅牢性（リファクタリングせずにブロックを交換可能）、スケーラビリティ（エコシステムによって既にサポートされているインフラストラクチャを活用した並列化とデプロイメントパターン）が保証されます。
zh_cn: 这种可组合性确保了可重现性（管道是声明式的）、稳健性（无需重构即可交换模块）和可扩展性（利用生态系统已支持的基础设施进行并行化和部署）。

source: From exploration to deployment, ``chemotools`` grows with your workflow.
es: Desde la exploración hasta el despliegue, ``chemotools`` crece con tu flujo de trabajo.
ja: 探索からデプロイメントまで、``chemotools`` はワークフローとともに成長します。
zh_cn: 从探索到部署，``chemotools`` 与您的工作流程共同成长。

source: Quality & Transparency
es: Calidad y transparencia
ja: 品質と透明性
zh_cn: 质量与透明度

source: ``chemotools`` combines extensibility and scalability with open-source transparency, making validation and trust easier from the start.
es: ``chemotools`` combina extensibilidad y escalabilidad con transparencia de código abierto, haciendo que la validación y la confianza sean más fáciles desde el principio.
ja: ``chemotools`` は、拡張性とスケーラビリティをオープンソースの透明性と組み合わせ、最初から検証と信頼を容易にします。
zh_cn: ``chemotools`` 将可扩展性和可伸缩性与开源透明度相结合，使得验证和信任从一开始就更加容易。

source: **Thorough testing** — covered by extensive `unit tests <https://app.codecov.io/github/paucablop/chemotools>`_ and continuous code coverage for reliability and robustness.
es: **Pruebas exhaustivas** — cubierto por extensas `pruebas unitarias <https://app.codecov.io/github/paucablop/chemotools>`_ y cobertura continua de código para confiabilidad y robustez.
ja: 徹底的なテスト — 広範な `ユニットテスト <https://app.codecov.io/github/paucablop/chemotools>`_ と継続的なコードカバレッジにより、信頼性と堅牢性が保証されています。
zh_cn: 全面测试 — 通过广泛的 `单元测试 <https://app.codecov.io/github/paucablop/chemotools>`_ 和持续的代码覆盖率来确保可靠性和稳健性。

source: **Transparency** — we provide a Software Bill of Materials (SBOM) in `CycloneDX <https://cyclonedx.org/>`_ format with every release, supporting validation and clearance in regulated environments.
es: **Transparencia** — proporcionamos una Lista de Materiales de Software (SBOM) en formato `CycloneDX <https://cyclonedx.org/>`_ con cada lanzamiento, soportando validación y aprobación en entornos regulados.
ja: 透明性 — すべてのリリースで `CycloneDX <https://cyclonedx.org/>`_ 形式のソフトウェア部品表（SBOM）を提供し、規制環境での検証と承認をサポートしています。
zh_cn: 透明度 — 我们在每个版本中都提供 `CycloneDX <https://cyclonedx.org/>`_ 格式的软件物料清单 (SBOM)，以支持在受监管环境中的验证和审核。

source: **Peer-reviewed** — published in the `Journal of Open Source Software (JOSS) <https://joss.theoj.org/papers/10.21105/joss.06802>`_ following independent peer review.
es: **Revisado por pares** — publicado en el `Journal of Open Source Software (JOSS) <https://joss.theoj.org/papers/10.21105/joss.06802>`_ después de revisión independiente por pares.
ja: 査読済み — 独立した査読を経て `Journal of Open Source Software (JOSS) <https://joss.theoj.org/papers/10.21105/joss.06802>`_ に掲載されています。
zh_cn: 同行评审 — 经过独立同行评审后，发表于 `Journal of Open Source Software (JOSS) <https://joss.theoj.org/papers/10.21105/joss.06802>`_。

source: Quality, transparency, and trust — built in from the start.
es: Calidad, transparencia y confianza — incorporadas desde el principio.
ja: 品質、透明性、信頼性 — 最初から組み込まれています。
zh_cn: 质量、透明度和信任——从一开始就内置其中。
