Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0.tar.gz/geovisio-2.11.0/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: de, eo, it, sv, tr, uk

source: You need to accept the terms of service before uploading any pictures. You can do so by validating them here: %(url)s
de: Bevor du Bilder hochlädst, musst du die Nutzungsbedingungen akzeptieren. Dies kannst du hier tun: %(url)s
eo: Vi devas akcepti la servokondiĉojn antaŭ ol alŝuti ajnajn fotojn. Vi povas fari tion validigante ilin ĉi tie: %(url)s
it: È necessario accettare i termini di servizio prima di caricare una qualsiasi foto. È possibile farlo convalidando i termini qua: %(url)s
sv: Du måste acceptera användarvillkoren innan du laddar upp några bilder. Du kan göra det genom att läsa dem här: %(url)s
tr: Herhangi bir resim yüklemeden önce hizmet şartlarını kabul etmeniz gerekmektedir. Bunu, şu adresten doğrulayarak yapabilirsiniz: %(url)s
uk: Перед завантаженням будь-яких зображень необхідно прийняти умови надання послуг. Ви можете це зробити, підтвердивши їх тут: %(url)s

source: Parameter for creating an annotation should be a valid JSON
de: Parameter für die Erstellung einer Annotation muss gültiges JSON sein
eo: Parametro por krei prinoton devas esti valida JSON-o
it: Il parametro per la creazione di un’annotazione dovrebbe essere un JSON valido
tr: Açıklama oluşturmak için parametre geçerli bir JSON olmalıdır
uk: Параметр для створення анотації повинен бути дійсним JSON

source: Impossible to patch annotation, invalid parameters
de: Abändern der Annotation nicht möglich, ungültige Parameter
eo: Neeble fliki prinoton, malvalidaj parametroj
it: Impossibile modificare l’annotazione, parametri non validi
tr: Açıklamayı düzeltmek imkansız, geçersiz parametreler
uk: Неможливо виправити анотацію, недійсні параметри

source: Annotation %(p)s not found
de: Annotation %(p)s nicht gefunden
eo: Prinoto %(p)s ne trovita
it: Annotazione %(p)s non trovata
tr: %(p)s açıklama notu bulunamadı
uk: Анотація %(p)s не знайдена

source: Parameter for updating an annotation should be a valid JSON
de: Parameter zum Aktualisieren der Annotation muss gültiges JSON sein
eo: Parametro por ĝisdati prinoton devas esti valida JSON-o
it: Il parametro per l’aggiornamento di un’annotazione dovrebbe essere un JSON valido
tr: Bir açıklamayı güncellemek için parametre geçerli bir JSON olmalıdır
uk: Параметр для оновлення анотації повинен бути дійсним JSON

source: CSV export does not support pagination
de: CSV-Export unterstützt keinen seitenweisen Export
eo: CSV-eksporto ne subtenas paĝnumeradon
it: L’export CSV non è compatibile con la paginazione
tr: CSV dışa aktarımı sayfalandırmayı desteklemiyor
uk: Експорт CSV не підтримує пагінацію

source: CSV export does not support filters
de: CSV-Export unterstützt keine Filter
eo: CSV-eksporto ne subtenas filtrilojn
it: L’export CSV non è compatibile con i filtri
tr: CSV dışa aktarımı filtreleri desteklemiyor
uk: Експорт CSV не підтримує фільтри

source: CSV export does not support sorting by anything but creation date
de: CSV-Export unterstützt keine Sortierung außer nach Erstellungsdatum
eo: CSV-eksporto ne subtenas ordigon laŭ io ajn krom kreodato
it: L’export CSV non è compatibile con l’ordinamento eccetto che per data di creazione
tr: CSV dışa aktarımı, oluşturma tarihi dışında hiçbir şeye göre sıralamayı desteklemiyor
uk: Експорт CSV не підтримує сортування за нічим, окрім дати створення

source: Unsupported sortby parameter: invalid field
de: Nicht unterstützter "sortby"-Parameter: ungültiges Feld
eo: Nesubtenata ordigparametro: malvalida kampo
it: Parametro “sortby” non compatibile: campo non valido
tr: Desteklenmeyen sıralama parametresi: geçersiz alan
uk: Непідтримуваний параметр сортування: недійсне поле

source: Impossible to update the UploadSet
de: Aktualisieren des Uploadsets ist nicht möglich
eo: Neeble ĝisdati la UploadSet
it: Impossibile aggiornare l’UploadSet
tr: UploadSet'i güncellemek imkansız
uk: Неможливо оновити UploadSet

source: Parameter for updating an UploadSet should be a valid JSON
de: Parameter zum Aktualisieren des Uploadsets muss gültiges JSON sein
eo: Parametro por ĝisdati UploadSet-on devas esti valida JSON-o
it: Il parametro per aggiornare l’UploadSet dovrebbe essere un JSON valido
tr: UploadSet'i güncellemek için parametre geçerli bir JSON olmalıdır
uk: Параметр для оновлення UploadSet має бути дійсним JSON

source: You are not allowed to update this upload set
de: Du bist nicht berechtigt, dieses Uploadset zu aktualisieren
eo: Vi ne rajtas ĝisdatigi ĉi tiun alŝutaron
it: Non siete autorizzati ad aggiornare questo set di caricamento
tr: Bu yükleme setini güncellemenize izin verilmiyor
uk: Ви не маєте права оновлювати цей набір для завантаження

source: Impossible to create an annotation
de: Annotation kann nicht erstellt werden
eo: Neeble krei prinoton
it: Impossibile creare un’annotazione
tr: Bir açıklama oluşturmak imkansız
uk: Неможливо створити анотацію

source: There is already a picture with the same index in the sequence
de: Es gibt bereits ein Bild mit demselben Index in der Sequenz
it: Esiste già una immagine con questo indice nella sequenza
tr: Sekansta aynı indekse sahip bir resim zaten var
uk: У послідовності вже є зображення з таким самим індексом

source: Picture is not available (currently in processing)
de: Das Bild ist nicht verfügbar (wird gerade verarbeitet)
tr: Resim mevcut değil (şu anda işleniyor)
uk: Зображення недоступне (наразі обробляється)

source: Impossible to add the picture to this uploadset
de: Das Bild kann nicht zu diesem Uploadset hinzugefügt werden
tr: Resmi bu yükleme setine eklemek imkansız
uk: Неможливо додати зображення до цього набору для завантаження

source: RSS format does not support deleted sequences
de: Das RSS-Format unterstützt keine gelöschten Sequenzen
tr: RSS biçimi silinen dizileri desteklemiyor
uk: Формат RSS не підтримує видалені послідовності

source: Visibility and visible parameters are mutually exclusive parameters
de: Die Parameter visibility und visible schließen sich gegenseitig aus
tr: Görünürlük ve görünür parametreler birbirini dışlayan parametrelerdir
uk: Видимість та параметри видимості є взаємовиключними параметрами

source: The status filter is not supported anymore, use the `visibility` filter instead
de: Der Status-Filter wird nicht mehr unterstützt, nutze stattdessen den Filter `visibility`
tr: Durum filtresi artık desteklenmiyor, bunun yerine `görünürlük` filtresini kullanın
uk: Фільтр статусу більше не підтримується, замість нього використовуйте фільтр «видимість»

source: The status filter is not supported anymore, use the `show_deleted` parameter instead if you need to query deleted collections
de: Der Status-Filter wird nicht mehr unterstützt, nutze stattdessen den Parameter `show_deleted`, falls du gelöschte Sammlungen abfragen möchtest
tr: Durum filtresi artık desteklenmiyor, silinen koleksiyonları sorgulamanız gerekiyorsa bunun yerine `show_deleted` parametresini kullanın
uk: Фільтр статусу більше не підтримується, використовуйте параметр `show_deleted`, якщо вам потрібно запитувати видалені колекції

source: The logged-only visibility is not allowed on this instance since anybody can create an account
de: Die Sichtbarkeit nur für eingeloggte Konten ist auf dieser Instanz nicht erlaubt, da die Kontenerstellung nicht eingeschränkt ist
tr: Bu örnekte yalnızca oturum açmış kişilerin görünürlüğüne izin verilmiyor çünkü herkes bir hesap oluşturabilir
uk: Видимість лише для зареєстрованих користувачів заборонена в цьому екземплярі, оскільки будь-хто може створити обліковий запис

source: Links
eo: Ligiloj
it: Collegamenti
sv: Länkar
tr: Bağlantılar
uk: Лінки
