Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0.tar.gz/geovisio-2.11.0/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: de, eo, it, sv, tr, uk

source: The same picture has already been sent in a past upload
de: Dasselbe Bild wurde bereits in einem vergangenen Upload hochgeladen
eo: La sama bildo jam estis sendita en pasinta alŝuto
it: La stessa foto è già stata inviata in un caricamento precedente
sv: Samma bild har redan skickats i en tidigare uppladdning
tr: Aynı resim daha önceki bir yüklemede gönderilmişti
uk: Таке саме зображення вже було надіслано під час попереднього завантаження

source: UploadSet doesn't exists
de: UploadSet existiert nicht

source: You're not authorized to complete this upload set
de: Du bist nicht berechtigt, dieses UploadSet zu abzuschließen
eo: Vi ne estas rajtigita kompletigi ĉi tiun alŝutan aron
it: Non siete autorizzati a completare questo “upload set”
sv: Du har inte behörighet att slutföra denna uppladdning
tr: Bu yükleme setini tamamlamaya yetkili değilsiniz
uk: Ви не маєте права завершити цей набір завантажень

source: The upload set is already completed, cannot complete it several times for the moment
de: Dieses UploadSet ist bereits abgeschlossen, es kann zur Zeit nicht erneut abgeschlossen werden

source: Impossible to find user
de: Konnte Nutzer nicht finden
eo: Ne eblas trovi la uzanton
it: Impossibile trovare l’utente
sv: Omöjligt att hitta användare
tr: Kullanıcıyı bulmak imkansız
uk: Неможливо знайти користувача

source: No search parameter given, you should provide `q=<pattern>` as query parameter
de: Keine Suchanfrage angegeben, `q=<suchbegriff>` muss als Abfrageparameter angegeben werden
eo: Neniu serĉa parametro donita, vi devas provizi `q=<pattern>` kiel serĉan parametron
it: Nessun parametro di ricerca inserito, dovresti fornire`q=<pattern>` come parametro della richiesta
sv: Ingen sökparameter angiven, du bör ange `q=<pattern>` som frågeparameter
tr: Hiçbir arama parametresi belirtilmedi, sorgu parametresi olarak `q=<pattern>` sağlamalısınız
uk: Параметр пошуку не вказано, слід надати `q=<шаблон>` як параметр запиту

source: No default account defined, please contact your instance administrator
de: Kein Standardaccount definiert, bitte kontaktiere die Administration deiner Instanz
eo: Neniu defaŭlta konto difinita, bonvolu kontakti vian instancan administranton
it: Non è indicata l’utenza predefinita, contattare l’amministratore dell’istanza
sv: Inget standardkonto har definierats, kontakta din instansadministratör
tr: Varsayılan hesap tanımlanmadı, lütfen örnek yöneticinizle iletişime geçin
uk: Обліковий запис за замовчуванням не визначено, зверніться до адміністратора екземпляра

source: You're not authorized to add picture to this upload set
de: Sie sind nicht autorisiert, Fotos zu diesem UploadSet hinzuzufügen
eo: Vi ne estas rajtigita aldoni bildon al ĉi tiu alŝutaro
it: Non siete autorizzati ad aggiungere la foto a questo “upload set”
sv: Du har inte behörighet att lägga till bild i denna upload set
tr: Bu yükleme setine resim ekleme yetkiniz yok
uk: Ви не маєте права додавати зображення до цього набору для завантаження

source: The picture is too similar to another one (nearby and taken almost at the same time)
de: Das Foto ist einem anderen zu ähnlich (in der Nähe und zur fast selben Zeit aufgenommen)
eo: La bildo estas tro simila al alia (proksima kaj farita preskaŭ samtempe)
it: La foto è troppo simile ad un’altra (vicina e scattata quasi nello stesso momento)
sv: Bilden är för lik en annan (i närheten och tagen nästan samtidigt)
tr: Resim başka bir resme çok benziyor (yakın ve neredeyse aynı anda çekilmiş)
uk: Фотографія занадто схожа на іншу (зроблену неподалік і майже в той самий час)

source: The sent file is not a valid JPEG
de: Die gesendete Datei ist kein gültiges JPEG
eo: La sendita dosiero ne estas valida JPEG
it: Il file inviato non è un JPEG valido
sv: Den skickade filen är inte en giltig JPEG
tr: Gönderilen geçersiz JPEG dosyası
uk: Надісланий файл не є дійсним файлом JPEG

source: The picture has invalid EXIF or XMP metadata, making it impossible to use
de: Das Foto hat ungültige EXIF- oder XMP-Metadaten, sodass seine Nutzung unmöglich ist
eo: La bildo havas nevalidajn EXIF- aŭ XMP-metadatenojn, kiuj igas ĝin neuzebla
it: La foto ha metadata EXIF o XMP non validi, rendendola impossibile da utilizzare
sv: Bilden har ogiltiga EXIF- eller XMP-metadata, vilket gör den omöjlig att använda
tr: Resimde geçersiz EXIF veya XMP meta verileri var, bu da onu kullanmayı imkansız hale getiriyor
uk: Зображення має недійсні метадані EXIF або XMP, що унеможливлює його використання

source: Impossible to find excluded area
de: Kann den ausgeschlossenen Bereich nicht finden
eo: Ne eblas trovi ekskluditan areon
it: Impossibile trovare una zona esclusa
sv: Omöjligt att hitta uteslutet område
tr: Hariç tutulan alanı bulmak imkansız
uk: Неможливо знайти виключену область

source: Something went very wrong, but not due to the picture itself
de: Etwas ist sehr schief gelaufen, aber nicht wegen des Bildes an sich
eo: Io misa okazis, sed ne pro la bildo mem
it: Qualcosa è andato veramente storto, ma non per colpa della foto
sv: Något gick väldigt fel, men inte på grund av själva bilden
tr: Bir şeyler çok yanlış gitti, ama bunun sebebi resmin kendisi değil
uk: Щось пішло не так, але не через саму картинку

source: Picture has invalid metadata
de: Bild hat ungültige Metadaten
eo: Bildo havas nevalidan metadaton
it: La foto ha metadata non validi
sv: Bilden har ogiltig metadata
tr: Resim meta verileri geçersiz
uk: Зображення має недійсні метадані

source: You're not authorized to list reports
de: Du bist nicht berechtigt, Berichte aufzulisten
eo: Vi ne estas rajtigita por listigi raportojn
it: Non siete autorizzati a elencare le segnalazioni
sv: Du har inte behörighet att lista rapporter
tr: Raporları listeleme yetkiniz yok
uk: Ви не маєте права розміщувати звіти

source: You must be logged-in as admin to access all excluded areas
de: Du musst als Administrator eingeloggt sein, um auf alle ausgeschlossenen Bereiche zugreifen zu können
eo: Vi devas esti ensalutinta kiel administranto por aliri ĉiujn ekskluditajn areojn
it: Devi aver effettuato l’accesso come amministratore per avere accesso a tutte le aree escluse
sv: Du måste vara inloggad som admin för att komma åt alla uteslutna områden
tr: Tüm hariç tutulan alanlara erişmek için yönetici olarak oturum açmanız gerekir
uk: Щоб отримати доступ до всіх виключених областей, ви повинні увійти як адміністратор

source: Only authenticated users can access reports
de: Nur authentifizierte Benutzer können auf Meldungen zugreifen
eo: Nur aŭtentikigitaj uzantoj povas aliri raportojn
it: Solo gli utenti autenticati possono accedere alle segnalazioni
sv: Endast autentiserade användare kan komma åt rapporter
tr: Yalnızca kimliği doğrulanmış kullanıcılar raporlara erişebilir
uk: Доступ до звітів мають лише автентифіковані користувачі

source: Report doesn't exist
de: Die Meldung existiert nicht
eo: La raporto ne ekzistas
it: Segnalazione inesistente
sv: Rapporten finns inte
tr: Rapor mevcut değil
uk: Звіт не існує

source: You're not authorized to access this report
de: Du bist nicht berechtigt, auf diese Meldung zuzugreifen
eo: Vi ne estas rajtigita por aliri ĉi tiun raporton
it: Non siete autorizzati ad accedere a questa segnalazione
sv: Du har inte behörighet att komma åt denna rapport
tr: Bu rapora erişim yetkiniz yok
uk: Ви не маєте права доступу до цього звіту

source: You're not authorized to access all excluded areas
de: Du bist nicht berechtigt, auf alle ausgeschlossenen Bereiche zuzugreifen
eo: Vi ne estas aŭtorizita por aliri ĉiujn ekskluditajn areojn
it: Non siete autorizzati ad accedere a tutte le aree escluse
sv: Du har inte behörighet att komma åt alla uteslutna områden
tr: Hariç tutulan tüm alanlara erişim yetkiniz yok
uk: Ви не маєте права доступу до всіх заборонених зон

source: Impossible to create a Report
de: Erstellen einer Meldung nicht möglich
eo: Ne eblas krei raporton
it: Impossibile creare una segnalazione
sv: Omöjligt att skapa en rapport
tr: Bir Rapor oluşturmak imkansız
uk: Неможливо створити звіт

source: Parameter for creating a Report should be a valid JSON
de: Parameter für die Erstellung einer Meldung muss gültiges JSON sein
eo: Parametro por krei raporton devus esti valida JSON
it: Il parametro per la creazione di una segnalazione dovrebbe essere un JSON valido
sv: Parametern för att skapa en rapport bör vara giltig JSON
tr: Rapor oluşturmak için parametre geçerli bir JSON olmalıdır
uk: Параметр для створення звіту має бути дійсним JSON

source: Impossible to edit the Report
de: Bearbeitung der Meldung nicht möglich
eo: Ne eblas modifi la raporton
it: Impossibile modificare la segnalazione
sv: Omöjligt att redigera rapporten
tr: Raporu düzenlemek imkansız
uk: Неможливо редагувати звіт

source: Parameter for creating an Excluded Area should be a valid JSON
de: Der Parameter für die Erstellung eines ausgeschlossenen Bereichs muss gültiges JSON sein
eo: La parametro por krei ekskluditan areon devus esti valida JSON
it: Il parametro per creare una zona esclusa dovrebbe essere un JSON valido
sv: Parametern för att skapa ett exkluderat område bör vara en giltig JSON
tr: Hariç Tutulan Alan oluşturma parametresi geçerli bir JSON olmalıdır
uk: Параметр для створення виключеної області має бути дійсним JSON

source: You're not authorized to edit this Report
de: Du bist nicht berechtigt, diese Meldung zu bearbeiten
eo: Vi ne estas rajtigita por modifi ĉi tiun raporton
it: Non siete autorizzati a modificare questa segnalazione
sv: Du är inte behörig att redigera denna rapport
tr: Bu Raporu düzenleme yetkiniz yok
uk: Ви не маєте права редагувати цей звіт

source: You must be logged-in as admin to edit excluded areas
de: Du musst als Administrator eingeloggt sein, um ausgeschlossene Bereiche zu bearbeiten
eo: Vi devas esti ensalutinta kiel administranto por modifi ekskluditajn areojn
it: Devi aver effettuato l’accesso come amministratore per modificare le zone escluse
sv: Du måste vara inloggad som admin för att redigera uteslutna områden
tr: Hariç tutulan alanları düzenlemek için yönetici olarak oturum açmalısınız
uk: Щоб редагувати виключені області, ви повинні бути адміністратором

source: Impossible to replace all Excluded Areas
de: Alle ausgeschlossenen Bereiche konnten nicht ersetzt werden
eo: Ne eblas anstataŭigi ĉiujn ekskluditajn areojn
it: Impossibile rimpiazzare tutte le zone escluse
sv: Omöjligt att ersätta alla uteslutna områden
tr: Tüm Hariç Tutulan Alanları değiştirmek imkansızdır
uk: Неможливо замінити всі виключені області

source: Parameter for replacing all Excluded Areas should be a valid JSON
de: Der Parameter zum Ersetzen aller ausgeschlossenen Bereiche muss gültiges JSON sein
eo: La parametro por anstataŭigi ĉiujn ekskluditajn areojn devus esti valida JSON
it: Il parametro per rimpiazzare tutte le zone escluse dovrebbe essere un JSON valido
sv: Parametern för att ersätta alla uteslutna områden bör vara en giltig JSON
tr: Tüm Hariç Tutulan Alanların değiştirilmesi için parametre geçerli bir JSON olmalıdır
uk: Параметр для заміни всіх виключених областей має бути дійсним JSON

source: The collection has been deleted, impossible to add pictures to it
de: Die Sammlung wurde gelöscht. Es ist unmöglich, ihr Bilder hinzuzufügen
eo: La kolekto estis forigita, neeble aldoni bildojn al ĝi
it: La collezione è stata eliminata, impossibile aggiungere foto a essa
sv: Samlingen har tagits bort, omöjligt att lägga till bilder till den
tr: Koleksiyon silindi, içine resim eklemek imkansız
uk: Колекцію видалено, до неї неможливо додати зображення

source: You're not authorized to list pictures in this upload set
de: Du bist nicht berechtigt, Bilder in diesem Upload-Set aufzulisten
eo: Vi ne estas rajtigita listigi bildojn en ĉi tiu alŝuta aro
it: Non siete autorizzati a elencare le foto in questo “upload set”

source: Impossible to open file as image. The only supported image format is jpg.
de: Es ist nicht möglich, die Datei als Bild zu öffnen. Das einzige unterstützte Bildformat ist jpg.
eo: Ne eblas malfermi dosieron kiel bildon. La sola subtenata bildformato estas JPG.
it: Impossibile aprire il file come immagine. L’unico formato di immagine supportato è il JPEG.
sv: Omöjligt att öppna filen som bild. Det enda bildformatet som stöds är jpg.
tr: Dosyayı resim olarak açmak mümkün değil. Desteklenen tek resim formatı jpg'dir.
uk: Неможливо відкрити файл як зображення. Єдиний підтримуваний формат зображення – jpg.

source: You're not authorized to delete this upload set
de: Du bist nicht berechtigt, dieses UploadSet zu löschen
eo: Vi ne estas rajtigita forigi ĉi tiun alŝutan aron
it: Non siete autorizzati a cancellare questo “upload set”
sv: Du har inte behörighet att ta bort denna uppladdningsuppsättning
tr: Bu yükleme setini silme yetkiniz yok
uk: Ви не маєте права видаляти цей набір завантажень

source: Collection %(s)s wasn't found in database
de: Sammlung %(s)s wurde nicht in der Datenbank gefunden
eo: Kolekto %(s)s ne estis trovita en la datumbazo
it: La collezione %(s)s non è stata trovata nel database
sv: Samlingen %(s)s hittades inte i databasen
tr: %(s)s koleksiyonu veritabanında bulunamadı
uk: Колекцію %(s)s не знайдено в базі даних

source: Impossible to create an Excluded Area
de: Es ist nicht möglich, einen ausgeschlossenen Bereich zu erstellen
eo: Ne eblas krei ekskluditan areon
it: Impossibile creare una zona esclusa
sv: Omöjligt att skapa ett exkluderat område
tr: Hariç Tutulan Bir Alan Oluşturmak İmkansız
uk: Неможливо створити виключену зону

source: You must be logged-in as admin to delete excluded areas
de: Du musst als Administrator eingeloggt sein, um ausgeschlossene Bereiche zu löschen
eo: Vi devas esti ensalutinta kiel administranto por forigi ekskluditajn areojn
it: Devi aver effettuato l’accesso come amministratore per eliminare una zone esclusa
sv: Du måste vara inloggad som admin för att radera exkluderade områden
tr: Hariç tutulan alanları silmek için yönetici olarak oturum açmalısınız
uk: Щоб видалити виключені області, ви повинні увійти як адміністратор

source: Parameter for editing the Report should be a valid JSON
de: Parameter für die Bearbeitung der Meldung muss gültiges JSON sein
eo: Parametro por modifi la raporton devus esti valida JSON
it: Il parametro per modificare la segnalazione dovrebbe essere un JSON valido
sv: Parametern för att redigera rapporten bör vara en giltig JSON
tr: Raporu düzenlemek için parametre geçerli bir JSON olmalıdır
uk: Параметр для редагування звіту має бути дійсним JSON

source: A different picture with the same name has already been added to this uploadset
de: Ein anderes Bild mit demselben Namen wurde bereits zu diesem Uploadset hinzugefügt
eo: Alia bildo kun la sama nomo jam estis aldonita al ĉi tiu alŝutgrupo
it: Una foto differente ma con lo stesso nome è già stata aggiunta a questo uploadset
sv: En annan bild med samma namn har redan lagts till i denna uppladdning
tr: Aynı isimde farklı bir resim bu yükleme setine zaten eklendi
uk: Інша картинка з такою ж назвою вже була додана до цього набору завантажень

source: Parameter `capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
de: Parameter `capture_time` ist kein valider Zeitstempel, muss dem ISO-Format folgen (z. B. '2017-07-21T17:32:28Z').
eo: Parametro `capture_time` ne estas valida dato kaj tempo; ĝi devas esti en ISO-formato (ekz. '2017-07-21T17:32:28Z').
it: Il parametro `capture_time` non è un “datetime” valido, dovrebbe essere in un formato “datetime” ISO (ad es. '2017-07-21T17:32:28Z').
sv: Parametern 'capture_time' är inte en giltig datetime, den bör vara en iso-formaterad datetime (t.e.x. '2017-07-21T17:32:28Z').
tr: `capture_time` parametresi geçerli bir tarih ve saat değil, iso biçimli bir tarih ve saat olmalıdır (örneğin '2017-07-21T17:32:28Z').
uk: Параметр `capture_time` не є коректною датою та часом, він має бути у форматі ISO (наприклад, '2017-07-21T17:32:28Z').

source: For parameter `longitude`, `%(v)s` is not a valid longitude
de: Parameter `longitude`, `%(v)s` ist kein gültiger Längengrad
eo: Por parametro `longitude`, `%(v)s` ne estas valida longitudo
it: Per il parametro `longitude`, `%(v)s` non è una longitudine valida
sv: För parametern 'longitud' är '%(v)s' inte en giltig longitud
tr: `longitude` parametresi , `%(v)s` geçerli bir boylam değeri değil
uk: Для параметра `довгота`, `%(v)s` не є коректною довготою

source: For parameter `latitude`, `%(v)s` is not a valid latitude
de: Parameter `latitude`, `%(v)s` ist kein gültiger Breitengrad
eo: Por parametro `longitude`, `%(v)s` ne estas valida latitudo
it: Per il parametro `latitude`, `%(v)s` non è una latitudine valida
sv: För parametern `latitud` är `%(v)s` inte en giltig latitud
tr: `latitude` parametresi , `%(v)s` geçerli bir enlem değeri değil
uk: Для параметра `широта`, `%(v)s` не є коректною широтою

source: Longitude cannot be overridden alone, latitude also needs to be set
de: Längengrad kann nicht alleine überschrieben werden, Breitengrad muss auch gesetzt werden
eo: Longitudo ne povas esti anstataŭigita sole; latitudo ankaŭ devas esti agordita
it: La longitudine non può essere sovrascritta da sola, deve essere impostata anche la latitudine
sv: Longitud kan inte åsidosättas ensam, latitud måste också ställas in
tr: Boylam tek başına geçersiz kılınamaz, enlemin de ayarlanması gerekir
uk: Не можна змінити лише довготу, також потрібно встановити широту

source: Latitude cannot be overridden alone, longitude also needs to be set
de: Breitengrad kann nicht alleine überschrieben werden, Längengrad muss auch gesetzt werden
eo: Latitudo ne povas esti anstataŭigita sole; longitudo ankaŭ devas esti agordita
it: La latitudine non può essere sovrascritta da sola, deve essere impostata anche la longitudine
sv: Latitud kan inte åsidosättas ensam, longitud måste också ställas in
tr: Enlem tek başına geçersiz kılınamaz, boylamın da ayarlanması gerekir
uk: Не можна змінити лише широту, також потрібно встановити довготу

source: You're not authorized to edit those fields for this sequence. Only the owner can change the visibility and the title
de: Du bist nicht berechtigt, diese Felder für diese Sequenz zu bearbeiten. Nur der Eigentümer kann die Sichtbarkeit und den Titel ändern
eo: Vi ne estas rajtigita redakti tiujn kampojn por ĉi tiu sekvenco. Nur la posedanto povas ŝanĝi la videblecon kaj la titolon
it: Non hai l’autorizzazione a modificare quei campi di questa sequenza. Solo il proprietario può modificare la visibilità e il titolo
sv: Du är inte behörig att redigera dessa fält för den här sekvensen. Endast ägaren kan ändra synlighet och titel
tr: Bu sekans için bu alanları düzenleme yetkiniz yok. Görünürlüğü ve başlığı yalnızca sahibi değiştirebilir
uk: Ви не маєте права редагувати ці поля для цієї послідовності. Тільки власник може змінити видимість і назву

source: You're not authorized to edit this sequence, collaborative editing is not allowed
de: Du bist nicht berechtigt, diese Sequenz zu bearbeiten, gemeinschaftliche Bearbeitung ist nicht erlaubt
eo: Vi ne estas rajtigita redakti ĉi tiun sekvencon, kunlabora redaktado ne estas permesata
it: Non hai l’autorizzazione a modificare questa sequenza, la modifica collaborativa non è ammessa
sv: Du är inte behörig att redigera den här sekvensen, samarbetsredigering är inte tillåten
tr: Bu sekansı düzenleme yetkiniz yok, ortak düzenlemeye izin verilmiyor
uk: Ви не маєте права редагувати цю послідовність, спільне редагування заборонено

source: You're not authorized to edit the visibility of this picture. Only the owner can change this.
de: Du bist nicht berechtigt, die Sichtbarkeit dieses Bildes zu bearbeiten. Nur der Eigentümer kann dies ändern.
eo: Vi ne estas rajtigita redakti la videblecon de ĉi tiu bildo. Nur la posedanto povas ŝanĝi ĝin.
it: Non hai l’autorizzazione a modificare la visibilità di questa foto. Solo il proprietario può cambiarla.
sv: Du har inte behörighet att redigera bildens synlighet. Endast ägaren kan ändra detta.
tr: Bu resmin görünürlüğünü düzenleme yetkiniz yok. Bunu yalnızca sahibi değiştirebilir.
uk: Ви не маєте права редагувати видимість цього зображення. Тільки власник може це змінити.

source: You're not authorized to edit this picture, collaborative editing is not allowed
de: Du bist nicht berechtigt, dieses Bild zu bearbeiten, gemeinschaftliche Bearbeitung ist nicht erlaubt
eo: Vi ne estas rajtigita redakti ĉi tiun bildon, kunlabora redaktado ne estas permesata
it: Non hai l’autorizzazione a modificare questa foto, la modifica collaborativa non è ammessa
sv: Du är inte behörig att redigera den här bilden, samarbetsredigering är inte tillåten
tr: Bu resmi düzenleme yetkiniz yok, ortak düzenlemeye izin verilmiyor
uk: Ви не маєте права редагувати це зображення, спільне редагування заборонено

source: Page name is not recognized
de: Der Seitenname wird nicht erkannt
eo: La paĝnomo ne estas rekonata
it: Nome della pagina non riconosciuto
sv: Sidnamnet känns inte igen
tr: Sayfa adı tanınmıyor
uk: Назва сторінки не розпізнана

source: Page not available in language %(l)s
de: Seite nicht in Sprache %(l)s verfügbar
eo: Paĝo ne disponeblas en la lingvo %(l)s
it: Pagina non disponibile nella lingua %(l)s
sv: Sidan är inte tillgänglig på språket %(l)s
tr: Sayfa %(l)s dilinde mevcut değil
uk: Сторінка недоступна мовою %(l)s

source: You must be logged-in as admin to edit pages
de: Du musst als Administrator eingeloggt sein, um Seiten zu bearbeiten
eo: Vi devas esti ensalutinta kiel administranto por redakti paĝojn
it: Devi aver effettuato l’accesso da amministratore per modificare le pagine
sv: Du måste vara inloggad som admin för att redigera sidor
tr: Sayfaları düzenlemek için yönetici olarak oturum açmalısınız
uk: Ви повинні бути адміністратором, щоб редагувати сторінки

source: Page content must be HTML (with Content-Type: text/html header set)
de: Der Seiteninhalt muss HTML sein (mit dem Header Content-Type: text/html)
eo: La paĝo devas esti HTML (kun Content-Type: text/html kaplinio)
it: Il contenuto della pagina deve essere in HTML (con impostato l’header Content-Type: text/html)
sv: Sidans innehåll måste vara HTML (med Content-Type: text/html header set)
tr: Sayfa içeriği HTML olmalıdır (İçerik Türü: text/html başlığı ayarlı)
uk: Вміст сторінки має бути у форматі HTML (із заданим заголовком Content-Type: text/html)

source: Could not update page content
de: Seiteninhalt konnte nicht aktualisiert werden
eo: Ne eblis ĝisdatigi la paĝan enhavon
it: Impossibile aggiornare il contenuto della pagina
sv: Det gick inte att uppdatera sidinnehållet
tr: Sayfa içeriği güncellenemedi
uk: Не вдалося оновити вміст сторінки

source: Could not delete page content
de: Seiteninhalt konnte nicht gelöscht werden
eo: Ne eblis forigi la paĝan enhavon
it: Impossibile cancellare il contenuto della pagina
sv: Det gick inte att ta bort sidinnehåll
tr: Sayfa içeriği silinemedi
uk: Не вдалося видалити вміст сторінки
