Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0.tar.gz/geovisio-2.11.0/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: de, eo, it, sv, tr, uk

source: Position in sequence should be a positive integer
de: Die Position in der Sequenz muss eine positive Ganzzahl sein
eo: La pozicio en sekvenco devus esti pozitiva entjero
it: La posizione nella sequenza dovrebbe essere un numero intero positivo
sv: Position i sekvens ska vara ett positivt heltal
tr: Sıradaki pozisyon pozitif bir tam sayı olmalıdır
uk: Позиція в послідовності має бути додатним цілим числом

source: Longitude cannot be overridden alone, override_latitude also needs to be set
de: Längengrad kann nicht allein überschrieben werden, "override_latitude" muss ebenfalls gesetzt werden
eo: Longitudo ne povas esti anstataŭigita sole, ankaŭ override_latitude bezonas esti agordita
it: La longitudine non può essere sovrascritta da sola, deve essere impostato anche “override_latitude”
sv: Longitud kan inte åsidosättas ensam, override_latitude måste också ställas in
tr: Boylam tek başına geçersiz kılınamaz, override_latitude'un da ayarlanması gerekir
uk: Довготу не можна перевизначити окремо, також потрібно встановити override_latitude

source: Latitude cannot be overridden alone, override_longitude also needs to be set
de: Breitengrad kann nicht alleine überschrieben werden, "override_latitude" muss ebenfalls gesetzt werden
eo: Latitudo ne povas esti anstataŭigita sole, ankaŭ override_longitude bezonas esti agordita
it: La latitudine non può essere sovrascritta da sola, deve essere impostato anche “override_longitude”
sv: Latitud kan inte åsidosättas ensam, override_longitude måste också ställas in
tr: Enlem tek başına geçersiz kılınamaz, override_longitude'un da ayarlanması gerekir
uk: Не можна змінити лише широту, також потрібно встановити override_longitude

source: For parameter `override_longitude`, `%(v)s` is not a valid longitude
de: `%(v)s` ist kein valider Längengrad für den Parameter `override_longitude`
eo: Por parametro `override_longitude`, `%(v)s` ne estas valida longitudo
it: Per il parametro `override_longitude`, `%(v)s` non è una longitudine valida
sv: För parametern 'override_longitude' är '%(v)s' inte en giltig longitud
tr: `override_longitude` parametresi için `%(v)s` geçerli bir boylam değildir
uk: Для параметра `override_longitude`, `%(v)s` не є коректною довготою

source: For parameter `override_latitude`, `%(v)s` is not a valid latitude
de: `%(v)s` ist kein valider Breitengrad für den Parameter `override_latitude`
eo: Por parametro `override_latitude`, `%(v)s` ne estas valida latitudo
it: Per il parametro `override_latitude`, `%(v)s` non è una latitudine valida
sv: För parametern `override_latitude` är `%(v)s` inte en giltig latitud
tr: `override_latitude` parametresi için `%(v)s` geçerli bir enlem değildir
uk: Для параметра `override_latitude`, `%(v)s` не є коректною широтою

source: Picture blur status should be either unset, true or false
de: Foto-Unkenntlichmachnung ("blur") muss entweder nicht gesetzt, "true" oder "false" sein
eo: La stato de bilda malklariĝo (blur) devus esti aŭ nespecifita, "true", aŭ "false"
it: Lo stato di sfocatura della foto dovrebbe essere non impostato, “true” o “false”
sv: Bildoskärpa status ska vara antingen inte satt, sann eller falsk
tr: Resim bulanıklık durumu ayarlanmamış, true veya false olmalıdır
uk: Стан розмиття зображення має бути або не встановлено, або має бути true, або false

source: No picture file was sent
de: Es wurden keine Fotos wurden übermittelt
eo: Neniu bilddosiero estis sendita
it: Nessun file di foto è stato inviato
sv: Ingen bildfil skickades
tr: Resim dosyası gönderilmedi
uk: Файл зображення не було надіслано

source: Picture file is either missing or in an unsupported format (should be jpg)
de: Foto-Datei fehlt oder ist in einem nicht-unterstützten Format (muss JPG sein)
eo: Bilda dosiero mankas aŭ estas en neapogata formato (devas esti jpg)
it: Il file della foto è mancante oppure in un formato non supportato (dovrebbe essere JPEG)
sv: Bildfilen saknas eller är i ett format som inte stöds (ska vara jpg)
tr: Resim dosyası eksik veya desteklenmeyen bir formatta (jpg olmalı)
uk: Файл зображення відсутній або має непідтримуваний формат (має бути jpg)

source: Sequence %(s)s wasn't found in database
de: Sequenz %(s)s wurde nicht in der Datenbank gefunden

source: Picture at given position already exist
de: Foto existiert an dieser Position bereits
eo: Bildo ĉe donita pozicio jam ekzistas
it: Esiste già una foto in quella posizione
sv: Bild på given position finns redan

source: Impossible to parse picture metadata
de: Foto-Metadaten können nicht gelesen werden
eo: Ne eblas analizi bildan metadaton
it: Impossibile analizzare i metadata della foto
sv: Omöjligt att analysera bildmetadata
tr: Resim meta verilerini ayrıştırmak imkansız
uk: Неможливо проаналізувати метадані зображення

source: Picture wasn't correctly saved in filesystem
de: Foto wurde nicht korrekt im Dateisystem gespeichert
eo: Bildo ne estis ĝuste konservita en la dosiersistemo
it: La foto non è stata salvata correttamente nel filesystem
sv: Bilden sparades inte korrekt i filsystemet
tr: Resim dosya sistemine doğru şekilde kaydedilmedi
uk: Зображення не було належним чином збережено у файловій системі

source: Heading is not valid, should be an integer in degrees from 0° to 360°. North is 0°, East = 90°, South = 180° and West = 270°.
de: Richtung ist nicht gültig, muss eine Ganzzahl in Grad zwischen 0° und 360° sein. Norden=0°, Osten=90°, Süden=180° und Westen=270°.
eo: Direkto ne estas valida, ĝi devus esti entjero en gradoj de 0° ĝis 360°. Nordo estas 0°, Oriento = 90°, Sudo = 180° kaj Okcidento = 270°.
it: La direzione non è valida, dovrebbe essere un numero intero da 0 a 360 gradi. Nord equivale a 0°, est = 90°, sud = 180° e ovest = 270°.
sv: Kompassriktning är inte giltig, bör vara ett heltal i grader från 0° till 360°. Nord är 0°, öst = 90°, syd = 180° och väster = 270°.
tr: Başlık geçersiz, 0° ile 360° arasında bir tam sayı olmalıdır. Kuzey 0°, Doğu = 90°, Güney = 180° ve Batı = 270°'dir.
uk: Заголовок недійсний, має бути цілим числом у градусах від 0° до 360°. Північ – 0°, схід – 90°, південь – 180°, а захід – 270°.

source: Picture %(p)s wasn't found in database
de: Foto %(p)s wurde nicht in der Datenbank gefunden
eo: Bildo %(p)s ne estis trovita en la datumbazo
it: La foto %(p)s non è stata trovata nel database
sv: Bild %(p)s hittades inte i databasen
tr: %(p)s resmi veritabanında bulunamadı
uk: Зображення %(p)s не знайдено в базі даних

source: You're not authorized to edit this picture
de: Du bist nicht berechtigt, dieses Bild zu bearbeiten
eo: Vi ne estas rajtigita redakti ĉi tiun bildon
it: Non siete autorizzati a modificare questa foto
sv: Du är inte behörig att redigera den här bilden
tr: Bu resmi düzenleme yetkiniz yok
uk: Ви не маєте права редагувати це зображення

source: Picture %(p)s is in %(s)s state, its visibility can't be changed for now
de: Foto %(p)s ist in Status %(s)s, die Sichtbarkeit kann zur Zeit nicht geändert werden
eo: Bildo %(p)s estas en stato %(s)s, ĝia videbleco nuntempe ne povas esti ŝanĝita
it: La foto %(p)s è nello stato %(s)s, la sua visibilità non può essere modificata per ora
sv: Bild %(p)s är i tillstånd %(s)s , dess synlighet kan inte ändras för närvarande
tr: %(p)s resmi %(s)s durumundadır, görünürlüğü şimdilik değiştirilemez
uk: Зображення %(p)s перебуває у стані %(s)s, його видимість наразі не можна змінити

source: One of required parameter is empty
de: Einer der erforderlichen Parameter ist leer
eo: Unu el la bezonataj parametroj estas malplena
it: Uno dei parametri richiesti è vuoto
sv: En av de nödvändiga parametrarna är tom
tr: Gerekli parametrelerden biri boş
uk: Один з обов'язкових параметрів порожній

source: Tile format is invalid, should be either pbf or mvt
de: Kachelformat ist ungültig, muss entweder pbf oder mvt sein
eo: Kahela formato estas nevalida, ĝi devus esti aŭ pbf aŭ mvt
it: Il formato delle mattonelle non è valido, dovrebbe essere PBF o MVT
sv: Tile-formatet är ogiltigt, bör vara antingen pbf eller mvt
tr: Döşeme biçimi geçersiz, pbf veya mvt olmalı
uk: Формат плитки недійсний, має бути pbf або mvt

source: X or Y parameter is out of bounds
de: X- oder Y-Parameter ausserhalb der Grenzwerte
eo: Parametro X aŭ Y estas ekster la limoj
it: Il parametro ‘X’ oppure ‘Y’ è fuori limite
sv: X- eller Y-parametern är utanför gränserna
tr: X veya Y parametresi sınırların dışındadır
uk: Параметр X або Y виходить за межі допустимого значення

source: Z parameter is out of bounds (should be 0-15)
de: Z-Parameter ist ausserhalb der Grenzwerte (muss zwischen 0-15 sein)
eo: Parametro Z estas ekster la limoj (devas esti inter 0 kaj 15)
it: Il parametro ‘Z’ è fuori limite (dovrebbe essere tra 0 e 15)
sv: Z-parametern är utanför gränserna (ska vara 0-15)
tr: Z parametresi sınırların dışındadır (0-15 olmalıdır)
uk: Параметр Z виходить за межі допустимого значення (має бути 0-15)

source: Impossible to get tile
de: Konnte nicht auf Kachel zugreifen
eo: Ne eblas akiri kahelon
it: Impossibile recuperare la mattonella
sv: Omöjligt att få kakel
tr: Döşeme almak imkansız
uk: Неможливо дістати плитку

source: Parameter datetime should contain one or two dates
de: Der Parameter "datetime" darf nur einen oder zwei Werte enthalten
eo: Parametro datetime devus enhavi unu aŭ du datojn
it: Il parametro “datetime” dovrebbe contenere una o due date
sv: Parametern datetime bör innehålla ett eller två datum
tr: datetime parametresi bir veya iki tarih içermelidir
uk: Параметр datetime повинен містити одну або дві дати

source: Parameter bbox must contain valid longitude (-180 to 180) and latitude (-90 to 90) values
de: Parameter "bbox" muss valide Längengrade (-180 bis 180) und Breitengrade (-90 bis 90) enthalten
eo: Parametro bbox devas enhavi validajn longitudajn (-180 ĝis 180) kaj latitudajn (-90 ĝis 90) valorojn
it: Il parametro “bbox” deve contenere dei valori di longitudine (da -180 e 180) e latitudine (da -90 a 90) validi
sv: Parametern bbox måste innehålla giltiga longitud (-180 till 180) och latitud (-90 till 90) värden
tr: bbox parametresi geçerli boylam (-180 ila 180) ve enlem (-90 ila 90) değerleri içermelidir
uk: Параметр bbox повинен містити дійсні значення довготи (від -180 до 180) та широти (від -90 до 90)

source: Parameter bbox must be in format [minX, minY, maxX, maxY]
de: Parameter "bbox" muss im Format [minX, minY, maxX, maxY] sein
eo: Parametro bbox devas esti en formato [minX, minY, maxX, maxY]
it: Il parametro “bbox” deve essere nel formato [minX, minY, maxX, maxY]
sv: Parametern bbox måste ha formatet [minX, minY, maxX, maxY]
tr: bbox parametresi [minX, minY, maxX, maxY] biçiminde olmalıdır
uk: Параметр bbox має бути у форматі [minX, minY, maxX, maxY]

source: Parameter %(p)s must be coordinates in lat,lon format
de: Parameter %(p)s muss Koordinaten im Format lat,lon enthalten
eo: Parametro %(p)s devas esti koordinatoj en formato lat,lon
it: Il parametro “%(p)s” deve essere delle coordinate in formato lat,lon
sv: Parameter %(p)s måste ha koordinater i lat, lon-format
tr: %(p)s parametresi enlem, boylam biçiminde koordinatlar olmalıdır
uk: Параметр %(p)s має бути координатами у форматі широти та довготи

source: Longitude in parameter %(p)s is not valid (should be between -180 and 180)
de: Längengrad in Parameter %(p)s ist nicht gültig (muss zwischen -180 und 180 sein)
eo: Longitudo en parametro %(p)s ne estas valida (devas esti inter -180 kaj 180)
it: Il parametro longitudine “%(p)s” non è valido (dovrebbe essere compreso tra -180 e 180)
sv: Longitud i parameter %(p)s är inte giltig (bör vara mellan -180 och 180)
tr: %(p)s parametresindeki boylam geçerli değil (-180 ile 180 arasında olmalıdır)
uk: Довгота в параметрі %(p)s недійсна (має бути між -180 та 180)

source: Latitude in parameter %(p)s is not valid (should be between -90 and 90)
de: Breitengrad in Parameter %(p)s ist nicht gültig (muss zwischen -90 und 90 sein)
eo: Latitudo en parametro %(p)s ne estas valida (devas esti inter -90 kaj 90)
it: Il parametro latitudine “%(p)s” non è valido (dovrebbe essere compreso tra -90 e 90)
sv: Latitud i parameter %(p)s är inte giltig (bör vara mellan -90 och 90)
tr: %(p)s parametresindeki enlem geçerli bir değer değil (-90 ile 90 arasında olmalı)
uk: Широта в параметрі %(p)s недійсна (має бути між -90 та 90)

source: Parameter %(p)s is invalid (should be a distance range in meters like "5-15")
de: Parameter %(p)s ist nicht gültig (muss eine Distanzspanne in Metern (z. B. "5-15") sein
eo: Parametro %(p)s estas nevalida (devas esti distanca intervalo en metroj kiel "5-15")
it: Il parametro “%(p)s” non è valido (dovrebbe essere un intervallo di distanze in metri tipo "5-15")
sv: Parametern %(p)s är ogiltig (bör vara ett avståndsområde i meter som "5-15")
tr: %(p)s parametresi geçersiz ("5-15" gibi metre cinsinden bir mesafe aralığı olmalıdır)
uk: Параметр %(p)s недійсний (має бути діапазон відстаней у метрах, наприклад, "5-15")

source: Parameter %(p)s has a min value greater than its max value
de: Parameter %(p)s hat einen Minimalwert der größer als der Maximalwert ist
eo: Parametro %(p)s havas minimuman valoron pli grandan ol ĝia maksimuma valoro
it: Il parametro“%(p)s” ha un valore minimo più grande del suo valore massimo
sv: Parameter %(p)s har ett minvärde som är större än dess maxvärde
tr: %(p)s parametresi max value değerinden daha büyük min value değerine sahiptir
uk: Параметр %(p)s має мінімальне значення, більше за максимальне

source: Parameter %(p)s must be a valid list
de: Parameter %(p)s muss eine gültige Liste sein
eo: Parametro %(p)s devas esti valida listo
it: Il parametro “%(p)s” deve essere una lista valida
sv: Parameter %(p)s måste vara en giltig lista
tr: %(p)s parametresi geçerli bir liste olmalı
uk: Параметр %(p)s має бути дійсним списком

source: Unsupported sortby parameter: invalid column name
de: Nicht unterstützter "sortby"-Parameter: Ungültiger Spaltenname
eo: La parametro sortby ne estas subtenata: nevalida kolumna nomo
it: Parametro di ordinamento non supportato: nome della colonna non valido
sv: Sorteringsparameter som inte stöds: ogiltigt kolumnnamn
tr: Desteklenmeyen sıralama parametresi: geçersiz sütun adı
uk: Непідтримуваний параметр сортування: недійсна назва стовпця

source: Unsupported sortby parameter: syntax isn't correct
de: Nicht unterstützter "sortby"-Parameter: Syntax ist nicht korrekt
eo: La parametro "sortby" ne estas subtenata: la sintakso ne estas ĝusta
it: Parametro di ordinamento non supportato: la sintassi non è corretta
sv: Sorteringsparameter som inte stöds: syntaxen är inte korrekt
tr: Desteklenmeyen sıralama parametresi: sözdizimi doğru değil
uk: Непідтримуваний параметр сортування: синтаксис неправильний

source: limit parameter should be a valid, positive integer (between 1 and %(v)s)
de: Parameter "limit" muss eine gültige, positive Ganzzahl sein (zwischen 1 und %(v)s)
eo: Parametro limit devus esti valida, pozitiva entjero (inter 1 kaj %(v)s)
it: Il parametro “limit” dovrebbe essere un numero intero valido e positivo (da 1 a %(v)s)
sv: limit parameter bör vara ett giltigt, positivt heltal (mellan 1 och %(v)s)
tr: limit parametresi geçerli, pozitif bir tam sayı olmalıdır (1 ile %(v)s arasında)
uk: параметр ліміту має бути дійсним додатним цілим числом (від 1 до %(v)s)

source: limit parameter should be an integer between 1 and %(v)s
de: Parameter "limit" muss eine Ganzzahl zwischen 1 und %(v)s sein
eo: Parametro limit devus esti entjero inter 1 kaj %(v)s
it: Il parametro “limit” dovrebbe essere un numero intero compreso tra 1 e %(v)s
sv: gränsparametern ska vara ett heltal mellan 1 och %(v)s
tr: limit parametresi 1 ile %(v)s arasında bir tam sayı olmalıdır
uk: Параметр граничного значення має бути цілим числом від 1 до %(v)s

source: longitude needs to be between -180 and 180
de: Längengrad muss zwischen -180 und 180 liegen
eo: Longitudo devas esti inter -180 kaj 180
it: La longitudine deve essere compresa tra -180 e 180
sv: longitud måste vara mellan -180 och 180
tr: boylamın -180 ile 180 arasında olması gerekir
uk: Довгота має бути між -180 та 180

source: latitude needs to be between -90 and 90
de: Breitengrad muss zwischen -90 und 90 liegen
eo: Latitudo devas esti inter -90 kaj 90
it: La latitudine deve essere compresa tra -90 e 90
sv: latitud måste vara mellan -90 och 90
tr: enlemin -90 ile 90 arasında olması gerekir
uk: широта має бути між -90 та 90

source: Tiles are not available for flat pictures
de: Kacheln sind nicht verfügbar für flache Fotos
eo: Kaheloj ne disponeblas por plataj bildoj
it: Le mattonelle non sono disponibili per le foto classiche
sv: Tiles finns inte för platta bilder
tr: Düz resimler için döşemeler mevcut değildir
uk: Плитки недоступні для плоских зображень

source: Column parameter is invalid, should be an integer
de: Parameter column ist ungültig, muss eine Ganzzahl sein
eo: Parametro de kolumno estas nevalida, ĝi devus esti entjero
it: Il parametro colonna non è valido, dovrebbe essere un numero intero
sv: Kolumnparametern är ogiltig, bör vara ett heltal
tr: Sütun parametresi geçersiz, tam sayı olmalı
uk: Параметр стовпця недійсний, має бути цілим числом

source: Column parameter is invalid
de: Parameter column ist ungültig
eo: Parametro de kolumno estas nevalida
it: Il parametro colonna non è valido
sv: Kolumnparametern är ogiltig
tr: Sütun parametresi geçersiz
uk: Параметр стовпця недійсний

source: Row parameter is invalid, should be an integer
de: Parameter row ist ungültig, muss eine Ganzzahl sein
eo: Parametro "row" estas nevalida, ĝi devus esti entjero
it: Il parametro riga non è valida, dovrebbe essere un numero intero
sv: Radparametern är ogiltig, bör vara ett heltal
tr: Satır parametresi geçersiz, tam sayı olmalı
uk: Параметр рядка недійсний, має бути цілим числом

source: Row parameter is invalid
de: Parameter row ist ungültig
eo: Parametro "row" estas nevalida
it: Il parametro riga non è valido
sv: Radparametern är ogiltig
tr: Satır parametresi geçersiz
uk: Параметр рядка недійсний

source: Sequence "%(name)s" by "%(user)s" was captured on %(date)s.
de: Sequenz "%(name)s" von "%(user)s" wurde am %(date)s aufgenommen.
eo: Sekvenco "%(name)s" de "%(user)s" estis kaptita je %(date)s.
it: La sequenza “%(name)s” di “%(user)s” è stata acquisita il %(date)s.
sv: Sekvensen "%(name)s" av "%(user)s" togs den %(date)s.
tr: %(user)s tarafından %(name)s sekansı %(date)s tarihinde yakalandı.
uk: Послідовність "%(name)s" від "%(user)s" була записана %(date)s.

source: View on the map
de: Auf der Karte ansehen
eo: Vidi sur la mapo
it: Vedi sulla mappa
tr: Haritada görüntüle
uk: Переглянути на карті

source: JSON metadata
de: JSON-Metadaten
eo: JSON-metadatumoj
it: Metadata JSON
tr: JSON meta veri
uk: Метадані JSON

source: GeoVisio collections
de: Sammlungen von GeoVisio
eo: GeoVisio-sekvencoj
it: Collezioni GeoVisio
sv: GeoVisio samlingar
tr: GeoVisio koleksiyonları
uk: Колекції GeoVisio

source: List of collections from this GeoVisio server
de: Liste der Sammlungen von diesem GeoVisio-Server
eo: Listo de sekvencoj de ĉi tiu GeoVisio-servilo
it: Elenco delle collezioni su questo server GeoVisio
sv: Lista över samlingar från denna GeoVisio-server
tr: Bu GeoVisio sunucusundaki koleksiyonların listesi
uk: Список колекцій з цього сервера GeoVisio

source: Impossible to find token
de: Konnte Token nicht finden
eo: Ne eblas trovi la tokenon
it: Impossibile trovare il token
sv: Omöjligt att hitta token
tr: Jeton bulmak imkansız
uk: Неможливо знайти токен

source: Impossible to generate a new token
de: Konnte keinen neuen Token generieren
eo: Ne eblas generi novan tokenon
it: Impossibile generare un nuovo token
sv: Omöjligt att generera en ny token
tr: Yeni bir jeton oluşturmak imkansız
uk: Неможливо згенерувати новий токен

source: Token already claimed by another account
de: Token bereits von einem anderen Account verwendet
eo: Tokeno jam estas asignita al alia konto
it: Il token è già stato richiesto da un’altra utenza
sv: Token har redan gjorts anspråk på av ett annat konto
tr: Jeton başka bir hesap tarafından zaten talep edildi
uk: Токен вже заявлений іншим обліковим записом

source: Impossible to create an UploadSet
de: Konnte UploadSet nicht erstellen
eo: Ne eblas krei UploadSet
it: Impossibile creare un “UploadSet”
sv: Omöjligt att skapa ett UploadSet
tr: Bir UploadSet oluşturmak imkansız
uk: Неможливо створити UploadSet

source: Parameter for creating an UploadSet should be a valid JSON
de: Parameter zur Erstellung eines UploadSet muss gültiges JSON sein
eo: Parametro por krei UploadSet devus esti valida JSON
it: Il parametro per creare un “UploadSet” dovrebbe essere un JSON valido
sv: Parametern för att skapa en UploadSet bör vara giltig JSON
tr: UploadSet oluşturmak için parametre geçerli bir JSON olmalıdır
uk: Параметр для створення UploadSet має бути дійсним JSON

source: UploadSet doesn't exist
de: UploadSet existiert nicht
eo: UploadSet ne ekzistas
it: “UploadSet“ inesistente
sv: UploadSet finns inte
tr: UploadSet mevcut değil
uk: Об'єкта UploadSet не існує

source: Impossible to parse parameters
de: Konnte Parameter nicht einlesen
eo: Ne eblas analizi parametrojn
it: Impossibile analizzare i parametri
sv: Omöjligt att bearbeta paramterar
tr: Parametreleri ayrıştırmak imkansız
uk: Неможливо розібрати параметри

source: Parameter `override_capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
de: Parameter `override_capture_time` ist kein gültiger Zeitstempel, muss ein ISO-formatierter Zeitstempel sein (z. B. '2017-07-21T17:32:28Z').
eo: Parametro `override_capture_time` ne estas valida dato kaj horo, ĝi devus esti ISO-formata (kiel '2017-07-21T17:32:28Z').
it: Il parametro `override_capture_time` non è un “datetime” valido, dovrebbe essere in un formato “datetime” ISO (ad es. '2017-07-21T17:32:28Z').
sv: Parametern "override_capture_time" är inte en giltig datumtid, den bör vara en isoformaterad datumtid (t.e.x. "2017-07-21T17:32:28Z").
tr: `override_capture_time` parametresi geçerli bir tarih ve saat değil, iso biçimli bir tarih ve saat olmalıdır (örneğin '2017-07-21T17:32:28Z').
uk: Параметр `override_capture_time` не є коректною датою та часом, він має бути у форматі ISO (наприклад, '2017-07-21T17:32:28Z').

source: No file was sent
de: Es wurde keine Datei gesendet
eo: Neniu dosiero estis sendita
it: Nessun file è stato inviato
sv: Ingen fil skickades
tr: Hiçbir dosya gönderilmedi
uk: Файл не було надіслано

source: UploadSet %(u)s does not exist
de: UploadSet %(u)s existiert nicht
eo: UploadSet %(u)s ne ekzistas
it: “UploadSet” %(u)s inesistente
sv: UploadSet %(u)s finns inte
tr: %(u)s UploadSet mevcut değil
uk: Набір завантажень %(u)s не існує

source: You're not authorized to add picture to this collection
de: Du bist nicht berechtigt, Bilder zu dieser Sammlung hinzuzufügen
eo: Vi ne estas rajtigita aldoni bildon al ĉi tiu kolekto
it: Non siete autorizzati ad aggiungere foto a questa collezione
sv: Du har inte behörighet att lägga till bilder i den här samlingen
tr: Bu koleksiyona resim ekleme yetkiniz yok
uk: Ви не маєте права додавати зображення до цієї колекції

source: The upload set is already completed, files cannot be pushed to it
de: Dieses UploadSet ist bereits komplett, Dateien können nicht hinzugefügt werden

source: The item has already been added to this upload set
de: Das Element wurde bereits zu diesem UploadSet hinzugefügt
eo: La ero jam estis aldonita al ĉi tiu alŝutaro
it: L’elemento è già stato aggiunto a questo “upload set”
sv: Objektet har redan lagts till i denna upload set
tr: Öğe zaten bu yükleme setine eklendi
uk: Цей елемент вже додано до цього набору для завантаження
