Repository: pypi-data/pypi-mirror-396
Catalog: packages/geovisio/geovisio-2.11.0.tar.gz/geovisio-2.11.0/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: de, eo, it, sv, tr, uk

source: Simple 360° geolocated pictures hosting
de: Einfaches Hosting von geolokalisierten Fotos
eo: Simpla gastigado de 360° geolokitaj bildoj
it: Semplice hosting di immagini sferiche georeferenziate
sv: Enkel 360° geolokaliserade bilder hysning
tr: Basit 360° coğrafi konumlu resim barındırma
uk: Простий хостинг фотографій з геолокацією 360°

source: Full page version
de: Vollbildversion
eo: Plenpaĝa versio
it: Versione a pagina intera
sv: Helsidesversion
tr: Tam sayfa versiyon
uk: Повна версія сторінки

source: Viewer
de: Betrachter
eo: Rigardilo
it: Visualizzatore
sv: Visare
tr: Görüntüleyici
uk: Переглядач

source: Embed pre-configured viewer
de: Vorkonfigurierten Betrachter einbetten
eo: Enmeti antaŭkonfiguran rigardilon
it: Incorpora visualizzatore pre-configurato
sv: Bädda in förkonfigurerad visningsprogram
tr: Önceden yapılandırılmış görüntüleyiciyi yerleştir
uk: Вбудувати попередньо налаштований переглядач

source: Easiest way to have a working GeoVisio viewer on your website
de: Die einfachste Methode um den GeoVisio-Betrachter auf deiner Webseite einzubinden
eo: La plej facila maniero havi funkciantan GeoVisio-rigardilon en via retejo
it: Il metodo più semplice per ottenere un visualizzatore GeoVisio funzionante sul tuo sito web
sv: Enklaste sättet att ha en fungerande GeoVisio-visare på din webbplats
tr: Web sitenizde çalışan bir GeoVisio görüntüleyicisine sahip olmanın en kolay yolu
uk: Найпростіший спосіб встановити на своєму веб-сайті робочий переглядач GeoVisio

source: Use JS library
de: JS-Bibliothek verwenden
eo: Uzu JS-bibliotekon
it: Utilizza libreria JS
sv: Använd JS-bibliotek
tr: JS kütüphanesi kullan
uk: Використовувати бібліотеку JS

source: A completely configurable viewer for your website
de: Ein vollständig konfigurierbarer Betrachter für deine Webseite
eo: Komplete agordebla rigardilo por via retejo
it: Un visualizzatore completamente configurabile per il tuo sito web
sv: En helt konfigurerbar visningsprogram för din webbplats
tr: Web siteniz için tamamen yapılandırılabilir bir görüntüleyici
uk: Повністю настроюваний переглядач для вашого веб-сайту

source: Pictures viewer
de: Bildbetrachter
eo: Bildrigardilo
it: Visualizzatore foto
sv: Bildvisare
tr: Resim görüntüleyici
uk: Переглядач зображень

source: API docs
de: API-Dokumentation
eo: API-dokumentoj
it: Doc delle API
sv: API dokumentation
tr: API dökümanları
uk: Документація API

source: JS library docs
de: Dokumentation der JS-Bibliothek
eo: JS-bibliotekaj dokumentoj
it: Doc libreria JS
sv: JS biblioteks dokumentation
tr: JS kütüphanesi dökümanları
uk: Документація бібліотеки JS

source: Repositories
de: Repositorys
eo: Deponejoj
it: Repository
sv: Utvecklingskataloger
tr: Depolar
uk: Репозиторії

source: You need to enable JavaScript to run this app.
de: JavaScript muss aktiviert sein, um diese Applikation zu verwenden.
eo: Vi devas ebligi JavaScript por funkciigi ĉi tiun aplikaĵon.
it: JavaScript deve essere abilitato per eseguire questa app.
sv: Du måste aktivera JavaScript för att köra den här appen.
tr: Uygulamayı çalıştırabilmek için JavaScript etkinleştirmelisiniz.
uk: Для запуску цього додатка необхідно увімкнути JavaScript.

source: Authentication is mandatory
de: Authentifizierung ist erforderlich
eo: Aŭtentikigo estas deviga
it: È obbligatoria l’autenticazione
sv: Autentisering är obligatorisk
tr: Kimlik doğrulama zorunludur
uk: Аутентифікація є обов'язковою

source: Only Bearer token are supported
de: Nur "Bearer-Token" werden unterstützt
eo: Nur Bearer-ĵetonoj estas subtenataj
it: Sono supportati solamente i “Bearer Token”
sv: Only Bearer token stöds
tr: Yalnızca Bearer token desteklenmektedir
uk: Підтримуються лише токени-носії

source: Invalid '%(format)s' format for image, only the following formats are available: %(allowed_formats)s
de: Ungültiges Bildformat "%(format)s". Es sind nur die folgenden Formate verfügbar: %(allowed_formats)s
eo: Nevalida bildformato '%(format)s', nur la sekvaj formatoj estas disponeblaj: %(allowed_formats)s
it: Formato dell’immagine '%(format)s' invalido, sono disponibili solamente i seguenti formati: %(allowed_formats)s
sv: Ogiltigt '%(format)s'-format för bild, endast följande format är tillgängliga: %(allowed_formats)s
tr: Görüntü için geçersiz '%(format)s' biçimi, yalnızca aşağıdaki biçimler kullanılabilir: %(allowed_formats)s
uk: Неправильний формат зображення '%(format)s', доступні тільки такі формати: %(allowed_formats)s

source: Picture can't be found, you may check its ID
de: Foto nicht gefunden. Überprüfe die ID
eo: Bildo ne trovita, bonvolu kontroli ĝian ID
it: Non è possibile trovare la foto, verificare il suo ID
sv: Bilden kan inte hittas, du kan kontrollera dess ID
tr: Resim bulunamadı, ID bilgisini kontrol edin
uk: Зображення не знайдено, ви можете перевірити його ID

source: Picture is not available (either hidden by admin or processing)
de: Foto ist nicht verfügbar (es ist entweder von einem Admin verborgen oder wird gerade verarbeitet)
eo: Bildo ne disponeblas (kaŝita de administranto aŭ prilaborata)
it: Foto non disponibile (forse nascosta da un amministratore oppure in lavorazione)
sv: Bilden är inte tillgänglig (antingen dold av admin eller bearbetning)
tr: Resim mevcut değil (yönetici tarafından gizlendi veya işleniyor)
uk: Зображення недоступне (приховане адміністратором або обробляється)

source: HD Picture file is not available
de: HD-Foto ist nicht verfügbar
eo: HD-bilddosiero ne disponeblas
it: File della foto HD non disponibile
sv: HD-bildfil är inte tillgänglig
tr: HD resim kullanılamıyor
uk: Файл зображення HD недоступний

source: Picture derivates file are not available
de: Abgeleitete Fotovarianten sind nicht verfügbar
eo: Derivitaj bilddosieroj ne disponeblas
it: File derivati dalla foto non sono disponibili
sv: Derivat av bildfil är inte tillgängligt
tr: Resim türevi dosyası mevcut değil
uk: Файли похідних зображень недоступні

source: Unable to read picture on filesystem
de: Konnte die Fotos auf dem Dateisystem nicht lesen
eo: Ne eblas legi bildon en la dosiersistemo
it: Impossibile leggere la foto nel filesystem
sv: Det går inte att läsa bilden ifrån filsystemet
tr: Dosya sistemindeki resim okunamıyor
uk: Неможливо прочитати зображення у файловій системі

source: Sort by file date is not possible on this sequence (no file date information available on pictures)
de: Sortieren nach Dateidatum ist nicht möglich für diese Sequenz (keine Datumsinformationen in den Fotos verfügbar)
eo: Ordigi laŭ dosiera dato ne eblas por ĉi tiu sekvenco (neniu dosierdatuma informo disponeblas en la bildoj)
it: Impossibile ordinare questa sequenza per data del file (non sono disponibili informazioni sulla data nelle foto)
sv: Sortera efter fildatum är inte möjligt i denna sekvens (ingen fildatuminformation tillgänglig på bilder)
tr: Bu dizide dosya tarihine göre sıralama mümkün değil (resimlerde dosya tarihi bilgisi mevcut değil)
uk: Сортування за датою файлу неможливе для цієї послідовності (інформація про дату файлу на зображеннях відсутня)

source: Sort using %(sort)s is not possible on this sequence, picture %(pic)s is missing mandatory metadata
de: Die Sortierung nach %(sort)s ist für diese Sequenz nicht möglich, Foto %(pic)s fehlen die erforderlichen Metadaten
eo: Ordigi uzante %(sort)s ne eblas por ĉi tiu sekvenco, la bildo %(pic)s mankas necesajn metadatumoj
it: Impossibile ordinare questa sequenza con il metodo %(sort)s, la foto %(pic)s non ha i metadata necessari
sv: Sortera med %(sort)s är inte möjligt i denna sekvens, bild %(pic)s saknar obligatorisk metadata
tr: Bu sekansta %(sort)s kullanılarak sıralama yapmak mümkün değil, %(pic)s resminde zorunlu meta veriler eksik
uk: Сортування за допомогою %(sort)s неможливе для цієї послідовності, зображення %(pic)s не має обов'язкових метаданих

source: JWT token signature does not match
de: Signatur des JWT ist ungültig
eo: La subskribo de la JWT-ĵetono ne kongruas
it: La firma del JWT token non corrisponde
sv: JWT-tokensignaturen matchar inte
tr: JWT jeton imzası eşleşmiyor
uk: Підпис токена JWT не збігається

source: Token does not exist anymore
de: Token existiert nicht mehr
eo: La ĵetono ne plu ekzistas
it: Il token non esiste più
sv: Token existerar inte längre
tr: Jeton artık mevcut değil
uk: Токен більше не існує

source: Token not yet claimed, this token cannot be used yet. Either claim this token or generate a new one
de: Token wurde noch nicht beansprucht und kann noch nicht verwendet werden. Entweder beanspruche den Token oder generiere einen neuen
eo: La ĵetono ankoraŭ ne estas postulita, ĝi ankoraŭ ne povas esti uzata. Aŭ postulu ĉi tiun ĵetonon aŭ generu novan
it: Token non ancora richiesto, questo token non può ancora essere usato. Richiedi questo token oppure generane uno nuovo
sv: Token har ännu inte erhållits, denna token kan inte användas ännu. Gör anspråk på denna token eller generera en ny
tr: Jeton henüz talep edilmedi, bu jeton henüz kullanılamaz. Bu jetonu talep edin veya yeni bir jeton oluşturun
uk: Токен ще не витребуваний, цей токен ще не можна використовувати. Витребуйте цей токен або створіть новий

source: Unsupported filter parameter
de: Nicht unterstützter Filter-Parameter
eo: Nesubtenata filtra parametro
it: Parametro del filtro non supportato
sv: Filterparameter stöds inte
tr: Desteklenmeyen filtre parametresi
uk: Непідтримуваний параметр фільтра

source: Impossible to finish authentication flow
de: Konnte Authentifizierungsprozess nicht abschliessen
eo: Ne eblas kompletigi la aŭtentikigan procezon
it: Impossibile completare il flusso di autenticazione
sv: Omöjligt att avsluta autentiseringsflödet
tr: Kimlik doğrulama akışını tamamlamak imkansız
uk: Неможливо завершити процес автентифікації

source: You can try to clear your cookies and retry. If the problem persists, contact your instance administrator.
de: Du kannst versuchen, deine Cookies zu löschen, und es erneut versuchen. Falls das Problem bestehen bleibt, kontaktiere die Administration deiner Instanz.
eo: Vi povas provi forigi viajn kuketojn kaj reprovi. Se la problemo persistas, kontaktu la administranton de via instanco.
it: Puoi tentare di cancellare i cookie e riprovare. Se il problema persiste, contatta l’amministratore dell’istanza.
sv: Du kan försöka rensa dina cookies och försöka igen. Kontakta din instansadministratör om problemet kvarstår.
tr: Çerezlerinizi temizleyip tekrar deneyebilirsiniz. Sorun devam ederse, örnek yöneticinizle iletişime geçin.
uk: Ви можете спробувати очистити файли cookie та спробувати ще раз. Якщо проблема не зникне, зверніться до адміністратора вашої інстанції.

source: There is no collection created after %(d)s
de: Es gibt keine Sammlung, die nach %(d)s erstellt wurde
eo: Neniu sekvenco kreita post %(d)s
it: Non è presente una collezione creata dopo il %(d)s
sv: Det finns ingen samling skapad efter %(d)s
tr: %(d)s'den sonra oluşturulmuş bir koleksiyon yok
uk: Немає колекції, створеної після %(d)s

source: There is no collection created before %(d)s
de: Es gibt keine Sammlung, die vor %(d)s erstellt wurde
eo: Neniu sekvenco kreita antaŭ %(d)s
it: Non è presente una collezione creata prima del %(d)s
sv: Det finns ingen samling skapad före %(d)s
tr: %(d)s'den önce oluşturulmuş bir koleksiyon yok
uk: Немає колекції, створеної до %(d)s

source: Collection doesn't exist
de: Sammlung existiert nicht
eo: La kolekto ne ekzistas
it: La collezione non esiste
sv: Samlingen finns inte
tr: Koleksiyon mevcut değil
uk: Колекція не існує

source: Impossible to find a thumbnail for the collection
de: Konnte kein Vorschaubild für die Sammlung finden
eo: Ne eblas trovi miniaturo por la kolekto
it: Impossibile trovare una miniatura per la collezione
sv: Omöjligt att hitta en miniatyrbild för samlingen
tr: Koleksiyon için bir küçük resim bulmak imkansız
uk: Неможливо знайти мініатюру для колекції

source: Picture visibility parameter (visible) should be either unset, true or false
de: Einstellung für die Sichtbarkeit des Fotos ("visible") muss entweder leer, "true" oder "false" sein
eo: La parametro pri bilda videbleco ("visible") devas esti nuligita, "true" aŭ "false"
it: Il parametro di visibilità della foto (“visibile”) dovrebbe essere non impostato, vero o falso
sv: Bildsynlighetsparameter (synlig) ska vara antingen inte satt, sann eller falsk
tr: Resim görünürlük parametresi (görünür) ayarlanmamış, doğru veya yanlış olmalıdır
uk: Параметр видимості зображення (visible) повинен бути або не встановлений, або true, або false

source: Sequence title is not valid, should be a string with a max of 250 characters
de: Sequenztitel ist invalide, sollte ein String mit maximal 250 Zeichen sein
eo: La titolo de la sekvenco ne validas, ĝi devas esti ĉeno kun maksimume 250 signoj
it: Il titolo della sequenza non è valido, dovrebbe essere un testo di massimo 250 caratteri

source: Sort order parameter is invalid
de: Parameter für Sortierreihenfolge ist ungültig
eo: La parametro pri ordiga ordo estas nevalida
it: Il parametro di ordinamento non è valido
sv: Parametern för sorteringsordning är ogiltig
tr: Sıralama düzeni parametresi geçersiz
uk: Параметр сортування недійсний

source: Relative heading is not valid, should be an integer in degrees from -180 to 180
de: Die relative Richtung ist ungültig, sie muss eine Ganzzahl in Grad zwischen -180 und 180 sein
eo: La relativa direkto ne validas, ĝi devas esti entjero en gradoj inter -180 kaj 180
it: La direzione relativa non è valida, dovrebbe essere un numero intero da -180 a 180 gradi
sv: Relativ kompassriktning är inte giltig, bör vara ett heltal i grader från -180 till 180
tr: Bağıl başlık geçerli değil, -180 ile 180 arasında derece cinsinden bir tam sayı olmalıdır
uk: Відносний курс недійсний, повинен бути цілим числом у градусах від -180 до 180

source: Sequence %(c)s wasn't found in database
de: Sequenz %(c)s wurde nicht in der Datenbank gefunden

source: You're not authorized to edit this sequence
de: Sie sind nicht autorisiert diese Sequenz zu editieren
eo: Vi ne estas rajtigita redakti ĉi tiun sekvencon
it: Non siete autorizzati a modificare questa sequenza

source: Sequence %(c)s is in %(s)s state, its visibility can't be changed for now
de: Sequenz %(c)s ist im Status %(s)s, die Sichtbarkeit kann zurzeit nicht geändert werden
eo: Sekvenco %(c)s estas en stato %(s)s, ĝia videbleco ne povas esti ŝanĝita nun
it: La sequenza %(c)s è nello stato %(s)s, la sua visibilità non può essere modificata per ora
sv: Sekvens %(c)s är i ett tillstånd av %(s)s, dess synlighet kan inte ändras för närvarande
tr: Sekans %(c)s %(s)s durumundadır, görünürlüğü şimdilik değiştirilemez
uk: Послідовність %(c)s перебуває у стані %(s)s, її видимість наразі не може бути змінена

source: Collection %(c)s wasn't found in database
de: Sammlung %(c)s wurde nicht in der Datenbank gefunden
eo: Sekvenco %(c)s ne troviĝis en la datumbazo
it: La collezione %(c)s non è stata trovata nel database
sv: Samlingen %(c)s hittades inte i databasen
tr: %(c)s koleksiyonu veritabanında bulunamadı
uk: Колекція %(c)s не знайдена в базі даних

source: Sequence doesn't exists
de: Sequenz existiert nicht
tr: Sekans mevcut değil
uk: Послідовності не існує

source: Impossible to find user %(u)s
de: Nutzer %(u)s konnte nicht gefunden werden
eo: Ne eblas trovi uzanton %(u)s
it: Impossibile trovare l’utente %(u)s
sv: Omöjligt att hitta användare %(u)s
tr: %(u)s kullanıcısını bulmak imkansız
uk: Неможливо знайти користувача %(u)s

source: No data loaded for user %(u)s
de: Keine Daten für Nutzer %(u)s geladen
eo: Ne estas datumoj ŝarĝitaj por uzanto %(u)s
it: Nessun dato caricato per l’utente %(u)s
sv: Ingen data laddad för användaren %(u)s
tr: Kullanıcı %(u)s için veri yüklenmedi
uk: Дані для користувача %(u)s не завантажено

source: No matching sequences found
de: Keine passende Sequenzen gefunden
eo: Ne estis trovitaj kongruaj sekvencoj
it: Nessuna sequenza corrispondente trovata
sv: Inga matchande sekvenser hittades
tr: Eşleşen sekans bulunamadı
uk: Відповідних послідовностей не знайдено

source: limit parameter should be an integer between 1 and 10000
de: Limit-Parameter muss eine Ganzzahl zwischen 1 und 10000 sein
eo: La parametro de limigo devus esti entjero inter 1 kaj 10000
it: il parametro limite dovrebbe essere un numero intero tra 1 e 10000
sv: gränsparametern ska vara ett heltal mellan 1 och 10 000
tr: limit parametresi 1 ile 10000 arasında bir tam sayı olmalıdır
uk: Параметр ліміту має бути цілим числом від 1 до 10000

source: limit parameter should be a valid, positive integer (between 1 and 10000)
de: Limit-Parameter muss eine gültige, positive Ganzzahl sein (zwischen 1 und 10000)
eo: La parametro de limigo devus esti valida, pozitiva entjero (inter 1 kaj 10000)
it: il parametro limite dovrebbe essere un numero intero positivo valido (tra 1 e 10000)
sv: limit parameter bör vara ett giltigt, positivt heltal (mellan 1 och 10000)
tr: limit parametresi geçerli, pozitif bir tam sayı olmalıdır (1 ile 10000 arasında)
uk: Параметр ліміту має бути дійсним додатним цілим числом (від 1 до 10000)

source: `startAfterRank` and `withPicture` are mutually exclusive parameters
de: `startAfterRank` und `withPicture` schließen sich einander als Parameter aus
eo: `startAfterRank` kaj `withPicture` estas reciproke ekskluzivaj parametroj
it: I parametri `startAfterRank` e `withPicture` sono mutuamente esclusivi
sv: `startAfterRank` och `withPicture` är ömsesidigt uteslutande parametrar
tr: `startAfterRank` ve `withPicture` birbirini dışlayan parametrelerdir
uk: `startAfterRank` та `withPicture` є взаємовиключними параметрами

source: startAfterRank parameter should be a positive integer (starting from 1)
de: startAfterRank-Parameter sollte eine positive Ganzzahl sein (beginnend bei 1)
eo: La parametro startAfterRank devus esti pozitiva entjero (komencante de 1)
it: Il parametro ‘startAfterRank’ dovrebbe essere un numero intero positivo (a partire da 1)
sv: startAfterRank-parametern ska vara ett positivt heltal (med början från 1)
tr: startAfterRank parametresi pozitif bir tam sayı olmalıdır (1'den başlayarak)
uk: Параметр startAfterRank має бути додатним цілим числом (починаючи з 1)

source: startAfterRank parameter should be a valid, positive integer
de: startAfterRank sollte eine gültige, positive Ganzzahl sein
eo: La parametro startAfterRank devus esti valida, pozitiva entjero
it: Il parametro ‘startAfterRank’ dovrebbe essere un numero positivo valido
sv: startAfterRank-parametern ska vara ett giltigt, positivt heltal
tr: startAfterRank parametresi geçerli, pozitif bir tam sayı olmalıdır
uk: Параметр startAfterRank має бути дійсним додатним цілим числом

source: No more items in this collection (last available rank is %(r)s)
de: Keine weiteren Elemente in dieser Sammlung (letzte verfügbare Position ist %(r)s)
eo: Ne estas pliaj fotoj en ĉi tiu kolekto (lasta disponebla rango estas %(r)s)
it: Non sono presenti altri elementi in questa collezione (l’ultimo rango disponibile è %(r)s)
sv: Inga fler föremål i den här samlingen (senast tillgängliga rankning är %(r)s)
tr: Bu koleksiyonda başka öğe yok (son mevcut sıralama %(r)s)
uk: У цій колекції більше немає елементів (останній доступний ранг – %(r)s)

source: Picture with id %(p)s does not exist
de: Foto mit ID %(p)s existiert nicht
eo: Bildo %(p)s ne ekzistas
it: La foto con ID %(p)s non esiste
sv: Bild med id %(p)s finns inte
tr: %(p)s kimlikli resim mevcut değil
uk: Зображення з ідентифікатором %(p)s не існує

source: Item doesn't exist
de: Element existiert nicht
eo: Ero ne ekzistas
it: Elemento non esistente
sv: Objektet finns inte
tr: Öğe mevcut değil
uk: Елемент не існує

source: Search using POST method should have a JSON body
de: Suchanfragen über die POST-Methode müssen einen JSON-Body beinhalten
eo: Serĉo uzante la metodon POST devus havi JSON-korpon
it: La ricerca con il metodo POST dovrebbe avere un corpo JSON
sv: Sök med POST-metoden bör ha en JSON-kropp
tr: POST yöntemini kullanarak yapılan aramanın bir JSON gövdesi olmalıdır
uk: Пошук за допомогою методу POST повинен мати тіло JSON

source: Parameter limit must be either empty or a number between 1 and 10000
de: Parameter-Limits müssen entweder leer sein oder zwischen 1 und 10000 liegen
eo: La parametro limigo devas esti aŭ malplena aŭ numero inter 1 kaj 10000
it: Il parametro limite dovrebbe essere vuoto oppure un numero tra 1 e 10000
sv: Parametergränsen måste vara antingen tom eller ett tal mellan 1 och 10 000
tr: Parametre sınırı ya boş olmalı ya da 1 ile 10000 arasında bir sayı olmalıdır
uk: Параметр ліміту має бути або порожнім, або числом від 1 до 10000

source: Parameter place_fov_tolerance must be either empty or a number between 2 and 180
de: Parameter place_fov_tolerance muss entweder leer sein oder eine Zahl zwischen 2 und 180
eo: La parametro place_fov_tolerance devas esti aŭ malplena aŭ numero inter 2 kaj 180
it: Il parametro ‘place_fov_tolerance’ deve essere vuoto oppure un numero tra 2 e 180
sv: Parametern place_fov_tolerance måste antingen vara tom eller ett tal mellan 2 och 180
tr: place_fov_tolerance parametresi ya boş olmalı ya da 2 ile 180 arasında bir sayı olmalıdır
uk: Параметр place_fov_tolerance має бути або порожнім, або числом від 2 до 180

source: Parameter intersects should contain a valid GeoJSON Geometry (not a Feature)
de: Parameter intersects muss eine gültige GeoJSON-Geometrie sein (kein Feature)
eo: La parametro "intersects" devus enhavi validan GeoJSON Geometrion (ne "Feature")
it: Il parametro ‘intersect’ dovrebbe contenere una geometria GeoJSON valido (non una ‘Feature’)
sv: Parameter intersects ska innehålla en giltig GeoJSON-geometri (inte en Feature)
tr: Parametre kesişimleri geçerli bir GeoJSON Geometrisi (Özellik değil) içermelidir
uk: Перетини параметрів повинні містити дійсну геометрію GeoJSON (не об'єкт)

source: Parameter ids should be a JSON array of strings
de: Parameter ids muss ein JSON-Array von Strings sein
eo: La parametro "ids" devus esti JSON-matrico de ŝnuroj
it: Il parametro ‘ids’ dovrebbe essere un vettore di stringhe JSON
sv: Parameter-IDs ska vara en JSON-array med strängar
tr: Parametre kimlikleri dizelerden oluşan bir JSON dizisi olmalıdır
uk: Ідентифікатори параметрів мають бути масивом рядків JSON

source: Parameter collections should be a JSON array of strings
de: Parameter-Sammlungen müssen ein JSON-Array von Strings sein
eo: La parametro collections devus esti JSON-matrico de ŝnuroj
it: Il parametro ‘collections’ dovrebbe essere un vettore di stringhe JSON
sv: Parametersamlingar ska vara en JSON-array med strängar
tr: Parametre koleksiyonları dizelerden oluşan bir JSON dizisi olmalıdır
uk: Колекції параметрів мають бути масивом рядків JSON

source: Picture doesn't exist
de: Foto existiert nicht
eo: Bildo ne ekzistas
it: Foto inesistente
sv: Bilden finns inte
tr: Resim mevcut değil
uk: Зображення не існує

source: Content type should be multipart/form-data
de: Content type muss "multipart/form-data" sein
eo: La enhavtipo ("Enhavo-tipo") devas esti "multipart/form-data"
it: Il tipo di contenuto dovrebbe essere ‘multipart/form-data’
sv: Innehållstypen bör vara multipart/form-data
tr: İçerik türü multipart/form-data olmalıdır
uk: Тип контенту має бути multipart/form-data

source: Missing "position" parameter
de: Fehlender Parameter "position"
eo: Mankas parametro "position"
it: Parametro “position” mancante
sv: Saknar "position" parameter
tr: "position" parametresi eksik
uk: Відсутній параметр "позиція"
