Repository: pypi-data/pypi-mirror-396
Catalog: packages/chemotools/chemotools-0.2.5.tar.gz/chemotools-0.2.5/docs/locale/*/LC_MESSAGES/methods/index.po
Languages: es

source: Methods
es: Métodos

source: Add random variation in your data to simulate different real-world scenarios.
es: Añade variación aleatoria en tus datos para simular diferentes escenarios del mundo real.

source: Augmentation
es: Aumento de datos

source: Preprocess your data to remove remove noise and highlight the chemical information.
es: Preprocesa tus datos para eliminar ruido y resaltar la información química.

source: Preprocessing
es: Preprocesamiento

source: Select the most chemically relevant features to improve the performance of your model.
es: Selecciona las características químicamente más relevantes para mejorar tu modelo.

source: Feature selection
es: Selección de características

source: Detect outliers from your data to improve diagnostics and reliability of the results.
es: Detecta valores atípicos en tus datos para mejorar el diagnóstico y la confiabilidad de los resultados.

source: Outliers
es: Valores atípicos

source: Create publication-quality visualizations for spectral data and model diagnostics.
es: Crea visualizaciones y gráficas con calidad the publicacion.

source: Interactively explore and diagnose your PCA and PLS models with comprehensive visualizations.
es: Explora y diagnistica tus modelos PCA y PLS con visualizaciones.
